[Survived] BlockStatement
src/mint/Mint.ts:78:48
  * Names the shape of a refused response for logs, without handing the value itself to a
  * consumer-supplied logger that would enumerate it.
  */
-function describeShape(value: unknown): string {
-  return Array.isArray(value) ? 'array' : typeof value;
-}
+function describeShape(value: unknown): string {}
 
 /**

[Killed] BlockStatement
src/mint/Mint.ts:96:77
   private _mintInfo?: MintInfo;
   private _authProvider?: AuthProvider;
   private _lastResponseMetadata: ResponseMeta | undefined = undefined;
-  private readonly _captureResponseMetadata = (meta: ResponseMeta): void => {
-    this._lastResponseMetadata = meta;
-  };
+  private readonly _captureResponseMetadata = (meta: ResponseMeta): void => {};
 
   /**
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/mint/Mint.ts:117:5
       authProvider?: AuthProvider;
       logger?: Logger;
     },
-  ) {
-    this._mintUrl = normalizeMintUrl(mintUrl);
-    if (options?.customRequest) {
-      this._request = options.customRequest;
-    } else if (options?.requestFetch) {
-      const requestFetch = options.requestFetch;
-      this._request = <T>(args: RequestOptions): Promise<T> =>
-        request<T>({ ...args, fetch: requestFetch });
-    } else {
-      this._request = request;
-    }
-    this._authProvider = options?.authProvider;
-    this._logger = options?.logger ?? NULL_LOGGER;
-    setRequestLogger(this._logger);
-  }
+  ) {}
 
   get mintUrl() {
killedBy: wallet.maxSpendableAfterFees returns total minus feeReserve when input fees are zero
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] ConditionalExpression
src/mint/Mint.ts:119:9
     },
   ) {
     this._mintUrl = normalizeMintUrl(mintUrl);
-    if (options?.customRequest) {
+    if (true) {
       this._request = options.customRequest;
     } else if (options?.requestFetch) {
killedBy: createAuthWallet wiring returns hydrated { mint, auth, oidc, wallet } and respects authPool
statusReason: requestInstance is not a function

[Killed] ConditionalExpression
src/mint/Mint.ts:119:9
     },
   ) {
     this._mintUrl = normalizeMintUrl(mintUrl);
-    if (options?.customRequest) {
+    if (false) {
       this._request = options.customRequest;
     } else if (options?.requestFetch) {
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] OptionalChaining
src/mint/Mint.ts:121:16
     this._mintUrl = normalizeMintUrl(mintUrl);
     if (options?.customRequest) {
       this._request = options.customRequest;
-    } else if (options?.requestFetch) {
+    } else if (options.requestFetch) {
       const requestFetch = options.requestFetch;
       this._request = <T>(args: RequestOptions): Promise<T> =>
killedBy: Mint (BOLT12) – instance methods via customRequest does not force /v1/info lookup before operation request
statusReason: Cannot read properties of undefined (reading 'requestFetch')

[Killed] BlockStatement
src/mint/Mint.ts:121:39
     this._mintUrl = normalizeMintUrl(mintUrl);
     if (options?.customRequest) {
       this._request = options.customRequest;
-    } else if (options?.requestFetch) {
-      const requestFetch = options.requestFetch;
-      this._request = <T>(args: RequestOptions): Promise<T> =>
-        request<T>({ ...args, fetch: requestFetch });
-    } else {
+    } else if (options?.requestFetch) {} else {
       this._request = request;
     }
killedBy: Mint normalization keeps transport retry logs on the originating Mint logger
statusReason: expected "vi.fn()" to be called at least once

[Killed] ArrowFunction
src/mint/Mint.ts:123:23
       this._request = options.customRequest;
     } else if (options?.requestFetch) {
       const requestFetch = options.requestFetch;
-      this._request = <T>(args: RequestOptions): Promise<T> =>
-        request<T>({ ...args, fetch: requestFetch });
+      this._request = () => undefined;
     } else {
       this._request = request;
killedBy: test wallet init should pass requestFetch from wallet URL options through the default request pipeline
statusReason: Invalid response from mint

[Killed] BlockStatement
src/mint/Mint.ts:125:12
       const requestFetch = options.requestFetch;
       this._request = <T>(args: RequestOptions): Promise<T> =>
         request<T>({ ...args, fetch: requestFetch });
-    } else {
-      this._request = request;
-    }
+    } else {}
     this._authProvider = options?.authProvider;
     this._logger = options?.logger ?? NULL_LOGGER;
killedBy: createAuthWallet wiring returns hydrated { mint, auth, oidc, wallet } and respects authPool
statusReason: requestInstance is not a function

[Killed] OptionalChaining
src/mint/Mint.ts:128:26
     } else {
       this._request = request;
     }
-    this._authProvider = options?.authProvider;
+    this._authProvider = options.authProvider;
     this._logger = options?.logger ?? NULL_LOGGER;
     setRequestLogger(this._logger);
killedBy: Mint (BOLT12) – instance methods via customRequest does not force /v1/info lookup before operation request
statusReason: Cannot read properties of undefined (reading 'authProvider')

[Killed] OptionalChaining
src/mint/Mint.ts:129:20
       this._request = request;
     }
     this._authProvider = options?.authProvider;
-    this._logger = options?.logger ?? NULL_LOGGER;
+    this._logger = options.logger ?? NULL_LOGGER;
     setRequestLogger(this._logger);
   }
killedBy: Mint (BOLT12) – instance methods via customRequest does not force /v1/info lookup before operation request
statusReason: Cannot read properties of undefined (reading 'logger')

[Killed] LogicalOperator
src/mint/Mint.ts:129:20
       this._request = request;
     }
     this._authProvider = options?.authProvider;
-    this._logger = options?.logger ?? NULL_LOGGER;
+    this._logger = options?.logger && NULL_LOGGER;
     setRequestLogger(this._logger);
   }
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] CallExpression
src/mint/Mint.ts:130:5
     }
     this._authProvider = options?.authProvider;
     this._logger = options?.logger ?? NULL_LOGGER;
-    setRequestLogger(this._logger);
+    ;
   }
 
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/mint/Mint.ts:133:17
     setRequestLogger(this._logger);
   }
 
-  get mintUrl() {
-    return this._mintUrl;
-  }
+  get mintUrl() {}
 
   /**
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/mint/Mint.ts:147:56
    * overwritten by concurrent requests. For more precise tracking, use the global `onResponseMeta`
    * callback. Rate limit policy is not widely supported, so ensure you handle `429` responses.
    */
-  get lastResponseMetadata(): ResponseMeta | undefined {
-    return this._lastResponseMetadata;
-  }
+  get lastResponseMetadata(): ResponseMeta | undefined {}
 
   /**
killedBy: Mint.lastResponseMetadata is populated after a successful request — status 200
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/mint/Mint.ts:164:61
    * // token.access_token is your CAT
    * ```
    */
-  async oidcAuth(opts?: OIDCAuthOptions): Promise<OIDCAuth> {
-    const n21 = (await this.getLazyMintInfo()).nuts['21'];
-    if (!n21?.openid_discovery) {
-      throw new CTSError('Mint: no NUT-21 openid_discovery');
-    }
-    return new OIDCAuth(n21.openid_discovery, {
-      ...opts,
-      clientId: opts?.clientId ?? n21.client_id ?? 'cashu-client',
-    });
-  }
+  async oidcAuth(opts?: OIDCAuthOptions): Promise<OIDCAuth> {}
 
   /**
killedBy: Mint normalization oidcAuth throws when the mint does not advertise NUT-21 discovery metadata
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/mint/Mint.ts:166:33
    */
   async oidcAuth(opts?: OIDCAuthOptions): Promise<OIDCAuth> {
     const n21 = (await this.getLazyMintInfo()).nuts['21'];
-    if (!n21?.openid_discovery) {
-      throw new CTSError('Mint: no NUT-21 openid_discovery');
-    }
+    if (!n21?.openid_discovery) {}
     return new OIDCAuth(n21.openid_discovery, {
       ...opts,
killedBy: Mint normalization oidcAuth throws when the mint does not advertise NUT-21 discovery metadata
statusReason: expected [Function] to throw error including 'Mint: no NUT-21 openid_discovery' but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
src/mint/Mint.ts:166:9
    */
   async oidcAuth(opts?: OIDCAuthOptions): Promise<OIDCAuth> {
     const n21 = (await this.getLazyMintInfo()).nuts['21'];
-    if (!n21?.openid_discovery) {
+    if (true) {
       throw new CTSError('Mint: no NUT-21 openid_discovery');
     }
killedBy: Mint mutation coverage oidcAuth clientId resolution prefers the caller clientId over mint metadata
statusReason: Mint: no NUT-21 openid_discovery

[Killed] OptionalChaining
src/mint/Mint.ts:171:17
     }
     return new OIDCAuth(n21.openid_discovery, {
       ...opts,
-      clientId: opts?.clientId ?? n21.client_id ?? 'cashu-client',
+      clientId: opts.clientId ?? n21.client_id ?? 'cashu-client',
     });
   }
killedBy: Mint mutation coverage oidcAuth clientId resolution falls back to the mint client_id when no opts are given
statusReason: Cannot read properties of undefined (reading 'clientId')

[Killed] LogicalOperator
src/mint/Mint.ts:171:17
     }
     return new OIDCAuth(n21.openid_discovery, {
       ...opts,
-      clientId: opts?.clientId ?? n21.client_id ?? 'cashu-client',
+      clientId: opts?.clientId && n21.client_id ?? 'cashu-client',
     });
   }
killedBy: Mint mutation coverage oidcAuth clientId resolution prefers the caller clientId over mint metadata
statusReason: expected 'mint-client' to be 'my-client' // Object.is equality

[Killed] BlockStatement
src/mint/Mint.ts:181:70
    * @param customRequest Optional override for the request function.
    * @returns The mint's information response.
    */
-  async getInfo(customRequest?: RequestFn): Promise<GetInfoResponse> {
-    const requestInstance = customRequest ?? this._request;
-    const response = await requestInstance<GetInfoResponse>({
-      endpoint: joinUrls(this._mintUrl, '/v1/info'),
-      onResponseMeta: this._captureResponseMetadata,
-      logger: this._logger,
-    });
-    return MintInfo.normalizeInfo(response, this._logger);
-  }
+  async getInfo(customRequest?: RequestFn): Promise<GetInfoResponse> {}
 
   /**
killedBy: test wallet init should initialize with mint instance and load mint info, keys, and keysets
statusReason: Invalid response from mint

[Killed] LogicalOperator
src/mint/Mint.ts:182:29
    * @returns The mint's information response.
    */
   async getInfo(customRequest?: RequestFn): Promise<GetInfoResponse> {
-    const requestInstance = customRequest ?? this._request;
+    const requestInstance = customRequest && this._request;
     const response = await requestInstance<GetInfoResponse>({
       endpoint: joinUrls(this._mintUrl, '/v1/info'),
killedBy: requestTokens test requestTokens
statusReason: requestInstance is not a function

[Killed] BlockStatement
src/mint/Mint.ts:196:71
    *
    * @returns The parsed MintInfo object.
    */
-  async getLazyMintInfo(customRequest?: RequestFn): Promise<MintInfo> {
-    if (this._mintInfo) {
-      return this._mintInfo;
-    }
-    const data = await this.getInfo(customRequest);
-    this._mintInfo = new MintInfo(data, this._logger);
-    return this._mintInfo;
-  }
+  async getLazyMintInfo(customRequest?: RequestFn): Promise<MintInfo> {}
 
   /**
killedBy: Mint normalization caches getLazyMintInfo after the first request
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/mint/Mint.ts:197:25
    * @returns The parsed MintInfo object.
    */
   async getLazyMintInfo(customRequest?: RequestFn): Promise<MintInfo> {
-    if (this._mintInfo) {
-      return this._mintInfo;
-    }
+    if (this._mintInfo) {}
     const data = await this.getInfo(customRequest);
     this._mintInfo = new MintInfo(data, this._logger);
killedBy: Mint normalization caches getLazyMintInfo after the first request
statusReason: expected "vi.fn()" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
src/mint/Mint.ts:197:9
    * @returns The parsed MintInfo object.
    */
   async getLazyMintInfo(customRequest?: RequestFn): Promise<MintInfo> {
-    if (this._mintInfo) {
+    if (false) {
       return this._mintInfo;
     }
killedBy: Mint mutation coverage requestWithAuth does not attach Clear-auth when the endpoint is not clear-protected
statusReason: Invalid response from mint

[Killed] BlockStatement
src/mint/Mint.ts:208:59
   /**
    * Seeds the mint-info cache from already-fetched data.
    */
-  setMintInfo(mintInfo: MintInfo | GetInfoResponse): void {
-    this._mintInfo = mintInfo instanceof MintInfo ? mintInfo : new MintInfo(mintInfo, this._logger);
-  }
+  setMintInfo(mintInfo: MintInfo | GetInfoResponse): void {}
 
   // -----------------------------------------------------------------
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/mint/Mint.ts:223:90
    * @param customRequest Optional override for the request function.
    * @returns Signed outputs.
    */
-  async swap(swapPayload: SwapRequest, customRequest?: RequestFn): Promise<SwapResponse> {
-    failIf(
-      !Array.isArray(swapPayload?.inputs),
-      'swap: inputs must be an array of proofs',
-      this._logger,
-    );
-    // `dleq`, `p2pk_e` and `spend_info` are wallet-side data: keep them off the wire.
-    const data = await this.requestWithAuth<SwapResponse>(
-      'POST',
-      '/v1/swap',
-      { requestBody: { ...swapPayload, inputs: this.stripWalletFields(swapPayload.inputs) } },
-      customRequest,
-    );
-
-    if (!isObj(data) || !Array.isArray(data?.signatures)) {
-      this._logger.error('Invalid response from mint...', { data, op: 'swap' });
-      throw new CTSError('Invalid response from mint');
-    }
-    this.assertSignatureCount(data.signatures, swapPayload.outputs, 'swap');
-    data.signatures = this.normalizeSignatureAmounts(data.signatures);
-
-    return data;
-  }
+  async swap(swapPayload: SwapRequest, customRequest?: RequestFn): Promise<SwapResponse> {}
 
   // -----------------------------------------------------------------
killedBy: Mint normalization passes auth headers and NUT-19 retry policy through requestWithAuth
statusReason: expected "vi.fn()" to be called at least once

[Killed] BooleanLiteral
src/mint/Mint.ts:225:7
    */
   async swap(swapPayload: SwapRequest, customRequest?: RequestFn): Promise<SwapResponse> {
     failIf(
-      !Array.isArray(swapPayload?.inputs),
+      Array.isArray(swapPayload?.inputs),
       'swap: inputs must be an array of proofs',
       this._logger,
killedBy: Mint mutation coverage requestWithAuth applies NUT-19 params when mint info is fetched during an authed request
statusReason: swap: inputs must be an array of proofs

[Killed] OptionalChaining
src/mint/Mint.ts:225:22
    */
   async swap(swapPayload: SwapRequest, customRequest?: RequestFn): Promise<SwapResponse> {
     failIf(
-      !Array.isArray(swapPayload?.inputs),
+      !Array.isArray(swapPayload.inputs),
       'swap: inputs must be an array of proofs',
       this._logger,
killedBy: Mint normalization mint payloads (NUT-03/05 inputs) throws when swap inputs are not an array
statusReason: expected [Function] to throw error including 'swap: inputs must be an array of proo…' but got 'Cannot read properties of undefined (…'

[Killed] StringLiteral
src/mint/Mint.ts:226:7
   async swap(swapPayload: SwapRequest, customRequest?: RequestFn): Promise<SwapResponse> {
     failIf(
       !Array.isArray(swapPayload?.inputs),
-      'swap: inputs must be an array of proofs',
+      "",
       this._logger,
     );
killedBy: Mint normalization mint payloads (NUT-03/05 inputs) throws when swap inputs are not an array
statusReason: expected [Function] to throw error including 'swap: inputs must be an array of proo…' but got ''

[Killed] ObjectLiteral
src/mint/Mint.ts:233:22
     const data = await this.requestWithAuth<SwapResponse>(
       'POST',
       '/v1/swap',
-      { requestBody: { ...swapPayload, inputs: this.stripWalletFields(swapPayload.inputs) } },
+      { requestBody: {} },
       customRequest,
     );
killedBy: Mint normalization passes auth headers and NUT-19 retry policy through requestWithAuth
statusReason: expected "vi.fn()" to be called with arguments: [ { method: 'POST', …(2) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
src/mint/Mint.ts:237:9
       customRequest,
     );
 
-    if (!isObj(data) || !Array.isArray(data?.signatures)) {
+    if (true) {
       this._logger.error('Invalid response from mint...', { data, op: 'swap' });
       throw new CTSError('Invalid response from mint');
killedBy: Mint normalization passes auth headers and NUT-19 retry policy through requestWithAuth
statusReason: Invalid response from mint

[Killed] ConditionalExpression
src/mint/Mint.ts:237:9
       customRequest,
     );
 
-    if (!isObj(data) || !Array.isArray(data?.signatures)) {
+    if (false) {
       this._logger.error('Invalid response from mint...', { data, op: 'swap' });
       throw new CTSError('Invalid response from mint');
killedBy: Mint normalization throws on invalid swap responses
statusReason: expected [Function] to throw error including 'Invalid response from mint' but got 'Cannot read properties of undefined (…'

[Killed] ObjectLiteral
src/mint/Mint.ts:238:59
     );
 
     if (!isObj(data) || !Array.isArray(data?.signatures)) {
-      this._logger.error('Invalid response from mint...', { data, op: 'swap' });
+      this._logger.error('Invalid response from mint...', {});
       throw new CTSError('Invalid response from mint');
     }
killedBy: Mint normalization throws on invalid swap responses
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
    "Invalid response from mint...",

[Killed] StringLiteral
src/mint/Mint.ts:238:26
     );
 
     if (!isObj(data) || !Array.isArray(data?.signatures)) {
-      this._logger.error('Invalid response from mint...', { data, op: 'swap' });
+      this._logger.error("", { data, op: 'swap' });
       throw new CTSError('Invalid response from mint');
     }
killedBy: Mint normalization throws on invalid swap responses
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

@@ -1,7 +1,7 @@
  [

[Killed] BlockStatement
src/mint/Mint.ts:269:20
     method: string,
     payload: Record<string, unknown>,
     options?: { customRequest?: RequestFn; normalize?: (raw: Record<string, unknown>) => TRes },
-  ): Promise<TRes> {
-    failIf(!this.isValidMethodString(method), `Invalid mint quote method: ${method}`, this._logger);
-    const response = await this.requestWithAuth<TRes>(
-      'POST',
-      `/v1/mint/quote/${method}`,
-      { requestBody: payload },
-      options?.customRequest,
-    );
-    return this.normalizeMintQuoteResponse(method, response, options?.normalize);
-  }
+  ): Promise<TRes> {}
 
   /**
killedBy: Mint normalization createMintQuoteBolt11 normalizes request and response amounts
statusReason: Cannot read properties of undefined (reading 'amount')

[Killed] BooleanLiteral
src/mint/Mint.ts:270:12
     payload: Record<string, unknown>,
     options?: { customRequest?: RequestFn; normalize?: (raw: Record<string, unknown>) => TRes },
   ): Promise<TRes> {
-    failIf(!this.isValidMethodString(method), `Invalid mint quote method: ${method}`, this._logger);
+    failIf(this.isValidMethodString(method), `Invalid mint quote method: ${method}`, this._logger);
     const response = await this.requestWithAuth<TRes>(
       'POST',
killedBy: Mint normalization createMintQuoteBolt11 normalizes request and response amounts
statusReason: Invalid mint quote method: bolt11

[Killed] StringLiteral
src/mint/Mint.ts:273:7
     failIf(!this.isValidMethodString(method), `Invalid mint quote method: ${method}`, this._logger);
     const response = await this.requestWithAuth<TRes>(
       'POST',
-      `/v1/mint/quote/${method}`,
+      ``,
       { requestBody: payload },
       options?.customRequest,
killedBy: Mint normalization createMintQuoteBolt11 normalizes request and response amounts
statusReason: expected 'https://localhost:3338/' to be 'https://localhost:3338/v1/mint/quote/…' // Object.is equality

[Killed] ObjectLiteral
src/mint/Mint.ts:274:7
     const response = await this.requestWithAuth<TRes>(
       'POST',
       `/v1/mint/quote/${method}`,
-      { requestBody: payload },
+      {},
       options?.customRequest,
     );
killedBy: Mint normalization createMintQuoteBolt11 normalizes request and response amounts
statusReason: Unexpected token 'u' at position 0

[Killed] OptionalChaining
src/mint/Mint.ts:275:7
       'POST',
       `/v1/mint/quote/${method}`,
       { requestBody: payload },
-      options?.customRequest,
+      options.customRequest,
     );
     return this.normalizeMintQuoteResponse(method, response, options?.normalize);
killedBy: Mint mutation coverage generic quote methods without options createMintQuote works without an options argument
statusReason: Cannot read properties of undefined (reading 'customRequest')

[Killed] OptionalChaining
src/mint/Mint.ts:277:62
       { requestBody: payload },
       options?.customRequest,
     );
-    return this.normalizeMintQuoteResponse(method, response, options?.normalize);
+    return this.normalizeMintQuoteResponse(method, response, options.normalize);
   }
 
killedBy: Mint mutation coverage generic quote methods without options createMintQuote works without an options argument
statusReason: Cannot read properties of undefined (reading 'normalize')

[Killed] BlockStatement
src/mint/Mint.ts:292:39
   async createMintQuoteBolt11(
     mintQuotePayload: MintQuoteBolt11Request,
     customRequest?: RequestFn,
-  ): Promise<MintQuoteBolt11Response> {
-    return this.createMintQuote<MintQuoteBolt11Response>(
-      'bolt11',
-      {
-        ...mintQuotePayload,
-        amount: Amount.from(mintQuotePayload.amount).toBigInt(),
-      },
-      { customRequest },
-    );
-  }
+  ): Promise<MintQuoteBolt11Response> {}
 
   /**
killedBy: Mint mutation coverage wrapper methods forward their customRequest argument 'createMintQuoteBolt11' uses the passed customRequest, not the default
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/mint/Mint.ts:316:39
   async createMintQuoteBolt12(
     mintQuotePayload: MintQuoteBolt12Request,
     customRequest?: RequestFn,
-  ): Promise<MintQuoteBolt12Response> {
-    const body: Record<string, unknown> = { ...mintQuotePayload };
-    if (mintQuotePayload.amount !== undefined) {
-      body.amount = Amount.from(mintQuotePayload.amount).toBigInt();
-    }
-    return this.createMintQuote<MintQuoteBolt12Response>('bolt12', body, { customRequest });
-  }
+  ): Promise<MintQuoteBolt12Response> {}
 
   /**
killedBy: createMintQuoteBolt12 mutants omits amount and description when called with no options
statusReason: Cannot read properties of undefined (reading 'pubkey')

[Killed] EqualityOperator
src/mint/Mint.ts:318:9
     customRequest?: RequestFn,
   ): Promise<MintQuoteBolt12Response> {
     const body: Record<string, unknown> = { ...mintQuotePayload };
-    if (mintQuotePayload.amount !== undefined) {
+    if (mintQuotePayload.amount === undefined) {
       body.amount = Amount.from(mintQuotePayload.amount).toBigInt();
     }
killedBy: createMintQuoteBolt12 mutants omits amount and description when called with no options
statusReason: Unsupported amount input type

[Killed] ConditionalExpression
src/mint/Mint.ts:318:9
     customRequest?: RequestFn,
   ): Promise<MintQuoteBolt12Response> {
     const body: Record<string, unknown> = { ...mintQuotePayload };
-    if (mintQuotePayload.amount !== undefined) {
+    if (true) {
       body.amount = Amount.from(mintQuotePayload.amount).toBigInt();
     }
killedBy: createMintQuoteBolt12 mutants omits amount and description when called with no options
statusReason: Unsupported amount input type

[Killed] StringLiteral
src/mint/Mint.ts:321:58
     if (mintQuotePayload.amount !== undefined) {
       body.amount = Amount.from(mintQuotePayload.amount).toBigInt();
     }
-    return this.createMintQuote<MintQuoteBolt12Response>('bolt12', body, { customRequest });
+    return this.createMintQuote<MintQuoteBolt12Response>("", body, { customRequest });
   }
 
killedBy: createMintQuoteBolt12 mutants omits amount and description when called with no options
statusReason: Invalid mint quote method:

[Killed] BlockStatement
src/mint/Mint.ts:337:40
   async createMintQuoteOnchain(
     mintQuotePayload: MintQuoteOnchainRequest,
     customRequest?: RequestFn,
-  ): Promise<MintQuoteOnchainResponse> {
-    return this.createMintQuote<MintQuoteOnchainResponse>('onchain', mintQuotePayload, {
-      customRequest,
-    });
-  }
+  ): Promise<MintQuoteOnchainResponse> {}
 
   // -----------------------------------------------------------------
killedBy: Mint mutation coverage wrapper methods forward their customRequest argument 'createMintQuoteOnchain' uses the passed customRequest, not the default
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] ObjectLiteral
src/mint/Mint.ts:338:88
     mintQuotePayload: MintQuoteOnchainRequest,
     customRequest?: RequestFn,
   ): Promise<MintQuoteOnchainResponse> {
-    return this.createMintQuote<MintQuoteOnchainResponse>('onchain', mintQuotePayload, {
-      customRequest,
-    });
+    return this.createMintQuote<MintQuoteOnchainResponse>('onchain', mintQuotePayload, {});
   }
 
killedBy: Mint mutation coverage wrapper methods forward their customRequest argument 'createMintQuoteOnchain' uses the passed customRequest, not the default
statusReason: default request used

[Killed] StringLiteral
src/mint/Mint.ts:338:59
     mintQuotePayload: MintQuoteOnchainRequest,
     customRequest?: RequestFn,
   ): Promise<MintQuoteOnchainResponse> {
-    return this.createMintQuote<MintQuoteOnchainResponse>('onchain', mintQuotePayload, {
+    return this.createMintQuote<MintQuoteOnchainResponse>("", mintQuotePayload, {
       customRequest,
     });
killedBy: createMintQuoteOnchain mutants fills the wallet unit when the mint response omits it
statusReason: Invalid mint quote method:

[Killed] BlockStatement
src/mint/Mint.ts:363:20
     method: string,
     quote: string,
     options?: { customRequest?: RequestFn; normalize?: (raw: Record<string, unknown>) => TRes },
-  ): Promise<TRes> {
-    failIf(!this.isValidMethodString(method), `Invalid mint quote method: ${method}`, this._logger);
-    const response = await this.requestWithAuth<TRes>(
-      'GET',
-      `/v1/mint/quote/${method}/${quote}`,
-      {},
-      options?.customRequest,
-    );
-    return this.normalizeMintQuoteResponse(method, response, options?.normalize);
-  }
+  ): Promise<TRes> {}
 
   /**
killedBy: Mint mutation coverage generic quote methods without options checkMintQuote works without an options argument and issues a GET
statusReason: Cannot read properties of undefined (reading 'quote')

[Killed] OptionalChaining
src/mint/Mint.ts:369:7
       'GET',
       `/v1/mint/quote/${method}/${quote}`,
       {},
-      options?.customRequest,
+      options.customRequest,
     );
     return this.normalizeMintQuoteResponse(method, response, options?.normalize);
killedBy: Mint mutation coverage generic quote methods without options checkMintQuote works without an options argument and issues a GET
statusReason: Cannot read properties of undefined (reading 'customRequest')

[Killed] BlockStatement
src/mint/Mint.ts:386:39
   async checkMintQuoteBolt11(
     quote: string,
     customRequest?: RequestFn,
-  ): Promise<MintQuoteBolt11Response> {
-    return this.checkMintQuote<MintQuoteBolt11Response>('bolt11', quote, { customRequest });
-  }
+  ): Promise<MintQuoteBolt11Response> {}
 
   /**
killedBy: Mint mutation coverage wrapper methods forward their customRequest argument 'checkMintQuoteBolt11' uses the passed customRequest, not the default
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times
