[Killed] BooleanLiteral
src/mint/Mint.ts:697:12
     payload: Record<string, unknown>,
     options?: { customRequest?: RequestFn; normalize?: (raw: Record<string, unknown>) => TRes },
   ): Promise<TRes> {
-    failIf(!this.isValidMethodString(method), `Invalid melt quote method: ${method}`, this._logger);
+    failIf(this.isValidMethodString(method), `Invalid melt quote method: ${method}`, this._logger);
     const response = await this.requestWithAuth<TRes>(
       'POST',
killedBy: Mint normalization throws for invalid custom method strings
statusReason: expected [Function] to throw error including 'Invalid melt quote method: bad method' but got 'Unsupported amount input type'

[Killed] StringLiteral
src/mint/Mint.ts:697:47
     payload: Record<string, unknown>,
     options?: { customRequest?: RequestFn; normalize?: (raw: Record<string, unknown>) => TRes },
   ): Promise<TRes> {
-    failIf(!this.isValidMethodString(method), `Invalid melt quote method: ${method}`, this._logger);
+    failIf(!this.isValidMethodString(method), ``, this._logger);
     const response = await this.requestWithAuth<TRes>(
       'POST',
killedBy: Mint normalization throws for invalid custom method strings
statusReason: expected [Function] to throw error including 'Invalid melt quote method: bad method' but got ''

[Killed] OptionalChaining
src/mint/Mint.ts:704:62
       { requestBody: payload },
       options?.customRequest,
     );
-    return this.normalizeMeltQuoteResponse(method, response, options?.normalize);
+    return this.normalizeMeltQuoteResponse(method, response, options.normalize);
   }
 
killedBy: Mint mutation coverage generic quote methods without options createMeltQuote works without an options argument
statusReason: Cannot read properties of undefined (reading 'normalize')

[Killed] BlockStatement
src/mint/Mint.ts:719:39
   async createMeltQuoteBolt11(
     meltQuotePayload: MeltQuoteBolt11Request,
     customRequest?: RequestFn,
-  ): Promise<MeltQuoteBolt11Response> {
-    const response = await this.createMeltQuote<MeltQuoteBolt11Response>(
-      'bolt11',
-      this.normalizeMeltQuoteRequestOptions(meltQuotePayload),
-      { customRequest },
-    );
-    // The quote must be for the invoice that was asked for. Bech32 is case insensitive, and an
-    // empty request means the mint echoed nothing back for the caller to compare.
-    failIf(
-      response.request !== '' &&
-        response.request.toLowerCase() !== meltQuotePayload.request.toLowerCase(),
-      'Melt quote is for a different payment request',
-      this._logger,
-    );
-    return response;
-  }
+  ): Promise<MeltQuoteBolt11Response> {}
 
   /**
killedBy: createMeltQuoteBolt11 mutants sends no amountless options and fills unit and request from the wallet/invoice
statusReason: Cannot read properties of undefined (reading 'unit')

[Killed] ConditionalExpression
src/mint/Mint.ts:728:7
     // The quote must be for the invoice that was asked for. Bech32 is case insensitive, and an
     // empty request means the mint echoed nothing back for the caller to compare.
     failIf(
-      response.request !== '' &&
-        response.request.toLowerCase() !== meltQuotePayload.request.toLowerCase(),
+      true,
       'Melt quote is for a different payment request',
       this._logger,
killedBy: Mint normalization createMeltQuoteBolt11 invoice binding accepts a quote that echoes the invoice in a different case
statusReason: Melt quote is for a different payment request

[Killed] ConditionalExpression
src/mint/Mint.ts:728:7
     // The quote must be for the invoice that was asked for. Bech32 is case insensitive, and an
     // empty request means the mint echoed nothing back for the caller to compare.
     failIf(
-      response.request !== '' &&
+      true &&
         response.request.toLowerCase() !== meltQuotePayload.request.toLowerCase(),
       'Melt quote is for a different payment request',
killedBy: createMeltQuoteBolt11 mutants sends no amountless options and fills unit and request from the wallet/invoice
statusReason: Melt quote is for a different payment request

[Killed] MethodExpression
src/mint/Mint.ts:729:44
     // empty request means the mint echoed nothing back for the caller to compare.
     failIf(
       response.request !== '' &&
-        response.request.toLowerCase() !== meltQuotePayload.request.toLowerCase(),
+        response.request.toLowerCase() !== meltQuotePayload.request.toUpperCase(),
       'Melt quote is for a different payment request',
       this._logger,
killedBy: Mint mutation coverage wrapper methods forward their customRequest argument 'createMeltQuoteBolt11' uses the passed customRequest, not the default
statusReason: Melt quote is for a different payment request

[Killed] EqualityOperator
src/mint/Mint.ts:729:9
     // empty request means the mint echoed nothing back for the caller to compare.
     failIf(
       response.request !== '' &&
-        response.request.toLowerCase() !== meltQuotePayload.request.toLowerCase(),
+        response.request.toLowerCase() === meltQuotePayload.request.toLowerCase(),
       'Melt quote is for a different payment request',
       this._logger,
killedBy: Mint mutation coverage wrapper methods forward their customRequest argument 'createMeltQuoteBolt11' uses the passed customRequest, not the default
statusReason: Melt quote is for a different payment request

[Killed] StringLiteral
src/mint/Mint.ts:730:7
     failIf(
       response.request !== '' &&
         response.request.toLowerCase() !== meltQuotePayload.request.toLowerCase(),
-      'Melt quote is for a different payment request',
+      "",
       this._logger,
     );
killedBy: Mint normalization createMeltQuoteBolt11 invoice binding throws when the quote names a different invoice
statusReason: expected [Function] to throw error including 'Melt quote is for a different payment…' but got ''

[Killed] BlockStatement
src/mint/Mint.ts:749:39
   async createMeltQuoteBolt12(
     meltQuotePayload: MeltQuoteBolt12Request,
     customRequest?: RequestFn,
-  ): Promise<MeltQuoteBolt12Response> {
-    return this.createMeltQuote<MeltQuoteBolt12Response>(
-      'bolt12',
-      this.normalizeMeltQuoteRequestOptions(meltQuotePayload),
-      { customRequest },
-    );
-  }
+  ): Promise<MeltQuoteBolt12Response> {}
 
   /**
killedBy: createMeltQuoteBolt12 mutants omits options when no amountMsat is supplied
statusReason: Cannot read properties of undefined (reading 'quote')

[Killed] BlockStatement
src/mint/Mint.ts:770:40
   async createMeltQuoteOnchain(
     meltQuotePayload: MeltQuoteOnchainRequest,
     customRequest?: RequestFn,
-  ): Promise<MeltQuoteOnchainResponse> {
-    return this.createMeltQuote<MeltQuoteOnchainResponse>(
-      'onchain',
-      {
-        ...meltQuotePayload,
-        amount: Amount.from(meltQuotePayload.amount).toBigInt(),
-      },
-      { customRequest },
-    );
-  }
+  ): Promise<MeltQuoteOnchainResponse> {}
 
   // -----------------------------------------------------------------
killedBy: createMeltQuoteOnchain mutants fills a missing response unit from the wallet
statusReason: Cannot read properties of undefined (reading 'unit')

[Killed] ObjectLiteral
src/mint/Mint.ts:773:7
   ): Promise<MeltQuoteOnchainResponse> {
     return this.createMeltQuote<MeltQuoteOnchainResponse>(
       'onchain',
-      {
-        ...meltQuotePayload,
-        amount: Amount.from(meltQuotePayload.amount).toBigInt(),
-      },
+      {},
       { customRequest },
     );
killedBy: generic mint/melt methods wallet.createMeltQuote / checkMeltQuote createMeltQuoteOnchain returns a single quote with normalized fee options
statusReason: HTTP request failed

[Killed] BlockStatement
src/mint/Mint.ts:801:20
     method: string,
     quote: string,
     options?: { customRequest?: RequestFn; normalize?: (raw: Record<string, unknown>) => TRes },
-  ): Promise<TRes> {
-    failIf(!this.isValidMethodString(method), `Invalid melt quote method: ${method}`, this._logger);
-    const response = await this.requestWithAuth<TRes>(
-      'GET',
-      `/v1/melt/quote/${method}/${quote}`,
-      {},
-      options?.customRequest,
-    );
-    const normalized = this.normalizeMeltQuoteResponse(method, response, options?.normalize);
-    if (normalized.quote !== quote) {
-      this._logger.error('Invalid response from mint...', {
-        data: normalized,
-        op: `checkMeltQuote.${method}`,
-      });
-      throw new CTSError('Melt quote response is for a different quote');
-    }
-    return normalized;
-  }
+  ): Promise<TRes> {}
 
   /**
killedBy: Mint mutation coverage generic quote methods without options checkMeltQuote works without an options argument and issues a GET
statusReason: Cannot read properties of undefined (reading 'quote')

[Killed] StringLiteral
src/mint/Mint.ts:804:7
   ): Promise<TRes> {
     failIf(!this.isValidMethodString(method), `Invalid melt quote method: ${method}`, this._logger);
     const response = await this.requestWithAuth<TRes>(
-      'GET',
+      "",
       `/v1/melt/quote/${method}/${quote}`,
       {},
killedBy: Mint normalization checkMeltQuoteBolt11 normalizes amount, fee reserve, and change signatures
statusReason: expected '' to be 'GET' // Object.is equality

[Killed] OptionalChaining
src/mint/Mint.ts:809:74
       {},
       options?.customRequest,
     );
-    const normalized = this.normalizeMeltQuoteResponse(method, response, options?.normalize);
+    const normalized = this.normalizeMeltQuoteResponse(method, response, options.normalize);
     if (normalized.quote !== quote) {
       this._logger.error('Invalid response from mint...', {
killedBy: Mint mutation coverage generic quote methods without options checkMeltQuote works without an options argument and issues a GET
statusReason: Cannot read properties of undefined (reading 'normalize')

[Killed] BlockStatement
src/mint/Mint.ts:810:37
       options?.customRequest,
     );
     const normalized = this.normalizeMeltQuoteResponse(method, response, options?.normalize);
-    if (normalized.quote !== quote) {
-      this._logger.error('Invalid response from mint...', {
-        data: normalized,
-        op: `checkMeltQuote.${method}`,
-      });
-      throw new CTSError('Melt quote response is for a different quote');
-    }
+    if (normalized.quote !== quote) {}
     return normalized;
   }
killedBy: Mint normalization melt responses (NUT-05 quote binding) throws when a checked melt quote reports a different quote id
statusReason: promise resolved "{ quote: 'other-quote', …(8) }" instead of rejecting

[Killed] EqualityOperator
src/mint/Mint.ts:810:9
       options?.customRequest,
     );
     const normalized = this.normalizeMeltQuoteResponse(method, response, options?.normalize);
-    if (normalized.quote !== quote) {
+    if (normalized.quote === quote) {
       this._logger.error('Invalid response from mint...', {
         data: normalized,
killedBy: Mint normalization checkMeltQuoteBolt11 normalizes amount, fee reserve, and change signatures
statusReason: Melt quote response is for a different quote

[Survived] ObjectLiteral
src/mint/Mint.ts:811:59
     );
     const normalized = this.normalizeMeltQuoteResponse(method, response, options?.normalize);
     if (normalized.quote !== quote) {
-      this._logger.error('Invalid response from mint...', {
-        data: normalized,
-        op: `checkMeltQuote.${method}`,
-      });
+      this._logger.error('Invalid response from mint...', {});
       throw new CTSError('Melt quote response is for a different quote');
     }

[Survived] StringLiteral
src/mint/Mint.ts:813:13
     if (normalized.quote !== quote) {
       this._logger.error('Invalid response from mint...', {
         data: normalized,
-        op: `checkMeltQuote.${method}`,
+        op: ``,
       });
       throw new CTSError('Melt quote response is for a different quote');

[Killed] BlockStatement
src/mint/Mint.ts:832:39
   async checkMeltQuoteBolt11(
     quote: string,
     customRequest?: RequestFn,
-  ): Promise<MeltQuoteBolt11Response> {
-    return this.checkMeltQuote<MeltQuoteBolt11Response>('bolt11', quote, { customRequest });
-  }
+  ): Promise<MeltQuoteBolt11Response> {}
 
   /**
killedBy: generic mint/melt methods wallet.createMeltQuote / checkMeltQuote checkMeltQuoteBolt11 does not merge caller fields over mint response
statusReason: Cannot read properties of undefined (reading 'quote')

[Killed] StringLiteral
src/mint/Mint.ts:833:57
     quote: string,
     customRequest?: RequestFn,
   ): Promise<MeltQuoteBolt11Response> {
-    return this.checkMeltQuote<MeltQuoteBolt11Response>('bolt11', quote, { customRequest });
+    return this.checkMeltQuote<MeltQuoteBolt11Response>("", quote, { customRequest });
   }
 
killedBy: generic mint/melt methods wallet.createMeltQuote / checkMeltQuote checkMeltQuoteBolt11 does not merge caller fields over mint response
statusReason: Invalid melt quote method:

[Killed] BlockStatement
src/mint/Mint.ts:849:39
   async checkMeltQuoteBolt12(
     quote: string,
     customRequest?: RequestFn,
-  ): Promise<MeltQuoteBolt12Response> {
-    return this.checkMeltQuote<MeltQuoteBolt12Response>('bolt12', quote, { customRequest });
-  }
+  ): Promise<MeltQuoteBolt12Response> {}
 
   /**
killedBy: Mint normalization throws on invalid melt base responses
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
src/mint/Mint.ts:850:57
     quote: string,
     customRequest?: RequestFn,
   ): Promise<MeltQuoteBolt12Response> {
-    return this.checkMeltQuote<MeltQuoteBolt12Response>('bolt12', quote, { customRequest });
+    return this.checkMeltQuote<MeltQuoteBolt12Response>("", quote, { customRequest });
   }
 
killedBy: Mint (BOLT12) – instance methods via customRequest checkMeltQuoteBolt12 requests /v1/melt/quote/bolt12/{quote}
statusReason: Invalid melt quote method:

[Killed] BlockStatement
src/mint/Mint.ts:866:40
   async checkMeltQuoteOnchain(
     quote: string,
     customRequest?: RequestFn,
-  ): Promise<MeltQuoteOnchainResponse> {
-    return this.checkMeltQuote<MeltQuoteOnchainResponse>('onchain', quote, { customRequest });
-  }
+  ): Promise<MeltQuoteOnchainResponse> {}
 
   // -----------------------------------------------------------------
killedBy: Mint normalization normalizeMeltOnchainFields normalizes a valid onchain melt quote response
statusReason: Cannot read properties of undefined (reading 'fee_options')

[Killed] StringLiteral
src/mint/Mint.ts:867:58
     quote: string,
     customRequest?: RequestFn,
   ): Promise<MeltQuoteOnchainResponse> {
-    return this.checkMeltQuote<MeltQuoteOnchainResponse>('onchain', quote, { customRequest });
+    return this.checkMeltQuote<MeltQuoteOnchainResponse>("", quote, { customRequest });
   }
 
killedBy: generic mint/melt methods wallet.createMintQuote / checkMintQuote checkMeltQuoteOnchain returns normalized onchain melt quote
statusReason: Invalid melt quote method:

[Killed] BooleanLiteral
src/mint/Mint.ts:905:12
       normalize?: (raw: Record<string, unknown>) => MeltQuoteBaseResponse & TRes;
     },
   ): Promise<MeltQuoteBaseResponse & TRes> {
-    failIf(!this.isValidMethodString(method), `Invalid melt method: ${method}`, this._logger);
+    failIf(this.isValidMethodString(method), `Invalid melt method: ${method}`, this._logger);
     failIf(
       !Array.isArray(meltPayload?.inputs),
killedBy: generic mint/melt methods wallet.meltProofs meltProofs with custom method hits /v1/melt/{method}
statusReason: Invalid melt method: bacs

[Killed] StringLiteral
src/mint/Mint.ts:905:47
       normalize?: (raw: Record<string, unknown>) => MeltQuoteBaseResponse & TRes;
     },
   ): Promise<MeltQuoteBaseResponse & TRes> {
-    failIf(!this.isValidMethodString(method), `Invalid melt method: ${method}`, this._logger);
+    failIf(!this.isValidMethodString(method), ``, this._logger);
     failIf(
       !Array.isArray(meltPayload?.inputs),
killedBy: Mint normalization throws for invalid custom method strings
statusReason: expected [Function] to throw error including 'Invalid melt method: bad method' but got ''

[Killed] OptionalChaining
src/mint/Mint.ts:907:22
   ): Promise<MeltQuoteBaseResponse & TRes> {
     failIf(!this.isValidMethodString(method), `Invalid melt method: ${method}`, this._logger);
     failIf(
-      !Array.isArray(meltPayload?.inputs),
+      !Array.isArray(meltPayload.inputs),
       'melt: inputs must be an array of proofs',
       this._logger,
killedBy: Mint normalization mint payloads (NUT-03/05 inputs) throws when melt inputs are not an array
statusReason: expected [Function] to throw error including 'melt: inputs must be an array of proo…' but got 'Cannot read properties of undefined (…'

[Killed] BooleanLiteral
src/mint/Mint.ts:907:7
   ): Promise<MeltQuoteBaseResponse & TRes> {
     failIf(!this.isValidMethodString(method), `Invalid melt method: ${method}`, this._logger);
     failIf(
-      !Array.isArray(meltPayload?.inputs),
+      Array.isArray(meltPayload?.inputs),
       'melt: inputs must be an array of proofs',
       this._logger,
killedBy: generic mint/melt methods wallet.meltProofs meltProofs with custom method hits /v1/melt/{method}
statusReason: melt: inputs must be an array of proofs

[Killed] OptionalChaining
src/mint/Mint.ts:916:7
       'POST',
       `/v1/melt/${method}`,
       { requestBody: { ...meltPayload, inputs: this.stripWalletFields(meltPayload.inputs) } },
-      options?.customRequest,
+      options.customRequest,
     );
     // The proofs are spent by now, so the response is normalized as an execution result.
killedBy: Mint normalization mint payloads (NUT-03/05 inputs) sends melt inputs without dleq and leaves the caller proofs alone
statusReason: Cannot read properties of undefined (reading 'customRequest')

[Killed] BooleanLiteral
src/mint/Mint.ts:919:23
       options?.customRequest,
     );
     // The proofs are spent by now, so the response is normalized as an execution result.
-    const execution = true;
+    const execution = false;
     const normalized = this.normalizeMeltQuoteResponse(
       method,
killedBy: Mint normalization melt responses (NUT-05 quote binding) accepts a melt response that omits the request and fee reserve
statusReason: Invalid response from mint

[Killed] OptionalChaining
src/mint/Mint.ts:923:7
     const normalized = this.normalizeMeltQuoteResponse(
       method,
       response,
-      options?.normalize,
+      options.normalize,
       execution,
     );
killedBy: generic mint/melt methods wallet.meltProofs meltProofs with custom method hits /v1/melt/{method}
statusReason: Cannot read properties of undefined (reading 'normalize')

[Killed] ConditionalExpression
src/mint/Mint.ts:928:9
     );
     // The inputs are spent by now, so a mismatched id must not cost the caller the response it
     // needs to recover its change: keep the id that was asked for and say so.
-    if (normalized.quote !== meltPayload.quote) {
+    if (false) {
       this._logger.warn('Melt response reports a different quote id', {
         op: `melt.${method}`,
killedBy: Mint normalization melt responses (NUT-05 quote binding) keeps the requested quote id when a melt reports a different one
statusReason: expected 'other-quote' to be 'my-quote' // Object.is equality

[Killed] EqualityOperator
src/mint/Mint.ts:928:9
     );
     // The inputs are spent by now, so a mismatched id must not cost the caller the response it
     // needs to recover its change: keep the id that was asked for and say so.
-    if (normalized.quote !== meltPayload.quote) {
+    if (normalized.quote === meltPayload.quote) {
       this._logger.warn('Melt response reports a different quote id', {
         op: `melt.${method}`,
killedBy: Mint normalization melt responses (NUT-05 quote binding) keeps the requested quote id when a melt reports a different one
statusReason: expected 'other-quote' to be 'my-quote' // Object.is equality

[Killed] StringLiteral
src/mint/Mint.ts:929:25
     // The inputs are spent by now, so a mismatched id must not cost the caller the response it
     // needs to recover its change: keep the id that was asked for and say so.
     if (normalized.quote !== meltPayload.quote) {
-      this._logger.warn('Melt response reports a different quote id', {
+      this._logger.warn("", {
         op: `melt.${method}`,
         expected: meltPayload.quote,
killedBy: Mint normalization melt responses (NUT-05 quote binding) keeps the requested quote id when a melt reports a different one
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

@@ -1,7 +1,7 @@
  [

[Killed] StringLiteral
src/mint/Mint.ts:930:13
     // needs to recover its change: keep the id that was asked for and say so.
     if (normalized.quote !== meltPayload.quote) {
       this._logger.warn('Melt response reports a different quote id', {
-        op: `melt.${method}`,
+        op: ``,
         expected: meltPayload.quote,
         received: normalized.quote,
killedBy: Mint normalization melt responses (NUT-05 quote binding) keeps the requested quote id when a melt reports a different one
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
    "Melt response reports a different quote id",

[Killed] BlockStatement
src/mint/Mint.ts:956:39
     options?: {
       customRequest?: RequestFn;
     },
-  ): Promise<MeltQuoteBolt11Response> {
-    return this.melt<MeltQuoteBolt11Response>('bolt11', meltPayload, options);
-  }
+  ): Promise<MeltQuoteBolt11Response> {}
 
   /**
killedBy: Mint normalization mint payloads (NUT-03/05 inputs) sends melt inputs without dleq and leaves the caller proofs alone
statusReason: Cannot convert undefined or null to object

[Killed] StringLiteral
src/mint/Mint.ts:957:47
       customRequest?: RequestFn;
     },
   ): Promise<MeltQuoteBolt11Response> {
-    return this.melt<MeltQuoteBolt11Response>('bolt11', meltPayload, options);
+    return this.melt<MeltQuoteBolt11Response>("", meltPayload, options);
   }
 
killedBy: Mint normalization mint payloads (NUT-03/05 inputs) sends melt inputs without dleq and leaves the caller proofs alone
statusReason: Invalid melt method:

[Killed] BlockStatement
src/mint/Mint.ts:976:39
     options?: {
       customRequest?: RequestFn;
     },
-  ): Promise<MeltQuoteBolt12Response> {
-    return this.melt<MeltQuoteBolt12Response>('bolt12', meltPayload, options);
-  }
+  ): Promise<MeltQuoteBolt12Response> {}
 
   /**
killedBy: Mint (BOLT12) – instance methods via customRequest meltBolt12 posts to /v1/melt/bolt12
statusReason: Cannot read properties of undefined (reading 'quote')

[Killed] BlockStatement
src/mint/Mint.ts:994:40
   async meltOnchain(
     meltPayload: MeltRequest,
     options?: { customRequest?: RequestFn },
-  ): Promise<MeltQuoteOnchainResponse> {
-    return this.melt<MeltQuoteOnchainResponse>('onchain', meltPayload, options);
-  }
+  ): Promise<MeltQuoteOnchainResponse> {}
 
   // -----------------------------------------------------------------
killedBy: Mint normalization meltOnchain accepts an execution response without fee_options
statusReason: Cannot read properties of undefined (reading 'quote')

[Survived] BooleanLiteral
src/mint/Mint.ts:1016:48
     const data = await this.requestWithAuth<CheckStateResponse>(
       'POST',
       '/v1/checkstate',
-      { requestBody: checkPayload, idempotent: true },
+      { requestBody: checkPayload, idempotent: false },
       customRequest,
     );

[Killed] ConditionalExpression
src/mint/Mint.ts:1022:7
 
     // Per NUT-07 the mint returns one state per requested Y, so the request bounds the response.
     if (
-      !isObj(data) ||
-      !Array.isArray(data?.states) ||
-      data.states.length > checkPayload.Ys.length
+      false
     ) {
       this._logger.error('Invalid response from mint...', { data, op: 'check' });
killedBy: Mint normalization throws on invalid check responses
statusReason: expected [Function] to throw error including 'Invalid response from mint' but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
src/mint/Mint.ts:1022:7
 
     // Per NUT-07 the mint returns one state per requested Y, so the request bounds the response.
     if (
-      !isObj(data) ||
-      !Array.isArray(data?.states) ||
+      false ||
       data.states.length > checkPayload.Ys.length
     ) {
killedBy: Mint normalization throws on invalid check responses
statusReason: expected [Function] to throw error including 'Invalid response from mint' but got 'Cannot read properties of undefined (…'

[Killed] BooleanLiteral
src/mint/Mint.ts:1023:7
     // Per NUT-07 the mint returns one state per requested Y, so the request bounds the response.
     if (
       !isObj(data) ||
-      !Array.isArray(data?.states) ||
+      Array.isArray(data?.states) ||
       data.states.length > checkPayload.Ys.length
     ) {
killedBy: Mint normalization throws on invalid check responses
statusReason: expected [Function] to throw error including 'Invalid response from mint' but got 'Cannot read properties of undefined (…'

[Survived] OptionalChaining
src/mint/Mint.ts:1023:22
     // Per NUT-07 the mint returns one state per requested Y, so the request bounds the response.
     if (
       !isObj(data) ||
-      !Array.isArray(data?.states) ||
+      !Array.isArray(data.states) ||
       data.states.length > checkPayload.Ys.length
     ) {

[Killed] ConditionalExpression
src/mint/Mint.ts:1024:7
     if (
       !isObj(data) ||
       !Array.isArray(data?.states) ||
-      data.states.length > checkPayload.Ys.length
+      false
     ) {
       this._logger.error('Invalid response from mint...', { data, op: 'check' });
killedBy: Mint response shape and cardinality rejects more proof states than identifiers checked
statusReason: promise resolved "{ states: [ { Y: '02y', …(2) } ] }" instead of rejecting

[Killed] EqualityOperator
src/mint/Mint.ts:1024:7
     if (
       !isObj(data) ||
       !Array.isArray(data?.states) ||
-      data.states.length > checkPayload.Ys.length
+      data.states.length <= checkPayload.Ys.length
     ) {
       this._logger.error('Invalid response from mint...', { data, op: 'check' });
killedBy: Mint response shape and cardinality rejects more proof states than identifiers checked
statusReason: promise resolved "{ states: [ { Y: '02y', …(2) } ] }" instead of rejecting

[Killed] BlockStatement
src/mint/Mint.ts:1025:7
       !isObj(data) ||
       !Array.isArray(data?.states) ||
       data.states.length > checkPayload.Ys.length
-    ) {
-      this._logger.error('Invalid response from mint...', { data, op: 'check' });
-      throw new CTSError('Invalid response from mint');
-    }
+    ) {}
 
     this.assertRecordEntries(data.states, 'check');
killedBy: Mint normalization throws on invalid check responses
statusReason: expected [Function] to throw error including 'Invalid response from mint' but got 'Cannot read properties of undefined (…'

[Killed] StringLiteral
src/mint/Mint.ts:1026:71
       !Array.isArray(data?.states) ||
       data.states.length > checkPayload.Ys.length
     ) {
-      this._logger.error('Invalid response from mint...', { data, op: 'check' });
+      this._logger.error('Invalid response from mint...', { data, op: "" });
       throw new CTSError('Invalid response from mint');
     }
killedBy: Mint normalization throws on invalid check responses
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

@@ -2,8 +2,8 @@
    "Invalid response from mint...",

[Killed] StringLiteral
src/mint/Mint.ts:1027:26
       data.states.length > checkPayload.Ys.length
     ) {
       this._logger.error('Invalid response from mint...', { data, op: 'check' });
-      throw new CTSError('Invalid response from mint');
+      throw new CTSError("");
     }
 
killedBy: Mint normalization throws on invalid check responses
statusReason: expected [Function] to throw error including 'Invalid response from mint' but got ''

[Killed] BlockStatement
src/mint/Mint.ts:1035:38
     // Per NUT-07, ProofState.witness is `<str | null>`. Some mints may omit the
     // field instead of sending null; coerce undefined → null so consumers
     // can rely on `state.witness === null` checks.
-    for (const state of data.states) {
-      nullIfUndefined(state, 'witness');
-    }
+    for (const state of data.states) {}
 
     return data;
killedBy: checkProofsStates checkProofsStates with omitted witness coerces undefined → null
statusReason: expected undefined to be null

[Killed] StringLiteral
src/mint/Mint.ts:1036:30
     // field instead of sending null; coerce undefined → null so consumers
     // can rely on `state.witness === null` checks.
     for (const state of data.states) {
-      nullIfUndefined(state, 'witness');
+      nullIfUndefined(state, "");
     }
 
killedBy: checkProofsStates checkProofsStates with omitted witness coerces undefined → null
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/mint/Mint.ts:1056:23
     mintUrl?: string,
     customRequest?: RequestFn,
   ): Promise<GetKeysResponse> {
-    const targetUrl = mintUrl || this._mintUrl;
+    const targetUrl = true;
     // backwards compatibility for base64 encoded keyset ids
     if (keysetId) {
killedBy: wallet.maxSpendableAfterFees returns total minus feeReserve when input fees are zero
statusReason: part.replace is not a function
