[Killed] BlockStatement
src/mint/Mint.ts:1522:79
   /**
    * Mutates `data` in place, normalizing bolt12 mint-quote fields.
    */
-  private normalizeMintQuoteBolt12Fields(data: Record<string, unknown>): void {
-    // Per NUT-25, `amount` is <int|null> — null for amountless offers. Mints that
-    // omit the field altogether get coerced to null (Postel-style); numeric
-    // values are coerced to Amount.
-    nullIfUndefined(data, 'amount');
-    data.amount = data.amount === null ? null : Amount.from(data.amount as Amount);
-  }
+  private normalizeMintQuoteBolt12Fields(data: Record<string, unknown>): void {}
 
   /**
killedBy: Mint normalization createMintQuoteBolt12 coerces omitted amount to null and normalizes paid and issued amounts
statusReason: expected undefined to be null

[Killed] EqualityOperator
src/mint/Mint.ts:1527:19
     // omit the field altogether get coerced to null (Postel-style); numeric
     // values are coerced to Amount.
     nullIfUndefined(data, 'amount');
-    data.amount = data.amount === null ? null : Amount.from(data.amount as Amount);
+    data.amount = data.amount !== null ? null : Amount.from(data.amount as Amount);
   }
 
killedBy: createMintQuoteBolt12 mutants omits amount and description when called with no options
statusReason: Unsupported amount input type

[Killed] ConditionalExpression
src/mint/Mint.ts:1527:19
     // omit the field altogether get coerced to null (Postel-style); numeric
     // values are coerced to Amount.
     nullIfUndefined(data, 'amount');
-    data.amount = data.amount === null ? null : Amount.from(data.amount as Amount);
+    data.amount = false ? null : Amount.from(data.amount as Amount);
   }
 
killedBy: createMintQuoteBolt12 mutants omits amount and description when called with no options
statusReason: Unsupported amount input type

[Killed] BooleanLiteral
src/mint/Mint.ts:1544:26
     method: string,
     response: TRes,
     normalize?: (raw: Record<string, unknown>) => TRes,
-    execution: boolean = false,
+    execution: boolean = true,
   ): TRes {
     const op = `${method} melt quote`;
killedBy: createMeltQuoteBolt11 mutants sends no amountless options and fills unit and request from the wallet/invoice
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] BlockStatement
src/mint/Mint.ts:1545:11
     response: TRes,
     normalize?: (raw: Record<string, unknown>) => TRes,
     execution: boolean = false,
-  ): TRes {
-    const op = `${method} melt quote`;
-    if (!isRecord(response)) {
-      this._logger.error('Invalid response from mint...', { type: describeShape(response), op });
-      throw new CTSError('Invalid response from mint');
-    }
-    const data: Record<string, unknown> = { ...response };
-    if (execution) {
-      // An empty request is a mint that echoed nothing back, same as an absent one. A zero
-      // fee reserve is a real value, so only a nullish one goes.
-      if (data.request == null || data.request === '') delete data.request;
-      if (data.fee_reserve == null) delete data.fee_reserve;
-    }
-    this.normalizeMeltBaseFields(data, method, op, execution);
-    if (method === 'bolt11' || method === 'bolt12') {
-      this.normalizeMeltBoltFields(data, op, execution);
-    } else if (method === 'onchain') {
-      this.normalizeMeltOnchainFields(data, execution);
-    }
-    return normalize ? normalize(data) : (data as TRes);
-  }
+  ): TRes {}
 
   /**
killedBy: Mint (BOLT12) – instance methods via customRequest createMeltQuoteBolt12 posts to /v1/melt/quote/bolt12
statusReason: Cannot read properties of undefined (reading 'quote')

[Killed] ConditionalExpression
src/mint/Mint.ts:1547:9
     execution: boolean = false,
   ): TRes {
     const op = `${method} melt quote`;
-    if (!isRecord(response)) {
+    if (true) {
       this._logger.error('Invalid response from mint...', { type: describeShape(response), op });
       throw new CTSError('Invalid response from mint');
killedBy: melt proofs test melt proofs base case
statusReason: Invalid response from mint

[Killed] ConditionalExpression
src/mint/Mint.ts:1547:9
     execution: boolean = false,
   ): TRes {
     const op = `${method} melt quote`;
-    if (!isRecord(response)) {
+    if (false) {
       this._logger.error('Invalid response from mint...', { type: describeShape(response), op });
       throw new CTSError('Invalid response from mint');
killedBy: Mint response shape and cardinality rejects a melt quote response that is not a record
statusReason: expected [Function] to throw error including 'Invalid response from mint' but got 'Unsupported amount input type'

[Killed] ObjectLiteral
src/mint/Mint.ts:1551:43
       this._logger.error('Invalid response from mint...', { type: describeShape(response), op });
       throw new CTSError('Invalid response from mint');
     }
-    const data: Record<string, unknown> = { ...response };
+    const data: Record<string, unknown> = {};
     if (execution) {
       // An empty request is a mint that echoed nothing back, same as an absent one. A zero
killedBy: Mint (BOLT12) – instance methods via customRequest createMeltQuoteBolt12 posts to /v1/melt/quote/bolt12
statusReason: Unsupported amount input type

[Killed] BlockStatement
src/mint/Mint.ts:1552:20
       throw new CTSError('Invalid response from mint');
     }
     const data: Record<string, unknown> = { ...response };
-    if (execution) {
-      // An empty request is a mint that echoed nothing back, same as an absent one. A zero
-      // fee reserve is a real value, so only a nullish one goes.
-      if (data.request == null || data.request === '') delete data.request;
-      if (data.fee_reserve == null) delete data.fee_reserve;
-    }
+    if (execution) {}
     this.normalizeMeltBaseFields(data, method, op, execution);
     if (method === 'bolt11' || method === 'bolt12') {
killedBy: Mint normalization melt responses (NUT-05 quote binding) drops an empty request from a melt response
statusReason: expected { quote: 'q1', …(8) } to not have property "request"

[Killed] ConditionalExpression
src/mint/Mint.ts:1552:9
       throw new CTSError('Invalid response from mint');
     }
     const data: Record<string, unknown> = { ...response };
-    if (execution) {
+    if (true) {
       // An empty request is a mint that echoed nothing back, same as an absent one. A zero
       // fee reserve is a real value, so only a nullish one goes.
killedBy: Mint normalization createMeltQuoteBolt11 invoice binding accepts a quote that echoes no invoice
statusReason: Invalid response from mint

[Killed] ConditionalExpression
src/mint/Mint.ts:1555:11
     if (execution) {
       // An empty request is a mint that echoed nothing back, same as an absent one. A zero
       // fee reserve is a real value, so only a nullish one goes.
-      if (data.request == null || data.request === '') delete data.request;
+      if (true) delete data.request;
       if (data.fee_reserve == null) delete data.fee_reserve;
     }
killedBy: Mint normalization melt responses (NUT-05 quote binding) returns the request and fee reserve a melt response does carry
statusReason: expected undefined to be 'lnbc1...' // Object.is equality

[Killed] ConditionalExpression
src/mint/Mint.ts:1555:35
     if (execution) {
       // An empty request is a mint that echoed nothing back, same as an absent one. A zero
       // fee reserve is a real value, so only a nullish one goes.
-      if (data.request == null || data.request === '') delete data.request;
+      if (data.request == null || false) delete data.request;
       if (data.fee_reserve == null) delete data.fee_reserve;
     }
killedBy: Mint normalization melt responses (NUT-05 quote binding) drops an empty request from a melt response
statusReason: expected { quote: 'q1', …(8) } to not have property "request"

[Killed] ConditionalExpression
src/mint/Mint.ts:1556:11
       // An empty request is a mint that echoed nothing back, same as an absent one. A zero
       // fee reserve is a real value, so only a nullish one goes.
       if (data.request == null || data.request === '') delete data.request;
-      if (data.fee_reserve == null) delete data.fee_reserve;
+      if (false) delete data.fee_reserve;
     }
     this.normalizeMeltBaseFields(data, method, op, execution);
killedBy: Mint normalization melt responses (NUT-05 quote binding) drops a null request and fee reserve from a melt response
statusReason: Invalid response from mint

[Killed] EqualityOperator
src/mint/Mint.ts:1556:11
       // An empty request is a mint that echoed nothing back, same as an absent one. A zero
       // fee reserve is a real value, so only a nullish one goes.
       if (data.request == null || data.request === '') delete data.request;
-      if (data.fee_reserve == null) delete data.fee_reserve;
+      if (data.fee_reserve != null) delete data.fee_reserve;
     }
     this.normalizeMeltBaseFields(data, method, op, execution);
killedBy: Mint normalization melt responses (NUT-05 quote binding) returns the request and fee reserve a melt response does carry
statusReason: Cannot read properties of undefined (reading 'toBigInt')

[Killed] CallExpression
src/mint/Mint.ts:1558:5
       if (data.request == null || data.request === '') delete data.request;
       if (data.fee_reserve == null) delete data.fee_reserve;
     }
-    this.normalizeMeltBaseFields(data, method, op, execution);
+    ;
     if (method === 'bolt11' || method === 'bolt12') {
       this.normalizeMeltBoltFields(data, op, execution);
killedBy: Mint normalization checkMeltQuoteBolt11 normalizes amount, fee reserve, and change signatures
statusReason: Invalid response from mint

[Killed] ConditionalExpression
src/mint/Mint.ts:1559:9
       if (data.fee_reserve == null) delete data.fee_reserve;
     }
     this.normalizeMeltBaseFields(data, method, op, execution);
-    if (method === 'bolt11' || method === 'bolt12') {
+    if (false) {
       this.normalizeMeltBoltFields(data, op, execution);
     } else if (method === 'onchain') {
killedBy: Mint normalization melt responses (NUT-05 quote binding) still requires the fee reserve when a bolt melt quote is checked
statusReason: promise resolved "{ quote: 'q1', …(6) }" instead of rejecting

[Killed] ConditionalExpression
src/mint/Mint.ts:1559:9
       if (data.fee_reserve == null) delete data.fee_reserve;
     }
     this.normalizeMeltBaseFields(data, method, op, execution);
-    if (method === 'bolt11' || method === 'bolt12') {
+    if (false || method === 'bolt12') {
       this.normalizeMeltBoltFields(data, op, execution);
     } else if (method === 'onchain') {
killedBy: Mint normalization melt responses (NUT-05 quote binding) still requires the fee reserve when a bolt melt quote is checked
statusReason: promise resolved "{ quote: 'q1', …(6) }" instead of rejecting

[Killed] CallExpression
src/mint/Mint.ts:1560:7
     }
     this.normalizeMeltBaseFields(data, method, op, execution);
     if (method === 'bolt11' || method === 'bolt12') {
-      this.normalizeMeltBoltFields(data, op, execution);
+      ;
     } else if (method === 'onchain') {
       this.normalizeMeltOnchainFields(data, execution);
killedBy: Mint normalization melt responses (NUT-05 quote binding) still requires the fee reserve when a bolt melt quote is checked
statusReason: promise resolved "{ quote: 'q1', …(6) }" instead of rejecting

[Killed] BlockStatement
src/mint/Mint.ts:1561:38
     this.normalizeMeltBaseFields(data, method, op, execution);
     if (method === 'bolt11' || method === 'bolt12') {
       this.normalizeMeltBoltFields(data, op, execution);
-    } else if (method === 'onchain') {
-      this.normalizeMeltOnchainFields(data, execution);
-    }
+    } else if (method === 'onchain') {}
     return normalize ? normalize(data) : (data as TRes);
   }
killedBy: Mint normalization normalizeMeltOnchainFields normalizes a valid onchain melt quote response
statusReason: response.fee_options[0].fee_reserve.toBigInt is not a function

[Killed] EqualityOperator
src/mint/Mint.ts:1561:16
     this.normalizeMeltBaseFields(data, method, op, execution);
     if (method === 'bolt11' || method === 'bolt12') {
       this.normalizeMeltBoltFields(data, op, execution);
-    } else if (method === 'onchain') {
+    } else if (method !== 'onchain') {
       this.normalizeMeltOnchainFields(data, execution);
     }
killedBy: Mint normalization supports custom quote methods with a normalize callback
statusReason: Invalid response from mint

[Killed] CallExpression
src/mint/Mint.ts:1562:7
     if (method === 'bolt11' || method === 'bolt12') {
       this.normalizeMeltBoltFields(data, op, execution);
     } else if (method === 'onchain') {
-      this.normalizeMeltOnchainFields(data, execution);
+      ;
     }
     return normalize ? normalize(data) : (data as TRes);
killedBy: Mint normalization normalizeMeltOnchainFields normalizes a valid onchain melt quote response
statusReason: response.fee_options[0].fee_reserve.toBigInt is not a function

[Killed] CallExpression
src/mint/Mint.ts:1576:5
     op: string,
     execution: boolean,
   ): void {
-    this.normalizeQuoteMethod(data, method, op);
+    ;
     data.amount = Amount.from(data.amount as AmountLike);
     data.expiry = normalizeSafeIntegerMetadata(
killedBy: Mint normalization method field on quote responses injects method on melt quotes when the mint omits it
statusReason: expected undefined to be 'bolt11' // Object.is equality

[Killed] EqualityOperator
src/mint/Mint.ts:1583:9
       'meltQuote.expiry',
       undefined,
     );
-    if (data.fee_reserve != null) {
+    if (data.fee_reserve == null) {
       // nullish
       data.fee_reserve = Amount.from(data.fee_reserve as AmountLike);
killedBy: melt change across a rotation completeMelt reconstructs change on a keyset it holds keyless
statusReason: Invalid response from mint

[Killed] BlockStatement
src/mint/Mint.ts:1583:35
       'meltQuote.expiry',
       undefined,
     );
-    if (data.fee_reserve != null) {
-      // nullish
-      data.fee_reserve = Amount.from(data.fee_reserve as AmountLike);
-    }
+    if (data.fee_reserve != null) {}
     if (data.change) {
       // Bounded before any per-entry work; the wallet still owns the blanks-vs-change comparison.
killedBy: Mint normalization checkMeltQuoteBolt11 normalizes amount, fee reserve, and change signatures
statusReason: Invalid response from mint

[Killed] ConditionalExpression
src/mint/Mint.ts:1587:9
       // nullish
       data.fee_reserve = Amount.from(data.fee_reserve as AmountLike);
     }
-    if (data.change) {
+    if (true) {
       // Bounded before any per-entry work; the wallet still owns the blanks-vs-change comparison.
       if (!Array.isArray(data.change) || data.change.length > MAX_MINT_INFO_LIST) {
killedBy: Mint normalization supports custom quote methods with a normalize callback
statusReason: Invalid response from mint

[Killed] ConditionalExpression
src/mint/Mint.ts:1587:9
       // nullish
       data.fee_reserve = Amount.from(data.fee_reserve as AmountLike);
     }
-    if (data.change) {
+    if (false) {
       // Bounded before any per-entry work; the wallet still owns the blanks-vs-change comparison.
       if (!Array.isArray(data.change) || data.change.length > MAX_MINT_INFO_LIST) {
killedBy: melt change across a rotation completeMelt reconstructs change on a keyset it holds keyless
statusReason: Melt completed but its change could not be reconstructed; see cause: a keyset that will load rebuilds via createMeltChangeProofs(), anything else needs a NUT-09 restore

[Killed] BlockStatement
src/mint/Mint.ts:1589:83
     }
     if (data.change) {
       // Bounded before any per-entry work; the wallet still owns the blanks-vs-change comparison.
-      if (!Array.isArray(data.change) || data.change.length > MAX_MINT_INFO_LIST) {
-        this._logger.error('Invalid response from mint...', {
-          type: describeShape(data.change),
-          op,
-        });
-        throw new CTSError('Invalid response from mint');
-      }
+      if (!Array.isArray(data.change) || data.change.length > MAX_MINT_INFO_LIST) {}
       data.change = this.normalizeSignatureAmounts(data.change as SerializedBlindedSignature[]);
     }
killedBy: Mint normalization checkMeltQuoteBolt11 rejects a change list that is not an array
statusReason: expected [Function] to throw error including 'Invalid response from mint' but got 'entries.every is not a function'

[Killed] BooleanLiteral
src/mint/Mint.ts:1589:11
     }
     if (data.change) {
       // Bounded before any per-entry work; the wallet still owns the blanks-vs-change comparison.
-      if (!Array.isArray(data.change) || data.change.length > MAX_MINT_INFO_LIST) {
+      if (Array.isArray(data.change) || data.change.length > MAX_MINT_INFO_LIST) {
         this._logger.error('Invalid response from mint...', {
           type: describeShape(data.change),
killedBy: Mint normalization checkMeltQuoteBolt11 rejects a change list that is not an array
statusReason: expected [Function] to throw error including 'Invalid response from mint' but got 'entries.every is not a function'

[Killed] LogicalOperator
src/mint/Mint.ts:1599:44
       data.change = this.normalizeSignatureAmounts(data.change as SerializedBlindedSignature[]);
     }
     const hasRequest =
-      typeof data.request === 'string' || (execution && data.request === undefined);
+      typeof data.request === 'string' || (execution || data.request === undefined);
     if (
       !isObj(data) ||
killedBy: Mint normalization custom payment method base normalization (NUT-04/05 common formats) throws when a custom melt quote lacks the payment request
statusReason: promise resolved "{ quote: 'm1', …(5) }" instead of rejecting

[Killed] ConditionalExpression
src/mint/Mint.ts:1599:44
       data.change = this.normalizeSignatureAmounts(data.change as SerializedBlindedSignature[]);
     }
     const hasRequest =
-      typeof data.request === 'string' || (execution && data.request === undefined);
+      typeof data.request === 'string' || (false);
     if (
       !isObj(data) ||
killedBy: Mint normalization melt responses (NUT-05 quote binding) accepts a melt response that omits the request and fee reserve
statusReason: Invalid response from mint

[Killed] LogicalOperator
src/mint/Mint.ts:1601:7
     const hasRequest =
       typeof data.request === 'string' || (execution && data.request === undefined);
     if (
-      !isObj(data) ||
-      typeof data.quote !== 'string' ||
-      !hasRequest ||
-      !(data.amount instanceof Amount) ||
-      typeof data.unit !== 'string' ||
+      (!isObj(data) || typeof data.quote !== 'string' || !hasRequest || !(data.amount instanceof Amount)) && typeof data.unit !== 'string' ||
       typeof data.state !== 'string' ||
       typeof data.expiry !== 'number' ||
killedBy: Mint normalization custom payment method base normalization (NUT-04/05 common formats) throws when a custom melt quote lacks the payment request
statusReason: promise resolved "{ quote: 'm1', …(5) }" instead of rejecting

[Killed] LogicalOperator
src/mint/Mint.ts:1601:7
     const hasRequest =
       typeof data.request === 'string' || (execution && data.request === undefined);
     if (
-      !isObj(data) ||
-      typeof data.quote !== 'string' ||
-      !hasRequest ||
+      (!isObj(data) || typeof data.quote !== 'string') && !hasRequest ||
       !(data.amount instanceof Amount) ||
       typeof data.unit !== 'string' ||
killedBy: Mint normalization custom payment method base normalization (NUT-04/05 common formats) throws when a custom melt quote lacks the payment request
statusReason: promise resolved "{ quote: 'm1', …(5) }" instead of rejecting

[Killed] EqualityOperator
src/mint/Mint.ts:1602:7
       typeof data.request === 'string' || (execution && data.request === undefined);
     if (
       !isObj(data) ||
-      typeof data.quote !== 'string' ||
+      typeof data.quote === 'string' ||
       !hasRequest ||
       !(data.amount instanceof Amount) ||
killedBy: Mint normalization checkMeltQuoteBolt11 normalizes amount, fee reserve, and change signatures
statusReason: Invalid response from mint

[Killed] ConditionalExpression
src/mint/Mint.ts:1602:7
       typeof data.request === 'string' || (execution && data.request === undefined);
     if (
       !isObj(data) ||
-      typeof data.quote !== 'string' ||
+      false ||
       !hasRequest ||
       !(data.amount instanceof Amount) ||
killedBy: Mint mutation coverage response validation rejects melt quote responses whose quote is not a string
statusReason: expected [Function] to throw error including 'Invalid response from mint' but got 'Melt quote response is for a differen…'

[Killed] BooleanLiteral
src/mint/Mint.ts:1603:7
     if (
       !isObj(data) ||
       typeof data.quote !== 'string' ||
-      !hasRequest ||
+      hasRequest ||
       !(data.amount instanceof Amount) ||
       typeof data.unit !== 'string' ||
killedBy: Mint normalization checkMeltQuoteBolt11 normalizes amount, fee reserve, and change signatures
statusReason: Invalid response from mint

[Killed] BooleanLiteral
src/mint/Mint.ts:1604:7
       !isObj(data) ||
       typeof data.quote !== 'string' ||
       !hasRequest ||
-      !(data.amount instanceof Amount) ||
+      data.amount instanceof Amount ||
       typeof data.unit !== 'string' ||
       typeof data.state !== 'string' ||
killedBy: Mint normalization checkMeltQuoteBolt11 normalizes amount, fee reserve, and change signatures
statusReason: Invalid response from mint

[Killed] EqualityOperator
src/mint/Mint.ts:1605:7
       typeof data.quote !== 'string' ||
       !hasRequest ||
       !(data.amount instanceof Amount) ||
-      typeof data.unit !== 'string' ||
+      typeof data.unit === 'string' ||
       typeof data.state !== 'string' ||
       typeof data.expiry !== 'number' ||
killedBy: Mint mutation coverage generic quote methods without options createMeltQuote works without an options argument
statusReason: Invalid response from mint

[Killed] ConditionalExpression
src/mint/Mint.ts:1605:7
       typeof data.quote !== 'string' ||
       !hasRequest ||
       !(data.amount instanceof Amount) ||
-      typeof data.unit !== 'string' ||
+      false ||
       typeof data.state !== 'string' ||
       typeof data.expiry !== 'number' ||
killedBy: Mint mutation coverage response validation rejects melt quote responses whose unit is not a string
statusReason: promise resolved "{ quote: 'q1', request: 'pay-me', …(5) }" instead of rejecting

[Killed] EqualityOperator
src/mint/Mint.ts:1606:7
       !hasRequest ||
       !(data.amount instanceof Amount) ||
       typeof data.unit !== 'string' ||
-      typeof data.state !== 'string' ||
+      typeof data.state === 'string' ||
       typeof data.expiry !== 'number' ||
       !Object.values(MeltQuoteState).includes(data.state as MeltQuoteState)
killedBy: Mint mutation coverage generic quote methods without options createMeltQuote works without an options argument
statusReason: Invalid response from mint

[Survived] ConditionalExpression
src/mint/Mint.ts:1606:7
       !hasRequest ||
       !(data.amount instanceof Amount) ||
       typeof data.unit !== 'string' ||
-      typeof data.state !== 'string' ||
+      false ||
       typeof data.expiry !== 'number' ||
       !Object.values(MeltQuoteState).includes(data.state as MeltQuoteState)

[Killed] ConditionalExpression
src/mint/Mint.ts:1607:7
       !(data.amount instanceof Amount) ||
       typeof data.unit !== 'string' ||
       typeof data.state !== 'string' ||
-      typeof data.expiry !== 'number' ||
+      false ||
       !Object.values(MeltQuoteState).includes(data.state as MeltQuoteState)
     ) {
killedBy: Mint mutation coverage response validation rejects melt quote responses whose expiry is not a number
statusReason: promise resolved "{ quote: 'q1', request: 'pay-me', …(5) }" instead of rejecting

[Killed] EqualityOperator
src/mint/Mint.ts:1607:7
       !(data.amount instanceof Amount) ||
       typeof data.unit !== 'string' ||
       typeof data.state !== 'string' ||
-      typeof data.expiry !== 'number' ||
+      typeof data.expiry === 'number' ||
       !Object.values(MeltQuoteState).includes(data.state as MeltQuoteState)
     ) {
killedBy: Mint mutation coverage generic quote methods without options createMeltQuote works without an options argument
statusReason: Invalid response from mint

[Killed] BooleanLiteral
src/mint/Mint.ts:1608:7
       typeof data.unit !== 'string' ||
       typeof data.state !== 'string' ||
       typeof data.expiry !== 'number' ||
-      !Object.values(MeltQuoteState).includes(data.state as MeltQuoteState)
+      Object.values(MeltQuoteState).includes(data.state as MeltQuoteState)
     ) {
       // Log the reason, not the response: it carries the quote id, payment request, and any
killedBy: Mint mutation coverage generic quote methods without options createMeltQuote works without an options argument
statusReason: Invalid response from mint

[Killed] BlockStatement
src/mint/Mint.ts:1609:7
       typeof data.state !== 'string' ||
       typeof data.expiry !== 'number' ||
       !Object.values(MeltQuoteState).includes(data.state as MeltQuoteState)
-    ) {
-      // Log the reason, not the response: it carries the quote id, payment request, and any
-      // change signatures.
-      this._logger.error('Invalid response from mint...', { op });
-      throw new CTSError('Invalid response from mint');
-    }
+    ) {}
   }
 
killedBy: Mint mutation coverage response validation rejects melt quote responses whose quote is not a string
statusReason: expected [Function] to throw error including 'Invalid response from mint' but got 'Melt quote response is for a differen…'

[Killed] StringLiteral
src/mint/Mint.ts:1612:26
     ) {
       // Log the reason, not the response: it carries the quote id, payment request, and any
       // change signatures.
-      this._logger.error('Invalid response from mint...', { op });
+      this._logger.error("", { op });
       throw new CTSError('Invalid response from mint');
     }
killedBy: Mint mutation coverage response validation rejects melt quote responses whose quote is not a string
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
-   "Invalid response from mint...",

[Killed] ObjectLiteral
src/mint/Mint.ts:1612:59
     ) {
       // Log the reason, not the response: it carries the quote id, payment request, and any
       // change signatures.
-      this._logger.error('Invalid response from mint...', { op });
+      this._logger.error('Invalid response from mint...', {});
       throw new CTSError('Invalid response from mint');
     }
killedBy: Mint mutation coverage response validation rejects melt quote responses whose quote is not a string
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received:

  1st vi.fn() call:

  [
    "Invalid response from mint...",

[Killed] StringLiteral
src/mint/Mint.ts:1613:26
       // Log the reason, not the response: it carries the quote id, payment request, and any
       // change signatures.
       this._logger.error('Invalid response from mint...', { op });
-      throw new CTSError('Invalid response from mint');
+      throw new CTSError("");
     }
   }
killedBy: Mint mutation coverage response validation rejects melt quote responses whose quote is not a string
statusReason: expected [Function] to throw error including 'Invalid response from mint' but got ''

[Killed] BlockStatement
src/mint/Mint.ts:1624:11
     data: Record<string, unknown>,
     op: string,
     execution: boolean,
-  ): void {
-    // Base normalization already coerced fee_reserve when present; bolt quotes require it.
-    const hasFeeReserve =
-      data.fee_reserve instanceof Amount || (execution && data.fee_reserve === undefined);
-    if (!hasFeeReserve) {
-      this._logger.error('Invalid response from mint...', { op });
-      throw new CTSError('Invalid response from mint');
-    }
-    // Per NUT-23, payment_preimage is `<str | null>`. Some mints may omit it
-    // until the invoice is paid; coerce undefined → null so consumers can
-    // rely on `payment_preimage === null` checks.
-    nullIfUndefined(data, 'payment_preimage');
-  }
+  ): void {}
 
   /**
killedBy: generic mint/melt methods normalizer stacking bolt11 melt quote with omitted payment_preimage is coerced to null
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/mint/Mint.ts:1627:46
   ): void {
     // Base normalization already coerced fee_reserve when present; bolt quotes require it.
     const hasFeeReserve =
-      data.fee_reserve instanceof Amount || (execution && data.fee_reserve === undefined);
+      data.fee_reserve instanceof Amount || (false);
     if (!hasFeeReserve) {
       this._logger.error('Invalid response from mint...', { op });
killedBy: Mint normalization melt responses (NUT-05 quote binding) accepts a melt response that omits the request and fee reserve
statusReason: Invalid response from mint

[Killed] LogicalOperator
src/mint/Mint.ts:1627:7
   ): void {
     // Base normalization already coerced fee_reserve when present; bolt quotes require it.
     const hasFeeReserve =
-      data.fee_reserve instanceof Amount || (execution && data.fee_reserve === undefined);
+      data.fee_reserve instanceof Amount && execution && data.fee_reserve === undefined;
     if (!hasFeeReserve) {
       this._logger.error('Invalid response from mint...', { op });
killedBy: generic mint/melt methods wallet.createMeltQuote / checkMeltQuote checkMeltQuoteBolt11 does not merge caller fields over mint response
statusReason: Invalid response from mint
