[Killed] BlockStatement
src/model/MintInfo.ts:330:15
   isSupported(num: number) {
     switch (num) {
       case 4:
-      case 5: {
-        return this.checkMintMelt(num);
-      }
+      case 5: {}
       case 7:
       case 8:
killedBy: MintInfo protected endpoint matching supportedMethods lists usable methods and returns [] for disabled ops
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
src/model/MintInfo.ts:340:7
       case 11:
       case 12:
       case 14:
-      case 20: {
-        return this.checkGenericNut(num);
-      }
+      case 20:
       case 17: {
         return this.checkNut17();
killedBy: test info test info
statusReason: expected { supported: true, params: [ …(3) ] } to deeply equal { supported: true }

[Killed] BlockStatement
src/model/MintInfo.ts:340:16
       case 11:
       case 12:
       case 14:
-      case 20: {
-        return this.checkGenericNut(num);
-      }
+      case 20: {}
       case 17: {
         return this.checkNut17();
killedBy: test info test info
statusReason: expected { supported: true, params: [ …(3) ] } to deeply equal { supported: true }

[Killed] BlockStatement
src/model/MintInfo.ts:343:16
       case 20: {
         return this.checkGenericNut(num);
       }
-      case 17: {
-        return this.checkNut17();
-      }
+      case 17: {}
       case 15: {
         return this.checkNut15();
killedBy: MintInfo isSupported branches reports NUT-17 unsupported when absent or empty, supported with params otherwise
statusReason: expected { supported: false } to deeply equal { supported: true, …(1) }

[Killed] ConditionalExpression
src/model/MintInfo.ts:343:7
       case 20: {
         return this.checkGenericNut(num);
       }
-      case 17: {
-        return this.checkNut17();
-      }
+      case 17:
       case 15: {
         return this.checkNut15();
killedBy: MintInfo isSupported branches reports NUT-17 unsupported when absent or empty, supported with params otherwise
statusReason: expected { supported: false } to deeply equal { supported: true, …(1) }

[Killed] BlockStatement
src/model/MintInfo.ts:346:16
       case 17: {
         return this.checkNut17();
       }
-      case 15: {
-        return this.checkNut15();
-      }
+      case 15: {}
       case 19: {
         return this.checkNut19();
killedBy: multi mint multi path melt quotes
statusReason: Mint does not support NUT-15

[Killed] ConditionalExpression
src/model/MintInfo.ts:346:7
       case 17: {
         return this.checkNut17();
       }
-      case 15: {
-        return this.checkNut15();
-      }
+      case 15:
       case 19: {
         return this.checkNut19();
killedBy: MintInfo isSupported branches reports NUT-15 unsupported when absent or empty, supported with params otherwise
statusReason: expected { supported: false } to deeply equal { supported: true, …(1) }

[Killed] BlockStatement
src/model/MintInfo.ts:349:16
       case 15: {
         return this.checkNut15();
       }
-      case 19: {
-        return this.checkNut19();
-      }
+      case 19: {}
       case 29: {
         return this.checkNut29();
killedBy: MintInfo protected endpoint matching maps NUT-19 ttl null to Infinity
statusReason: expected { supported: false } to deeply equal { supported: true, params: { …(2) } }

[Killed] ConditionalExpression
src/model/MintInfo.ts:349:7
       case 15: {
         return this.checkNut15();
       }
-      case 19: {
-        return this.checkNut19();
-      }
+      case 19:
       case 29: {
         return this.checkNut29();
killedBy: MintInfo protected endpoint matching maps NUT-19 ttl null to Infinity
statusReason: expected { supported: false } to deeply equal { supported: true, params: { …(2) } }

[Killed] BlockStatement
src/model/MintInfo.ts:352:16
       case 19: {
         return this.checkNut19();
       }
-      case 29: {
-        return this.checkNut29();
-      }
+      case 29: {}
       default: {
         throw new CTSError('nut is not supported by cashu-ts');
killedBy: MintInfo NUT-29 batch minting info returns supported:false when nuts["29"] is absent
statusReason: nut is not supported by cashu-ts

[Killed] ConditionalExpression
src/model/MintInfo.ts:352:7
       case 19: {
         return this.checkNut19();
       }
-      case 29: {
-        return this.checkNut29();
-      }
+      case 29:
       default: {
         throw new CTSError('nut is not supported by cashu-ts');
killedBy: custom outputs on a keyset other than the wallet default batch mint unblinds custom outputs with the keyset that signed them
statusReason: nut is not supported by cashu-ts

[Killed] ConditionalExpression
src/model/MintInfo.ts:355:7
       case 29: {
         return this.checkNut29();
       }
-      default: {
-        throw new CTSError('nut is not supported by cashu-ts');
-      }
+      default:
     }
   }
killedBy: test info test info
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/model/MintInfo.ts:355:16
       case 29: {
         return this.checkNut29();
       }
-      default: {
-        throw new CTSError('nut is not supported by cashu-ts');
-      }
+      default: {}
     }
   }
killedBy: test info test info
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/model/MintInfo.ts:356:28
         return this.checkNut29();
       }
       default: {
-        throw new CTSError('nut is not supported by cashu-ts');
+        throw new CTSError("");
       }
     }
killedBy: test info test info
statusReason: expected [Function] to throw error matching /nut is not supported/ but got ''

[Killed] BlockStatement
src/model/MintInfo.ts:361:73
     }
   }
 
-  requiresBlindAuthToken(method: 'GET' | 'POST', path: string): boolean {
-    return this.matchesProtected(this._protected22, method, path);
-  }
+  requiresBlindAuthToken(method: 'GET' | 'POST', path: string): boolean {}
 
   requiresClearAuthToken(method: 'GET' | 'POST', path: string): boolean {
killedBy: async melt preference body bolt11: blind auth sends Blind-auth header
statusReason: HTTP request failed

[Killed] BlockStatement
src/model/MintInfo.ts:365:73
     return this.matchesProtected(this._protected22, method, path);
   }
 
-  requiresClearAuthToken(method: 'GET' | 'POST', path: string): boolean {
-    return this.matchesProtected(this._protected21, method, path);
-  }
+  requiresClearAuthToken(method: 'GET' | 'POST', path: string): boolean {}
 
   private matchesProtected(idx: ProtectedIndex | undefined, method: Method, path: string): boolean {
killedBy: Clear Authentication handleClearAuth calls ensureCAT (not getCAT) and sends Clear-auth header
statusReason: expected "vi.fn()" to be called at least once

[Killed] BlockStatement
src/model/MintInfo.ts:369:100
     return this.matchesProtected(this._protected21, method, path);
   }
 
-  private matchesProtected(idx: ProtectedIndex | undefined, method: Method, path: string): boolean {
-    if (!idx) return false;
-
-    // Runtime guard for method
-    const exact = idx.exact[method];
-    const prefix = idx.prefix[method];
-    if (!exact || !prefix) return false;
-
-    // Exact match first
-    if (idx.exact[method].has(path)) return true;
-
-    // Prefix match fallback
-    for (const p of idx.prefix[method]) {
-      if (path.startsWith(p)) return true;
-    }
-
-    return false;
-  }
+  private matchesProtected(idx: ProtectedIndex | undefined, method: Method, path: string): boolean {}
 
   private checkGenericNut(num: 7 | 8 | 9 | 10 | 11 | 12 | 14 | 20) {
killedBy: async melt preference body bolt11: blind auth sends Blind-auth header
statusReason: HTTP request failed

[Killed] ConditionalExpression
src/model/MintInfo.ts:370:9
   }
 
   private matchesProtected(idx: ProtectedIndex | undefined, method: Method, path: string): boolean {
-    if (!idx) return false;
+    if (true) return false;
 
     // Runtime guard for method
killedBy: async melt preference body bolt11: blind auth sends Blind-auth header
statusReason: HTTP request failed

[Killed] BooleanLiteral
src/model/MintInfo.ts:370:22
   }
 
   private matchesProtected(idx: ProtectedIndex | undefined, method: Method, path: string): boolean {
-    if (!idx) return false;
+    if (!idx) return true;
 
     // Runtime guard for method
killedBy: AuthManager: BAT pool minting/topUp/ensure ensure() normalizes bigint info and auth keyset fields during init
statusReason: AuthManager: Clear-auth token required for /v1/auth/blind/mint but not available. Authenticate with the mint to obtain a CAT first.

[Killed] ConditionalExpression
src/model/MintInfo.ts:375:9
     // Runtime guard for method
     const exact = idx.exact[method];
     const prefix = idx.prefix[method];
-    if (!exact || !prefix) return false;
+    if (true) return false;
 
     // Exact match first
killedBy: Blind Authentication Mint Info
statusReason: expected false to be truthy

[Killed] BooleanLiteral
src/model/MintInfo.ts:375:35
     // Runtime guard for method
     const exact = idx.exact[method];
     const prefix = idx.prefix[method];
-    if (!exact || !prefix) return false;
+    if (!exact || !prefix) return true;
 
     // Exact match first
killedBy: MintInfo protected endpoint matching returns false for a non-GET/POST request method (runtime guard)
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/model/MintInfo.ts:378:45
     if (!exact || !prefix) return false;
 
     // Exact match first
-    if (idx.exact[method].has(path)) return true;
+    if (idx.exact[method].has(path)) return false;
 
     // Prefix match fallback
killedBy: async melt preference body bolt11: blind auth sends Blind-auth header
statusReason: HTTP request failed

[Killed] ConditionalExpression
src/model/MintInfo.ts:378:9
     if (!exact || !prefix) return false;
 
     // Exact match first
-    if (idx.exact[method].has(path)) return true;
+    if (true) return true;
 
     // Prefix match fallback
killedBy: MintInfo protected endpoint matching matches exact literal path
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/model/MintInfo.ts:381:41
     if (idx.exact[method].has(path)) return true;
 
     // Prefix match fallback
-    for (const p of idx.prefix[method]) {
-      if (path.startsWith(p)) return true;
-    }
+    for (const p of idx.prefix[method]) {}
 
     return false;
killedBy: MintInfo protected endpoint matching matches prefix pattern ^/path/.*
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/model/MintInfo.ts:382:11
 
     // Prefix match fallback
     for (const p of idx.prefix[method]) {
-      if (path.startsWith(p)) return true;
+      if (true) return true;
     }
 
killedBy: MintInfo protected endpoint matching matches prefix pattern ^/path/.*
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/model/MintInfo.ts:382:38
 
     // Prefix match fallback
     for (const p of idx.prefix[method]) {
-      if (path.startsWith(p)) return true;
+      if (path.startsWith(p)) return false;
     }
 
killedBy: MintInfo protected endpoint matching matches prefix pattern ^/path/.*
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/model/MintInfo.ts:388:68
     return false;
   }
 
-  private checkGenericNut(num: 7 | 8 | 9 | 10 | 11 | 12 | 14 | 20) {
-    return this._mintInfo.nuts[num]?.supported ? { supported: true } : { supported: false };
-  }
+  private checkGenericNut(num: 7 | 8 | 9 | 10 | 11 | 12 | 14 | 20) {}
 
   private checkMintMelt(num: 4 | 5) {
killedBy: test info test info
statusReason: expected undefined to deeply equal { supported: true }

[Killed] BooleanLiteral
src/model/MintInfo.ts:389:63
   }
 
   private checkGenericNut(num: 7 | 8 | 9 | 10 | 11 | 12 | 14 | 20) {
-    return this._mintInfo.nuts[num]?.supported ? { supported: true } : { supported: false };
+    return this._mintInfo.nuts[num]?.supported ? { supported: false } : { supported: false };
   }
 
killedBy: test info test info
statusReason: expected { supported: false } to deeply equal { supported: true }

[Killed] BooleanLiteral
src/model/MintInfo.ts:389:85
   }
 
   private checkGenericNut(num: 7 | 8 | 9 | 10 | 11 | 12 | 14 | 20) {
-    return this._mintInfo.nuts[num]?.supported ? { supported: true } : { supported: false };
+    return this._mintInfo.nuts[num]?.supported ? { supported: true } : { supported: true };
   }
 
killedBy: MintInfo isSupported branches reports generic nuts as unsupported when absent
statusReason: expected { supported: true } to deeply equal { supported: false }

[Killed] BlockStatement
src/model/MintInfo.ts:392:37
     return this._mintInfo.nuts[num]?.supported ? { supported: true } : { supported: false };
   }
 
-  private checkMintMelt(num: 4 | 5) {
-    const mintMeltInfo = this._mintInfo.nuts[num];
-    if (mintMeltInfo && mintMeltInfo.methods.length > 0 && !mintMeltInfo.disabled) {
-      return { disabled: false, params: MintInfo.snapshot(mintMeltInfo.methods) };
-    }
-    return { disabled: true, params: MintInfo.snapshot(mintMeltInfo?.methods ?? []) };
-  }
+  private checkMintMelt(num: 4 | 5) {}
 
   private checkNut17() {
killedBy: melt proofs test melt proofs base case
statusReason: Cannot destructure property 'disabled' of 'this.isSupported(...)' as it is undefined.

[Killed] EqualityOperator
src/model/MintInfo.ts:394:25
 
   private checkMintMelt(num: 4 | 5) {
     const mintMeltInfo = this._mintInfo.nuts[num];
-    if (mintMeltInfo && mintMeltInfo.methods.length > 0 && !mintMeltInfo.disabled) {
+    if (mintMeltInfo && mintMeltInfo.methods.length >= 0 && !mintMeltInfo.disabled) {
       return { disabled: false, params: MintInfo.snapshot(mintMeltInfo.methods) };
     }
killedBy: MintInfo isSupported branches reports mint disabled when the method list is empty
statusReason: expected { disabled: false, params: [] } to deeply equal { disabled: true, params: [] }

[Killed] ConditionalExpression
src/model/MintInfo.ts:394:9
 
   private checkMintMelt(num: 4 | 5) {
     const mintMeltInfo = this._mintInfo.nuts[num];
-    if (mintMeltInfo && mintMeltInfo.methods.length > 0 && !mintMeltInfo.disabled) {
+    if (false) {
       return { disabled: false, params: MintInfo.snapshot(mintMeltInfo.methods) };
     }
killedBy: test info test info
statusReason: expected { disabled: true, params: [ …(5) ] } to deeply equal { disabled: false, params: [ …(5) ] }

[Killed] BooleanLiteral
src/model/MintInfo.ts:395:26
   private checkMintMelt(num: 4 | 5) {
     const mintMeltInfo = this._mintInfo.nuts[num];
     if (mintMeltInfo && mintMeltInfo.methods.length > 0 && !mintMeltInfo.disabled) {
-      return { disabled: false, params: MintInfo.snapshot(mintMeltInfo.methods) };
+      return { disabled: true, params: MintInfo.snapshot(mintMeltInfo.methods) };
     }
     return { disabled: true, params: MintInfo.snapshot(mintMeltInfo?.methods ?? []) };
killedBy: MintInfo protected endpoint matching supportedMethods lists usable methods and returns [] for disabled ops
statusReason: expected [] to deeply equal [ 'bolt11', 'bolt12' ]

[Killed] ObjectLiteral
src/model/MintInfo.ts:395:14
   private checkMintMelt(num: 4 | 5) {
     const mintMeltInfo = this._mintInfo.nuts[num];
     if (mintMeltInfo && mintMeltInfo.methods.length > 0 && !mintMeltInfo.disabled) {
-      return { disabled: false, params: MintInfo.snapshot(mintMeltInfo.methods) };
+      return {};
     }
     return { disabled: true, params: MintInfo.snapshot(mintMeltInfo?.methods ?? []) };
killedBy: MintInfo protected endpoint matching supportedMethods lists usable methods and returns [] for disabled ops
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] OptionalChaining
src/model/MintInfo.ts:397:56
     if (mintMeltInfo && mintMeltInfo.methods.length > 0 && !mintMeltInfo.disabled) {
       return { disabled: false, params: MintInfo.snapshot(mintMeltInfo.methods) };
     }
-    return { disabled: true, params: MintInfo.snapshot(mintMeltInfo?.methods ?? []) };
+    return { disabled: true, params: MintInfo.snapshot(mintMeltInfo.methods ?? []) };
   }
 
killedBy: MintInfo isSupported branches reports mint/melt disabled with empty params when the nut is absent
statusReason: Cannot read properties of undefined (reading 'methods')

[Killed] BooleanLiteral
src/model/MintInfo.ts:397:24
     if (mintMeltInfo && mintMeltInfo.methods.length > 0 && !mintMeltInfo.disabled) {
       return { disabled: false, params: MintInfo.snapshot(mintMeltInfo.methods) };
     }
-    return { disabled: true, params: MintInfo.snapshot(mintMeltInfo?.methods ?? []) };
+    return { disabled: false, params: MintInfo.snapshot(mintMeltInfo?.methods ?? []) };
   }
 
killedBy: MintInfo protected endpoint matching supportedMethods lists usable methods and returns [] for disabled ops
statusReason: expected [ { method: 'bolt11', …(4) } ] to deeply equal []

[Killed] BlockStatement
src/model/MintInfo.ts:400:24
     return { disabled: true, params: MintInfo.snapshot(mintMeltInfo?.methods ?? []) };
   }
 
-  private checkNut17() {
-    if (this._mintInfo.nuts[17] && this._mintInfo.nuts[17].supported.length > 0) {
-      return { supported: true, params: MintInfo.snapshot(this._mintInfo.nuts[17].supported) };
-    }
-    return { supported: false };
-  }
+  private checkNut17() {}
 
   private checkNut15() {
killedBy: MintInfo isSupported branches reports NUT-17 unsupported when absent or empty, supported with params otherwise
statusReason: expected undefined to deeply equal { supported: false }

[Killed] ConditionalExpression
src/model/MintInfo.ts:401:9
   }
 
   private checkNut17() {
-    if (this._mintInfo.nuts[17] && this._mintInfo.nuts[17].supported.length > 0) {
+    if (true) {
       return { supported: true, params: MintInfo.snapshot(this._mintInfo.nuts[17].supported) };
     }
killedBy: MintInfo isSupported branches reports NUT-17 unsupported when absent or empty, supported with params otherwise
statusReason: Cannot read properties of undefined (reading 'supported')

[Killed] EqualityOperator
src/model/MintInfo.ts:401:36
   }
 
   private checkNut17() {
-    if (this._mintInfo.nuts[17] && this._mintInfo.nuts[17].supported.length > 0) {
+    if (this._mintInfo.nuts[17] && this._mintInfo.nuts[17].supported.length >= 0) {
       return { supported: true, params: MintInfo.snapshot(this._mintInfo.nuts[17].supported) };
     }
killedBy: MintInfo isSupported branches reports NUT-17 unsupported when absent or empty, supported with params otherwise
statusReason: expected { supported: true, params: [] } to deeply equal { supported: false }

[Killed] BooleanLiteral
src/model/MintInfo.ts:402:27
 
   private checkNut17() {
     if (this._mintInfo.nuts[17] && this._mintInfo.nuts[17].supported.length > 0) {
-      return { supported: true, params: MintInfo.snapshot(this._mintInfo.nuts[17].supported) };
+      return { supported: false, params: MintInfo.snapshot(this._mintInfo.nuts[17].supported) };
     }
     return { supported: false };
killedBy: MintInfo isSupported branches reports NUT-17 unsupported when absent or empty, supported with params otherwise
statusReason: expected { supported: false, …(1) } to deeply equal { supported: true, …(1) }

[Killed] BooleanLiteral
src/model/MintInfo.ts:404:25
     if (this._mintInfo.nuts[17] && this._mintInfo.nuts[17].supported.length > 0) {
       return { supported: true, params: MintInfo.snapshot(this._mintInfo.nuts[17].supported) };
     }
-    return { supported: false };
+    return { supported: true };
   }
 
killedBy: MintInfo isSupported branches reports NUT-17 unsupported when absent or empty, supported with params otherwise
statusReason: expected { supported: true } to deeply equal { supported: false }

[Killed] BlockStatement
src/model/MintInfo.ts:407:24
     return { supported: false };
   }
 
-  private checkNut15() {
-    if (this._mintInfo.nuts[15] && this._mintInfo.nuts[15].methods.length > 0) {
-      return { supported: true, params: MintInfo.snapshot(this._mintInfo.nuts[15].methods) };
-    }
-    return { supported: false };
-  }
+  private checkNut15() {}
 
   private checkNut19() {
killedBy: MintInfo isSupported branches reports NUT-15 unsupported when absent or empty, supported with params otherwise
statusReason: expected undefined to deeply equal { supported: false }

[Killed] LogicalOperator
src/model/MintInfo.ts:408:9
   }
 
   private checkNut15() {
-    if (this._mintInfo.nuts[15] && this._mintInfo.nuts[15].methods.length > 0) {
+    if (this._mintInfo.nuts[15] || this._mintInfo.nuts[15].methods.length > 0) {
       return { supported: true, params: MintInfo.snapshot(this._mintInfo.nuts[15].methods) };
     }
killedBy: MintInfo isSupported branches reports NUT-15 unsupported when absent or empty, supported with params otherwise
statusReason: Cannot read properties of undefined (reading 'methods')

[Killed] BlockStatement
src/model/MintInfo.ts:408:80
   }
 
   private checkNut15() {
-    if (this._mintInfo.nuts[15] && this._mintInfo.nuts[15].methods.length > 0) {
-      return { supported: true, params: MintInfo.snapshot(this._mintInfo.nuts[15].methods) };
-    }
+    if (this._mintInfo.nuts[15] && this._mintInfo.nuts[15].methods.length > 0) {}
     return { supported: false };
   }
killedBy: MintInfo isSupported branches reports NUT-15 unsupported when absent or empty, supported with params otherwise
statusReason: expected { supported: false } to deeply equal { supported: true, …(1) }

[Killed] BooleanLiteral
src/model/MintInfo.ts:409:27
 
   private checkNut15() {
     if (this._mintInfo.nuts[15] && this._mintInfo.nuts[15].methods.length > 0) {
-      return { supported: true, params: MintInfo.snapshot(this._mintInfo.nuts[15].methods) };
+      return { supported: false, params: MintInfo.snapshot(this._mintInfo.nuts[15].methods) };
     }
     return { supported: false };
killedBy: MintInfo isSupported branches reports NUT-15 unsupported when absent or empty, supported with params otherwise
statusReason: expected { supported: false, …(1) } to deeply equal { supported: true, …(1) }

[Killed] BlockStatement
src/model/MintInfo.ts:414:24
     return { supported: false };
   }
 
-  private checkNut19() {
-    const rawPolicy = this._mintInfo.nuts?.[19];
-    if (rawPolicy && (rawPolicy?.cached_endpoints?.length || 0) > 0) {
-      const ttlSeconds = normalizeSafeIntegerMetadata(rawPolicy.ttl, 'nuts.19.ttl', null);
-      return {
-        supported: true,
-        params: {
-          // map null to infinity, if not null map seconds to milliseconds.
-          // this way ttl is always a number
-          ttl: ttlSeconds === null ? Infinity : Math.max(ttlSeconds, 0) * 1000,
-          cached_endpoints: MintInfo.snapshot(rawPolicy.cached_endpoints),
-        },
-      };
-    }
-    return { supported: false };
-  }
+  private checkNut19() {}
 
   private checkNut29() {
killedBy: MintInfo protected endpoint matching maps NUT-19 ttl null to Infinity
statusReason: expected undefined to deeply equal { supported: true, params: { …(2) } }

[Survived] OptionalChaining
src/model/MintInfo.ts:415:23
   }
 
   private checkNut19() {
-    const rawPolicy = this._mintInfo.nuts?.[19];
+    const rawPolicy = this._mintInfo.nuts[19];
     if (rawPolicy && (rawPolicy?.cached_endpoints?.length || 0) > 0) {
       const ttlSeconds = normalizeSafeIntegerMetadata(rawPolicy.ttl, 'nuts.19.ttl', null);

[Killed] ConditionalExpression
src/model/MintInfo.ts:416:22
 
   private checkNut19() {
     const rawPolicy = this._mintInfo.nuts?.[19];
-    if (rawPolicy && (rawPolicy?.cached_endpoints?.length || 0) > 0) {
+    if (rawPolicy && true) {
       const ttlSeconds = normalizeSafeIntegerMetadata(rawPolicy.ttl, 'nuts.19.ttl', null);
       return {
killedBy: MintInfo isSupported branches reports NUT-19 unsupported when cached_endpoints is empty or missing
statusReason: expected { supported: true, params: { …(2) } } to deeply equal { supported: false }

[Killed] LogicalOperator
src/model/MintInfo.ts:416:23
 
   private checkNut19() {
     const rawPolicy = this._mintInfo.nuts?.[19];
-    if (rawPolicy && (rawPolicy?.cached_endpoints?.length || 0) > 0) {
+    if (rawPolicy && (rawPolicy?.cached_endpoints?.length && 0) > 0) {
       const ttlSeconds = normalizeSafeIntegerMetadata(rawPolicy.ttl, 'nuts.19.ttl', null);
       return {
killedBy: MintInfo protected endpoint matching maps NUT-19 ttl null to Infinity
statusReason: expected { supported: false } to deeply equal { supported: true, params: { …(2) } }

[Survived] StringLiteral
src/model/MintInfo.ts:417:70
   private checkNut19() {
     const rawPolicy = this._mintInfo.nuts?.[19];
     if (rawPolicy && (rawPolicy?.cached_endpoints?.length || 0) > 0) {
-      const ttlSeconds = normalizeSafeIntegerMetadata(rawPolicy.ttl, 'nuts.19.ttl', null);
+      const ttlSeconds = normalizeSafeIntegerMetadata(rawPolicy.ttl, "", null);
       return {
         supported: true,

[Killed] ObjectLiteral
src/model/MintInfo.ts:418:14
     const rawPolicy = this._mintInfo.nuts?.[19];
     if (rawPolicy && (rawPolicy?.cached_endpoints?.length || 0) > 0) {
       const ttlSeconds = normalizeSafeIntegerMetadata(rawPolicy.ttl, 'nuts.19.ttl', null);
-      return {
-        supported: true,
-        params: {
-          // map null to infinity, if not null map seconds to milliseconds.
-          // this way ttl is always a number
-          ttl: ttlSeconds === null ? Infinity : Math.max(ttlSeconds, 0) * 1000,
-          cached_endpoints: MintInfo.snapshot(rawPolicy.cached_endpoints),
-        },
-      };
+      return {};
     }
     return { supported: false };
killedBy: MintInfo protected endpoint matching maps NUT-19 ttl null to Infinity
statusReason: expected {} to deeply equal { supported: true, params: { …(2) } }

[Killed] BooleanLiteral
src/model/MintInfo.ts:419:20
     if (rawPolicy && (rawPolicy?.cached_endpoints?.length || 0) > 0) {
       const ttlSeconds = normalizeSafeIntegerMetadata(rawPolicy.ttl, 'nuts.19.ttl', null);
       return {
-        supported: true,
+        supported: false,
         params: {
           // map null to infinity, if not null map seconds to milliseconds.
killedBy: MintInfo protected endpoint matching maps NUT-19 ttl null to Infinity
statusReason: expected { supported: false, params: { …(2) } } to deeply equal { supported: true, params: { …(2) } }

[Killed] MethodExpression
src/model/MintInfo.ts:423:49
         params: {
           // map null to infinity, if not null map seconds to milliseconds.
           // this way ttl is always a number
-          ttl: ttlSeconds === null ? Infinity : Math.max(ttlSeconds, 0) * 1000,
+          ttl: ttlSeconds === null ? Infinity : Math.min(ttlSeconds, 0) * 1000,
           cached_endpoints: MintInfo.snapshot(rawPolicy.cached_endpoints),
         },
killedBy: MintInfo protected endpoint matching preserves AmountLike min/max amounts; normalizes metadata integers at construction
statusReason: expected { supported: true, params: { …(2) } } to deeply equal { supported: true, params: { …(2) } }

[Killed] ConditionalExpression
src/model/MintInfo.ts:423:16
         params: {
           // map null to infinity, if not null map seconds to milliseconds.
           // this way ttl is always a number
-          ttl: ttlSeconds === null ? Infinity : Math.max(ttlSeconds, 0) * 1000,
+          ttl: false ? Infinity : Math.max(ttlSeconds, 0) * 1000,
           cached_endpoints: MintInfo.snapshot(rawPolicy.cached_endpoints),
         },
killedBy: MintInfo protected endpoint matching maps NUT-19 ttl null to Infinity
statusReason: expected { supported: true, params: { …(2) } } to deeply equal { supported: true, params: { …(2) } }

[Killed] ObjectLiteral
src/model/MintInfo.ts:428:12
         },
       };
     }
-    return { supported: false };
+    return {};
   }
 
killedBy: test wallet init should resolve NUT-19 support lazily from mint info when unsupported
statusReason: expected {} to deeply equal { supported: false }

[Killed] BlockStatement
src/model/MintInfo.ts:431:24
     return { supported: false };
   }
 
-  private checkNut29() {
-    const nut29 = this._mintInfo.nuts?.[29];
-    if (nut29) {
-      return { supported: true, params: MintInfo.snapshot(nut29) };
-    }
-    return { supported: false };
-  }
+  private checkNut29() {}
 
   // ---------- private helpers ----------
killedBy: MintInfo NUT-29 batch minting info returns supported:false when nuts["29"] is absent
statusReason: expected undefined to deeply equal { supported: false }

[Survived] OptionalChaining
src/model/MintInfo.ts:432:19
   }
 
   private checkNut29() {
-    const nut29 = this._mintInfo.nuts?.[29];
+    const nut29 = this._mintInfo.nuts[29];
     if (nut29) {
       return { supported: true, params: MintInfo.snapshot(nut29) };

[Killed] ConditionalExpression
src/model/MintInfo.ts:433:9
 
   private checkNut29() {
     const nut29 = this._mintInfo.nuts?.[29];
-    if (nut29) {
+    if (true) {
       return { supported: true, params: MintInfo.snapshot(nut29) };
     }
killedBy: MintInfo NUT-29 batch minting info returns supported:false when nuts["29"] is absent
statusReason: expected { supported: true, params: undefined } to deeply equal { supported: false }

[Killed] BlockStatement
src/model/MintInfo.ts:433:16
 
   private checkNut29() {
     const nut29 = this._mintInfo.nuts?.[29];
-    if (nut29) {
-      return { supported: true, params: MintInfo.snapshot(nut29) };
-    }
+    if (nut29) {}
     return { supported: false };
   }
killedBy: MintInfo NUT-29 batch minting info returns supported:true with correct params when both max_batch_size and methods are present
statusReason: expected { supported: false } to deeply equal { supported: true, params: { …(2) } }
