[Killed] BooleanLiteral
src/model/MintInfo.ts:434:27
   private checkNut29() {
     const nut29 = this._mintInfo.nuts?.[29];
     if (nut29) {
-      return { supported: true, params: MintInfo.snapshot(nut29) };
+      return { supported: false, params: MintInfo.snapshot(nut29) };
     }
     return { supported: false };
killedBy: NUT-29 max_batch_size enforcement throws when entries.length exceeds max_batch_size
statusReason: promise resolved "{ method: 'bolt11', …(3) }" instead of rejecting

[Killed] ObjectLiteral
src/model/MintInfo.ts:434:14
   private checkNut29() {
     const nut29 = this._mintInfo.nuts?.[29];
     if (nut29) {
-      return { supported: true, params: MintInfo.snapshot(nut29) };
+      return {};
     }
     return { supported: false };
killedBy: MintInfo NUT-29 batch minting info returns supported:true with correct params when both max_batch_size and methods are present
statusReason: expected {} to deeply equal { supported: true, params: { …(2) } }

[Killed] BlockStatement
src/model/MintInfo.ts:445:76
    * Bounds a mint-advertised list to `MAX_MINT_INFO_LIST` before any per-entry work, warning once
    * when it truncates. Guards against memory amplification from a hostile `/v1/info`.
    */
-  private static capList<T>(list: T[], label: string, logger: Logger): T[] {
-    if (list.length <= MAX_MINT_INFO_LIST) return list;
-    logger.warn(`MintInfo: ${label} exceeds internal cap and was truncated`, {
-      advertised: list.length,
-      cap: MAX_MINT_INFO_LIST,
-    });
-    return list.slice(0, MAX_MINT_INFO_LIST);
-  }
+  private static capList<T>(list: T[], label: string, logger: Logger): T[] {}
 
   private toEndpoints(maybe: unknown, logger: Logger): Endpoint[] {
killedBy: wallet.maxSpendableAfterFees returns total minus feeReserve when input fees are zero
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] EqualityOperator
src/model/MintInfo.ts:446:9
    * when it truncates. Guards against memory amplification from a hostile `/v1/info`.
    */
   private static capList<T>(list: T[], label: string, logger: Logger): T[] {
-    if (list.length <= MAX_MINT_INFO_LIST) return list;
+    if (list.length < MAX_MINT_INFO_LIST) return list;
     logger.warn(`MintInfo: ${label} exceeds internal cap and was truncated`, {
       advertised: list.length,
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/model/MintInfo.ts:446:9
    * when it truncates. Guards against memory amplification from a hostile `/v1/info`.
    */
   private static capList<T>(list: T[], label: string, logger: Logger): T[] {
-    if (list.length <= MAX_MINT_INFO_LIST) return list;
+    if (true) return list;
     logger.warn(`MintInfo: ${label} exceeds internal cap and was truncated`, {
       advertised: list.length,
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
src/model/MintInfo.ts:447:17
    */
   private static capList<T>(list: T[], label: string, logger: Logger): T[] {
     if (list.length <= MAX_MINT_INFO_LIST) return list;
-    logger.warn(`MintInfo: ${label} exceeds internal cap and was truncated`, {
+    logger.warn(``, {
       advertised: list.length,
       cap: MAX_MINT_INFO_LIST,
killedBy: MintInfo list caps truncates an oversized NUT-04 method list and warns
statusReason: expected "vi.fn()" to be called with arguments: [ StringMatching /methods/i, …(1) ]

Received:

  1st vi.fn() call:

  [
-   StringMatching /methods/i,

[Killed] MethodExpression
src/model/MintInfo.ts:451:12
       advertised: list.length,
       cap: MAX_MINT_INFO_LIST,
     });
-    return list.slice(0, MAX_MINT_INFO_LIST);
+    return list;
   }
 
killedBy: MintInfo list caps truncates an oversized NUT-04 method list and warns
statusReason: expected [ { method: 'bolt11', …(4) }, …(1028) ] to have a length of 1024 but got 1029

[Killed] BlockStatement
src/model/MintInfo.ts:454:67
     return list.slice(0, MAX_MINT_INFO_LIST);
   }
 
-  private toEndpoints(maybe: unknown, logger: Logger): Endpoint[] {
-    if (!Array.isArray(maybe)) return [];
-    const bounded = MintInfo.capList(maybe, 'nuts.21/22.protected_endpoints', logger);
-    const out: Endpoint[] = [];
-    for (const e of bounded) {
-      if (e && typeof e === 'object') {
-        const rec = e as Record<string, unknown>;
-        const mm = rec.method;
-        const pp = rec.path;
-        if (typeof mm === 'string' && typeof pp === 'string') {
-          const method = mm.toUpperCase();
-          if (method === 'GET' || method === 'POST') {
-            out.push({ method, path: pp });
-          }
-        }
-      }
-    }
-    return out;
-  }
+  private toEndpoints(maybe: unknown, logger: Logger): Endpoint[] {}
 
   private buildIndex(endpoints?: Endpoint[]): ProtectedIndex | undefined {
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/model/MintInfo.ts:455:9
   }
 
   private toEndpoints(maybe: unknown, logger: Logger): Endpoint[] {
-    if (!Array.isArray(maybe)) return [];
+    if (true) return [];
     const bounded = MintInfo.capList(maybe, 'nuts.21/22.protected_endpoints', logger);
     const out: Endpoint[] = [];
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/model/MintInfo.ts:455:9
   }
 
   private toEndpoints(maybe: unknown, logger: Logger): Endpoint[] {
-    if (!Array.isArray(maybe)) return [];
+    if (Array.isArray(maybe)) return [];
     const bounded = MintInfo.capList(maybe, 'nuts.21/22.protected_endpoints', logger);
     const out: Endpoint[] = [];
killedBy: wallet.maxSpendableAfterFees returns total minus feeReserve when input fees are zero
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/model/MintInfo.ts:458:30
     if (!Array.isArray(maybe)) return [];
     const bounded = MintInfo.capList(maybe, 'nuts.21/22.protected_endpoints', logger);
     const out: Endpoint[] = [];
-    for (const e of bounded) {
-      if (e && typeof e === 'object') {
-        const rec = e as Record<string, unknown>;
-        const mm = rec.method;
-        const pp = rec.path;
-        if (typeof mm === 'string' && typeof pp === 'string') {
-          const method = mm.toUpperCase();
-          if (method === 'GET' || method === 'POST') {
-            out.push({ method, path: pp });
-          }
-        }
-      }
-    }
+    for (const e of bounded) {}
     return out;
   }
killedBy: async melt preference body bolt11: blind auth sends Blind-auth header
statusReason: HTTP request failed

[Killed] ConditionalExpression
src/model/MintInfo.ts:459:11
     const bounded = MintInfo.capList(maybe, 'nuts.21/22.protected_endpoints', logger);
     const out: Endpoint[] = [];
     for (const e of bounded) {
-      if (e && typeof e === 'object') {
+      if (true) {
         const rec = e as Record<string, unknown>;
         const mm = rec.method;
killedBy: MintInfo protected endpoint matching skips malformed protected_endpoints entries and upcases the method
statusReason: Cannot read properties of null (reading 'method')

[Killed] LogicalOperator
src/model/MintInfo.ts:459:11
     const bounded = MintInfo.capList(maybe, 'nuts.21/22.protected_endpoints', logger);
     const out: Endpoint[] = [];
     for (const e of bounded) {
-      if (e && typeof e === 'object') {
+      if (e || typeof e === 'object') {
         const rec = e as Record<string, unknown>;
         const mm = rec.method;
killedBy: MintInfo protected endpoint matching skips malformed protected_endpoints entries and upcases the method
statusReason: Cannot read properties of null (reading 'method')

[Killed] ConditionalExpression
src/model/MintInfo.ts:463:39
         const rec = e as Record<string, unknown>;
         const mm = rec.method;
         const pp = rec.path;
-        if (typeof mm === 'string' && typeof pp === 'string') {
+        if (typeof mm === 'string' && true) {
           const method = mm.toUpperCase();
           if (method === 'GET' || method === 'POST') {
killedBy: MintInfo protected endpoint matching skips malformed protected_endpoints entries and upcases the method
statusReason: p.startsWith is not a function

[Killed] ConditionalExpression
src/model/MintInfo.ts:463:13
         const rec = e as Record<string, unknown>;
         const mm = rec.method;
         const pp = rec.path;
-        if (typeof mm === 'string' && typeof pp === 'string') {
+        if (false) {
           const method = mm.toUpperCase();
           if (method === 'GET' || method === 'POST') {
killedBy: MintInfo protected endpoint matching matches exact literal path
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/model/MintInfo.ts:464:26
         const mm = rec.method;
         const pp = rec.path;
         if (typeof mm === 'string' && typeof pp === 'string') {
-          const method = mm.toUpperCase();
+          const method = mm.toLowerCase();
           if (method === 'GET' || method === 'POST') {
             out.push({ method, path: pp });
killedBy: MintInfo protected endpoint matching matches exact literal path
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/model/MintInfo.ts:465:15
         const pp = rec.path;
         if (typeof mm === 'string' && typeof pp === 'string') {
           const method = mm.toUpperCase();
-          if (method === 'GET' || method === 'POST') {
+          if (false) {
             out.push({ method, path: pp });
           }
killedBy: MintInfo protected endpoint matching matches exact literal path
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/model/MintInfo.ts:465:15
         const pp = rec.path;
         if (typeof mm === 'string' && typeof pp === 'string') {
           const method = mm.toUpperCase();
-          if (method === 'GET' || method === 'POST') {
+          if (false || method === 'POST') {
             out.push({ method, path: pp });
           }
killedBy: MintInfo protected endpoint matching matches prefix pattern ^/path/.*
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/model/MintInfo.ts:475:9
   }
 
   private buildIndex(endpoints?: Endpoint[]): ProtectedIndex | undefined {
-    if (!endpoints?.length) return undefined;
+    if (false) return undefined;
 
     const exact: ProtectedIndex['exact'] = { GET: new Set(), POST: new Set() };
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/model/MintInfo.ts:475:9
   }
 
   private buildIndex(endpoints?: Endpoint[]): ProtectedIndex | undefined {
-    if (!endpoints?.length) return undefined;
+    if (true) return undefined;
 
     const exact: ProtectedIndex['exact'] = { GET: new Set(), POST: new Set() };
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
src/model/MintInfo.ts:478:46
     if (!endpoints?.length) return undefined;
 
     const exact: ProtectedIndex['exact'] = { GET: new Set(), POST: new Set() };
-    const prefix: ProtectedIndex['prefix'] = { GET: [], POST: [] };
+    const prefix: ProtectedIndex['prefix'] = {};
 
     for (const e of endpoints) {
killedBy: MintInfo protected endpoint matching matches exact literal path
statusReason: Cannot read properties of undefined (reading 'sort')

[Killed] BlockStatement
src/model/MintInfo.ts:480:32
     const exact: ProtectedIndex['exact'] = { GET: new Set(), POST: new Set() };
     const prefix: ProtectedIndex['prefix'] = { GET: [], POST: [] };
 
-    for (const e of endpoints) {
-      let p = e.path;
-
-      // Handle deprecated regex formatting (backwards compat)
-      // TODO: remove once mints support revised glob wildcard
-      // See: https://github.com/cashubtc/nuts/pull/334
-      if (p.startsWith('^')) p = p.slice(1);
-      if (p.endsWith('$')) p = p.slice(0, -1);
-
-      // Deprecated regex prefix formatting (backwards compat)
-      if (p.endsWith('.*')) {
-        prefix[e.method].push(p.slice(0, -2));
-        continue;
-      }
-
-      // Glob style prefix match
-      if (p.endsWith('*')) {
-        prefix[e.method].push(p.slice(0, -1));
-        continue;
-      }
-
-      // Exact match
-      exact[e.method].add(p);
-    }
+    for (const e of endpoints) {}
 
     // Optional: longer prefixes first for faster early exits
killedBy: MintInfo protected endpoint matching matches exact literal path
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/model/MintInfo.ts:486:11
       // Handle deprecated regex formatting (backwards compat)
       // TODO: remove once mints support revised glob wildcard
       // See: https://github.com/cashubtc/nuts/pull/334
-      if (p.startsWith('^')) p = p.slice(1);
+      if (p.endsWith('^')) p = p.slice(1);
       if (p.endsWith('$')) p = p.slice(0, -1);
 
killedBy: MintInfo protected endpoint matching matches exact anchored path ^...$
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/model/MintInfo.ts:486:11
       // Handle deprecated regex formatting (backwards compat)
       // TODO: remove once mints support revised glob wildcard
       // See: https://github.com/cashubtc/nuts/pull/334
-      if (p.startsWith('^')) p = p.slice(1);
+      if (true) p = p.slice(1);
       if (p.endsWith('$')) p = p.slice(0, -1);
 
killedBy: MintInfo protected endpoint matching matches exact literal path
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/model/MintInfo.ts:487:11
       // TODO: remove once mints support revised glob wildcard
       // See: https://github.com/cashubtc/nuts/pull/334
       if (p.startsWith('^')) p = p.slice(1);
-      if (p.endsWith('$')) p = p.slice(0, -1);
+      if (false) p = p.slice(0, -1);
 
       // Deprecated regex prefix formatting (backwards compat)
killedBy: MintInfo protected endpoint matching matches exact anchored path ^...$
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/model/MintInfo.ts:487:32
       // TODO: remove once mints support revised glob wildcard
       // See: https://github.com/cashubtc/nuts/pull/334
       if (p.startsWith('^')) p = p.slice(1);
-      if (p.endsWith('$')) p = p.slice(0, -1);
+      if (p.endsWith('$')) p = p;
 
       // Deprecated regex prefix formatting (backwards compat)
killedBy: MintInfo protected endpoint matching matches exact anchored path ^...$
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/model/MintInfo.ts:490:29
       if (p.endsWith('$')) p = p.slice(0, -1);
 
       // Deprecated regex prefix formatting (backwards compat)
-      if (p.endsWith('.*')) {
-        prefix[e.method].push(p.slice(0, -2));
-        continue;
-      }
+      if (p.endsWith('.*')) {}
 
       // Glob style prefix match
killedBy: MintInfo protected endpoint matching matches prefix pattern ^/path/.*
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/model/MintInfo.ts:490:11
       if (p.endsWith('$')) p = p.slice(0, -1);
 
       // Deprecated regex prefix formatting (backwards compat)
-      if (p.endsWith('.*')) {
+      if (p.startsWith('.*')) {
         prefix[e.method].push(p.slice(0, -2));
         continue;
killedBy: MintInfo protected endpoint matching matches prefix pattern ^/path/.*
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/model/MintInfo.ts:491:31
 
       // Deprecated regex prefix formatting (backwards compat)
       if (p.endsWith('.*')) {
-        prefix[e.method].push(p.slice(0, -2));
+        prefix[e.method].push(p);
         continue;
       }
killedBy: MintInfo protected endpoint matching matches prefix pattern ^/path/.*
statusReason: expected false to be true // Object.is equality

[Killed] UnaryOperator
src/model/MintInfo.ts:491:42
 
       // Deprecated regex prefix formatting (backwards compat)
       if (p.endsWith('.*')) {
-        prefix[e.method].push(p.slice(0, -2));
+        prefix[e.method].push(p.slice(0, +2));
         continue;
       }
killedBy: MintInfo protected endpoint matching matches prefix pattern ^/path/.*
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/model/MintInfo.ts:496:28
       }
 
       // Glob style prefix match
-      if (p.endsWith('*')) {
-        prefix[e.method].push(p.slice(0, -1));
-        continue;
-      }
+      if (p.endsWith('*')) {}
 
       // Exact match
killedBy: MintInfo protected endpoint matching matches prefix pattern /path/*
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/model/MintInfo.ts:496:11
       }
 
       // Glob style prefix match
-      if (p.endsWith('*')) {
+      if (true) {
         prefix[e.method].push(p.slice(0, -1));
         continue;
killedBy: MintInfo protected endpoint matching matches exact literal path
statusReason: expected true to be false // Object.is equality

[Killed] UnaryOperator
src/model/MintInfo.ts:497:42
 
       // Glob style prefix match
       if (p.endsWith('*')) {
-        prefix[e.method].push(p.slice(0, -1));
+        prefix[e.method].push(p.slice(0, +1));
         continue;
       }
killedBy: MintInfo protected endpoint matching matches prefix pattern /path/*
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/model/MintInfo.ts:497:31
 
       // Glob style prefix match
       if (p.endsWith('*')) {
-        prefix[e.method].push(p.slice(0, -1));
+        prefix[e.method].push(p);
         continue;
       }
killedBy: MintInfo protected endpoint matching matches prefix pattern /path/*
statusReason: expected false to be true // Object.is equality

[Killed] CallExpression
src/model/MintInfo.ts:502:7
       }
 
       // Exact match
-      exact[e.method].add(p);
+      ;
     }
 
killedBy: MintInfo protected endpoint matching matches exact literal path
statusReason: expected false to be true // Object.is equality

[NoCoverage] ArithmeticOperator
src/model/MintInfo.ts:506:31
     }
 
     // Optional: longer prefixes first for faster early exits
-    prefix.GET.sort((a, b) => b.length - a.length);
+    prefix.GET.sort((a, b) => b.length + a.length);
     prefix.POST.sort((a, b) => b.length - a.length);
 

[Survived] ArrowFunction
src/model/MintInfo.ts:506:21
     }
 
     // Optional: longer prefixes first for faster early exits
-    prefix.GET.sort((a, b) => b.length - a.length);
+    prefix.GET.sort(() => undefined);
     prefix.POST.sort((a, b) => b.length - a.length);
 

[NoCoverage] ArithmeticOperator
src/model/MintInfo.ts:507:32
 
     // Optional: longer prefixes first for faster early exits
     prefix.GET.sort((a, b) => b.length - a.length);
-    prefix.POST.sort((a, b) => b.length - a.length);
+    prefix.POST.sort((a, b) => b.length + a.length);
 
     return { exact, prefix };

[Survived] MethodExpression
src/model/MintInfo.ts:507:5
 
     // Optional: longer prefixes first for faster early exits
     prefix.GET.sort((a, b) => b.length - a.length);
-    prefix.POST.sort((a, b) => b.length - a.length);
+    prefix.POST;
 
     return { exact, prefix };

[Killed] BlockStatement
src/model/MintInfo.ts:521:54
    * reference is safe and structural copying would strip its prototype into a bare `{value}`.
    * Nesting past MAX_MINT_INFO_DEPTH throws rather than running the stack out.
    */
-  private static snapshot<T>(value: T, depth = 0): T {
-    if (value === null || typeof value !== 'object') return value;
-    if (value instanceof Amount) return value;
-    if (depth > MAX_MINT_INFO_DEPTH) {
-      throw new CTSError(`Mint info nesting exceeds ${MAX_MINT_INFO_DEPTH} levels`);
-    }
-    if (Array.isArray(value)) {
-      return (value as unknown[]).map((v) => MintInfo.snapshot(v, depth + 1)) as T;
-    }
-    const out: Record<string, unknown> = {};
-    for (const [k, v] of Object.entries(value as Record<string, unknown>)) {
-      out[k] = MintInfo.snapshot(v, depth + 1);
-    }
-    return out as T;
-  }
+  private static snapshot<T>(value: T, depth = 0): T {}
 
   /**
killedBy: requestTokens test requestTokens
statusReason: Cannot read properties of undefined (reading 'find')

[Killed] LogicalOperator
src/model/MintInfo.ts:522:9
    * Nesting past MAX_MINT_INFO_DEPTH throws rather than running the stack out.
    */
   private static snapshot<T>(value: T, depth = 0): T {
-    if (value === null || typeof value !== 'object') return value;
+    if (value === null && typeof value !== 'object') return value;
     if (value instanceof Amount) return value;
     if (depth > MAX_MINT_INFO_DEPTH) {
killedBy: melt proofs test melt proofs base case
statusReason: Mint info nesting exceeds 64 levels

[Killed] ConditionalExpression
src/model/MintInfo.ts:522:27
    * Nesting past MAX_MINT_INFO_DEPTH throws rather than running the stack out.
    */
   private static snapshot<T>(value: T, depth = 0): T {
-    if (value === null || typeof value !== 'object') return value;
+    if (value === null || false) return value;
     if (value instanceof Amount) return value;
     if (depth > MAX_MINT_INFO_DEPTH) {
killedBy: melt proofs test melt proofs base case
statusReason: Mint info nesting exceeds 64 levels

[Killed] ConditionalExpression
src/model/MintInfo.ts:523:9
    */
   private static snapshot<T>(value: T, depth = 0): T {
     if (value === null || typeof value !== 'object') return value;
-    if (value instanceof Amount) return value;
+    if (false) return value;
     if (depth > MAX_MINT_INFO_DEPTH) {
       throw new CTSError(`Mint info nesting exceeds ${MAX_MINT_INFO_DEPTH} levels`);
killedBy: MintInfo snapshot accessors preserves Amount instances (AmountLike) through the snapshot
statusReason: expected { value: 100n } to be an instance of Amount

[Killed] ConditionalExpression
src/model/MintInfo.ts:523:9
    */
   private static snapshot<T>(value: T, depth = 0): T {
     if (value === null || typeof value !== 'object') return value;
-    if (value instanceof Amount) return value;
+    if (true) return value;
     if (depth > MAX_MINT_INFO_DEPTH) {
       throw new CTSError(`Mint info nesting exceeds ${MAX_MINT_INFO_DEPTH} levels`);
killedBy: MintInfo snapshot accessors mutating a getMintMeltMethod result cannot pollute the cache
statusReason: expected [Function] to not throw an error but 'TypeError: Do not know how to seriali…' was thrown

[Killed] EqualityOperator
src/model/MintInfo.ts:524:9
   private static snapshot<T>(value: T, depth = 0): T {
     if (value === null || typeof value !== 'object') return value;
     if (value instanceof Amount) return value;
-    if (depth > MAX_MINT_INFO_DEPTH) {
+    if (depth <= MAX_MINT_INFO_DEPTH) {
       throw new CTSError(`Mint info nesting exceeds ${MAX_MINT_INFO_DEPTH} levels`);
     }
killedBy: MintInfo protected endpoint matching maps NUT-19 ttl null to Infinity
statusReason: Mint info nesting exceeds 64 levels

[Killed] ConditionalExpression
src/model/MintInfo.ts:524:9
   private static snapshot<T>(value: T, depth = 0): T {
     if (value === null || typeof value !== 'object') return value;
     if (value instanceof Amount) return value;
-    if (depth > MAX_MINT_INFO_DEPTH) {
+    if (false) {
       throw new CTSError(`Mint info nesting exceeds ${MAX_MINT_INFO_DEPTH} levels`);
     }
killedBy: MintInfo retained list caps rejects metadata nested past the snapshot depth limit
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/model/MintInfo.ts:527:9
     if (depth > MAX_MINT_INFO_DEPTH) {
       throw new CTSError(`Mint info nesting exceeds ${MAX_MINT_INFO_DEPTH} levels`);
     }
-    if (Array.isArray(value)) {
+    if (false) {
       return (value as unknown[]).map((v) => MintInfo.snapshot(v, depth + 1)) as T;
     }
killedBy: MintInfo protected endpoint matching maps NUT-19 ttl null to Infinity
statusReason: expected { supported: true, params: { …(2) } } to deeply equal { supported: true, params: { …(2) } }

[Killed] ConditionalExpression
src/model/MintInfo.ts:527:9
     if (depth > MAX_MINT_INFO_DEPTH) {
       throw new CTSError(`Mint info nesting exceeds ${MAX_MINT_INFO_DEPTH} levels`);
     }
-    if (Array.isArray(value)) {
+    if (true) {
       return (value as unknown[]).map((v) => MintInfo.snapshot(v, depth + 1)) as T;
     }
killedBy: MintInfo protected endpoint matching maps NUT-19 ttl null to Infinity
statusReason: value.map is not a function

[Killed] BlockStatement
src/model/MintInfo.ts:531:76
       return (value as unknown[]).map((v) => MintInfo.snapshot(v, depth + 1)) as T;
     }
     const out: Record<string, unknown> = {};
-    for (const [k, v] of Object.entries(value as Record<string, unknown>)) {
-      out[k] = MintInfo.snapshot(v, depth + 1);
-    }
+    for (const [k, v] of Object.entries(value as Record<string, unknown>)) {}
     return out as T;
   }
killedBy: MintInfo protected endpoint matching maps NUT-19 ttl null to Infinity
statusReason: expected { supported: true, params: { …(2) } } to deeply equal { supported: true, params: { …(2) } }

[Killed] ArithmeticOperator
src/model/MintInfo.ts:532:37
     }
     const out: Record<string, unknown> = {};
     for (const [k, v] of Object.entries(value as Record<string, unknown>)) {
-      out[k] = MintInfo.snapshot(v, depth + 1);
+      out[k] = MintInfo.snapshot(v, depth - 1);
     }
     return out as T;
killedBy: MintInfo retained list caps rejects metadata nested past the snapshot depth limit
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/model/MintInfo.ts:540:32
   /**
    * Snapshot of the full mint info response, safe to mutate or persist.
    */
-  get cache(): GetInfoResponse {
-    return MintInfo.snapshot(this._mintInfo);
-  }
+  get cache(): GetInfoResponse {}
   get contact() {
     return MintInfo.snapshot(this._mintInfo.contact);
killedBy: MintInfo method/unit capability checks getMintMeltMethod returns the matched settings, also after a JSON round-trip
statusReason: "undefined" is not valid JSON

[Killed] BlockStatement
src/model/MintInfo.ts:543:17
   get cache(): GetInfoResponse {
     return MintInfo.snapshot(this._mintInfo);
   }
-  get contact() {
-    return MintInfo.snapshot(this._mintInfo.contact);
-  }
+  get contact() {}
   get description() {
     return this._mintInfo.description;
killedBy: MintInfo snapshot accessors cache, nuts and contact return snapshots
statusReason: Cannot set properties of undefined (setting 'length')

[Killed] BlockStatement
src/model/MintInfo.ts:546:21
   get contact() {
     return MintInfo.snapshot(this._mintInfo.contact);
   }
-  get description() {
-    return this._mintInfo.description;
-  }
+  get description() {}
   get description_long() {
     return this._mintInfo.description_long;
killedBy: test info test info
statusReason: expected undefined to deeply equal 'Mint for testing Cashu wallets'

[Killed] BlockStatement
src/model/MintInfo.ts:549:26
   get description() {
     return this._mintInfo.description;
   }
-  get description_long() {
-    return this._mintInfo.description_long;
-  }
+  get description_long() {}
   get name() {
     return this._mintInfo.name;
killedBy: test info test info
statusReason: expected undefined to deeply equal 'This mint usually runs the latest mai…'

[Killed] BlockStatement
src/model/MintInfo.ts:552:14
   get description_long() {
     return this._mintInfo.description_long;
   }
-  get name() {
-    return this._mintInfo.name;
-  }
+  get name() {}
   get pubkey() {
     return this._mintInfo.pubkey;
killedBy: test wallet init should initialize with mint instance and load mint info, keys, and keysets
statusReason: expected undefined to be 'Testnut mint' // Object.is equality

[Killed] BlockStatement
src/model/MintInfo.ts:555:16
   get name() {
     return this._mintInfo.name;
   }
-  get pubkey() {
-    return this._mintInfo.pubkey;
-  }
+  get pubkey() {}
   get nuts() {
     return MintInfo.snapshot(this._mintInfo.nuts);
killedBy: test wallet init should initialize with mint instance and load mint info, keys, and keysets
statusReason: expected undefined to be '0296d0aa13b6a31cf0cd974249f28c7b7176d…' // Object.is equality

[Killed] BlockStatement
src/model/MintInfo.ts:558:14
   get pubkey() {
     return this._mintInfo.pubkey;
   }
-  get nuts() {
-    return MintInfo.snapshot(this._mintInfo.nuts);
-  }
+  get nuts() {}
   get version() {
     return this._mintInfo.version;
killedBy: test info test info
statusReason: expected undefined to deeply equal { …(11) }
