[Killed] BlockStatement
src/model/MintInfo.ts:561:17
   get nuts() {
     return MintInfo.snapshot(this._mintInfo.nuts);
   }
-  get version() {
-    return this._mintInfo.version;
-  }
+  get version() {}
   get motd() {
     return this._mintInfo.motd;
killedBy: test info test info
statusReason: expected undefined to deeply equal 'Nutshell/0.16.3'

[Killed] BlockStatement
src/model/MintInfo.ts:564:14
   get version() {
     return this._mintInfo.version;
   }
-  get motd() {
-    return this._mintInfo.motd;
-  }
+  get motd() {}
   get icon_url() {
     return this._mintInfo.icon_url;
killedBy: test info test info
statusReason: expected undefined to deeply equal 'This is a message of the day field. Y…'

[Killed] BlockStatement
src/model/MintInfo.ts:567:18
   get motd() {
     return this._mintInfo.motd;
   }
-  get icon_url() {
-    return this._mintInfo.icon_url;
-  }
+  get icon_url() {}
   /**
    * Endpoint URLs the mint advertises for itself. Informational only: whether to trust or switch to
killedBy: MintInfo NUT-06 informational fields exposes urls, time, tos_url and icon_url and preserves them in cache
statusReason: expected undefined to be 'https://mint.host/icon.jpg' // Object.is equality

[Killed] BlockStatement
src/model/MintInfo.ts:574:14
    * Endpoint URLs the mint advertises for itself. Informational only: whether to trust or switch to
    * any of them is the consumer's decision.
    */
-  get urls() {
-    return MintInfo.snapshot(this._mintInfo.urls);
-  }
+  get urls() {}
   /**
    * Current server time as a Unix timestamp in seconds.
killedBy: MintInfo NUT-06 informational fields exposes urls, time, tos_url and icon_url and preserves them in cache
statusReason: expected undefined to deeply equal [ 'https://mint.host', …(1) ]

[Killed] BlockStatement
src/model/MintInfo.ts:580:14
   /**
    * Current server time as a Unix timestamp in seconds.
    */
-  get time() {
-    return this._mintInfo.time;
-  }
+  get time() {}
   get tos_url() {
     return this._mintInfo.tos_url;
killedBy: MintInfo NUT-06 informational fields exposes urls, time, tos_url and icon_url and preserves them in cache
statusReason: expected undefined to be 1725304480 // Object.is equality

[Killed] BlockStatement
src/model/MintInfo.ts:583:17
   get time() {
     return this._mintInfo.time;
   }
-  get tos_url() {
-    return this._mintInfo.tos_url;
-  }
+  get tos_url() {}
   /**
    * NUT-06: max length the mint accepts for any array in a request (`inputs`, `outputs`, `Ys`).
killedBy: MintInfo NUT-06 informational fields exposes urls, time, tos_url and icon_url and preserves them in cache
statusReason: expected undefined to be 'https://mint.host/tos' // Object.is equality

[Killed] BlockStatement
src/model/MintInfo.ts:590:32
    * NUT-06: max length the mint accepts for any array in a request (`inputs`, `outputs`, `Ys`).
    * Always a usable number: the library default when the mint advertises none.
    */
-  get maxArrayLength(): number {
-    return this._maxArrayLength;
-  }
+  get maxArrayLength(): number {}
 
   /**
killedBy: MintInfo max_array_length (NUT-06) defaults to the library default when the mint advertises none
statusReason: expected undefined to be 500 // Object.is equality

[Killed] BlockStatement
src/model/MintInfo.ts:601:81
    * @param method - The payment method to check ('bolt11' or 'bolt12')
    * @returns True if the mint supports description for the method, false otherwise.
    */
-  supportsNut04Description(method: 'bolt11' | 'bolt12', unit?: string): boolean {
-    return this._mintInfo.nuts[4]?.methods.some(
-      (met) =>
-        met.method === method &&
-        (unit ? met.unit === unit : true) &&
-        (met.options?.description === true || met.description === true),
-    );
-  }
+  supportsNut04Description(method: 'bolt11' | 'bolt12', unit?: string): boolean {}
 
   /**
killedBy: test info supportsNut04Description respects per-unit description support
statusReason: expected undefined to be true // Object.is equality

[Killed] MethodExpression
src/model/MintInfo.ts:602:12
    * @returns True if the mint supports description for the method, false otherwise.
    */
   supportsNut04Description(method: 'bolt11' | 'bolt12', unit?: string): boolean {
-    return this._mintInfo.nuts[4]?.methods.some(
-      (met) =>
-        met.method === method &&
-        (unit ? met.unit === unit : true) &&
-        (met.options?.description === true || met.description === true),
-    );
+    return this._mintInfo.nuts[4]?.methods.every(met => met.method === method && (unit ? met.unit === unit : true) && (met.options?.description === true || met.description === true));
   }
 
killedBy: test info supportsNut04Description respects per-unit description support
statusReason: expected false to be true // Object.is equality

[Killed] OptionalChaining
src/model/MintInfo.ts:602:12
    * @returns True if the mint supports description for the method, false otherwise.
    */
   supportsNut04Description(method: 'bolt11' | 'bolt12', unit?: string): boolean {
-    return this._mintInfo.nuts[4]?.methods.some(
+    return this._mintInfo.nuts[4].methods.some(
       (met) =>
         met.method === method &&
killedBy: MintInfo method/unit capability checks supportsNut04Description is falsy when NUT-4 info is absent
statusReason: Cannot read properties of undefined (reading 'methods')

[Killed] ArrowFunction
src/model/MintInfo.ts:603:7
    */
   supportsNut04Description(method: 'bolt11' | 'bolt12', unit?: string): boolean {
     return this._mintInfo.nuts[4]?.methods.some(
-      (met) =>
-        met.method === method &&
-        (unit ? met.unit === unit : true) &&
-        (met.options?.description === true || met.description === true),
+      () => undefined,
     );
   }
killedBy: test info supportsNut04Description respects per-unit description support
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/model/MintInfo.ts:604:9
   supportsNut04Description(method: 'bolt11' | 'bolt12', unit?: string): boolean {
     return this._mintInfo.nuts[4]?.methods.some(
       (met) =>
-        met.method === method &&
-        (unit ? met.unit === unit : true) &&
+        met.method === method || (unit ? met.unit === unit : true) &&
         (met.options?.description === true || met.description === true),
     );
killedBy: MintInfo method/unit capability checks supportsNut04Description matches on unit when given, any unit otherwise
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/model/MintInfo.ts:604:9
   supportsNut04Description(method: 'bolt11' | 'bolt12', unit?: string): boolean {
     return this._mintInfo.nuts[4]?.methods.some(
       (met) =>
-        met.method === method &&
-        (unit ? met.unit === unit : true) &&
-        (met.options?.description === true || met.description === true),
+        met.method === method && (unit ? met.unit === unit : true) || met.options?.description === true || met.description === true,
     );
   }
killedBy: test info test info
statusReason: expected true to be falsy

[Killed] ConditionalExpression
src/model/MintInfo.ts:605:17
     return this._mintInfo.nuts[4]?.methods.some(
       (met) =>
         met.method === method &&
-        (unit ? met.unit === unit : true) &&
+        (unit ? true : true) &&
         (met.options?.description === true || met.description === true),
     );
killedBy: MintInfo method/unit capability checks supportsNut04Description matches on unit when given, any unit otherwise
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/model/MintInfo.ts:605:37
     return this._mintInfo.nuts[4]?.methods.some(
       (met) =>
         met.method === method &&
-        (unit ? met.unit === unit : true) &&
+        (unit ? met.unit === unit : false) &&
         (met.options?.description === true || met.description === true),
     );
killedBy: MintInfo method/unit capability checks supportsNut04Description matches on unit when given, any unit otherwise
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/model/MintInfo.ts:606:39
       (met) =>
         met.method === method &&
         (unit ? met.unit === unit : true) &&
-        (met.options?.description === true || met.description === true),
+        (met.options?.description === false || met.description === true),
     );
   }
killedBy: MintInfo method/unit capability checks supportsNut04Description matches on unit when given, any unit otherwise
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/model/MintInfo.ts:606:10
       (met) =>
         met.method === method &&
         (unit ? met.unit === unit : true) &&
-        (met.options?.description === true || met.description === true),
+        (met.options?.description === true && met.description === true),
     );
   }
killedBy: test info supportsNut04Description respects per-unit description support
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/model/MintInfo.ts:616:55
    * mint or melt with; to test a single pair use `supportsMintMeltMethod`, or `getMintMeltMethod`
    * to read its settings.
    */
-  supportedMethods(op: 'mint' | 'melt'): SwapMethod[] {
-    const { disabled, params } = this.isSupported(op === 'mint' ? 4 : 5);
-    return disabled ? [] : params;
-  }
+  supportedMethods(op: 'mint' | 'melt'): SwapMethod[] {}
 
   /**
killedBy: MintInfo protected endpoint matching supportedMethods lists usable methods and returns [] for disabled ops
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
src/model/MintInfo.ts:617:51
    * to read its settings.
    */
   supportedMethods(op: 'mint' | 'melt'): SwapMethod[] {
-    const { disabled, params } = this.isSupported(op === 'mint' ? 4 : 5);
+    const { disabled, params } = this.isSupported(true ? 4 : 5);
     return disabled ? [] : params;
   }
killedBy: async melt preference body bolt11: blind auth sends Blind-auth header
statusReason: Mint does not support bolt11 melt for unit 'sat'

[Killed] ConditionalExpression
src/model/MintInfo.ts:617:51
    * to read its settings.
    */
   supportedMethods(op: 'mint' | 'melt'): SwapMethod[] {
-    const { disabled, params } = this.isSupported(op === 'mint' ? 4 : 5);
+    const { disabled, params } = this.isSupported(false ? 4 : 5);
     return disabled ? [] : params;
   }
killedBy: MintInfo protected endpoint matching supportedMethods lists usable methods and returns [] for disabled ops
statusReason: expected [] to deeply equal [ 'bolt11', 'bolt12' ]

[Killed] ArrayDeclaration
src/model/MintInfo.ts:618:23
    */
   supportedMethods(op: 'mint' | 'melt'): SwapMethod[] {
     const { disabled, params } = this.isSupported(op === 'mint' ? 4 : 5);
-    return disabled ? [] : params;
+    return disabled ? ["Stryker was here"] : params;
   }
 
killedBy: MintInfo protected endpoint matching supportedMethods lists usable methods and returns [] for disabled ops
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] BlockStatement
src/model/MintInfo.ts:626:96
    * (`'mint'` → NUT-4, `'melt'` → NUT-5), or `undefined` when the pair is unsupported or the
    * operation is disabled. The result carries the `min_amount`/`max_amount` limits and `options`.
    */
-  getMintMeltMethod(op: 'mint' | 'melt', method: string, unit: string): SwapMethod | undefined {
-    return this.supportedMethods(op).find((m) => m.method === method && m.unit === unit);
-  }
+  getMintMeltMethod(op: 'mint' | 'melt', method: string, unit: string): SwapMethod | undefined {}
 
   /**
killedBy: MintInfo method/unit capability checks getMintMeltMethod returns the matched settings, also after a JSON round-trip
statusReason: expected undefined to match object { min_amount: 1, max_amount: 10000 }

[Killed] ConditionalExpression
src/model/MintInfo.ts:627:73
    * operation is disabled. The result carries the `min_amount`/`max_amount` limits and `options`.
    */
   getMintMeltMethod(op: 'mint' | 'melt', method: string, unit: string): SwapMethod | undefined {
-    return this.supportedMethods(op).find((m) => m.method === method && m.unit === unit);
+    return this.supportedMethods(op).find((m) => m.method === method && true);
   }
 
killedBy: MintInfo method/unit capability checks getMintMeltMethod returns the matched settings, also after a JSON round-trip
statusReason: expected { method: 'bolt11', unit: 'sat', …(3) } to be undefined

[Killed] ArrowFunction
src/model/MintInfo.ts:627:43
    * operation is disabled. The result carries the `min_amount`/`max_amount` limits and `options`.
    */
   getMintMeltMethod(op: 'mint' | 'melt', method: string, unit: string): SwapMethod | undefined {
-    return this.supportedMethods(op).find((m) => m.method === method && m.unit === unit);
+    return this.supportedMethods(op).find(() => undefined);
   }
 
killedBy: MintInfo method/unit capability checks getMintMeltMethod returns the matched settings, also after a JSON round-trip
statusReason: expected undefined to match object { min_amount: 1, max_amount: 10000 }

[Killed] BlockStatement
src/model/MintInfo.ts:634:86
    * Checks if the mint advertises the given (method, unit) pair for the given operation (`'mint'` →
    * NUT-4, `'melt'` → NUT-5).
    */
-  supportsMintMeltMethod(op: 'mint' | 'melt', method: string, unit: string): boolean {
-    return this.getMintMeltMethod(op, method, unit) !== undefined;
-  }
+  supportsMintMeltMethod(op: 'mint' | 'melt', method: string, unit: string): boolean {}
 
   supportsAmountless(method: string = 'bolt11', unit: string = 'sat'): boolean {
killedBy: MintInfo method/unit capability checks supportsMintMeltMethod returns false when the operation is disabled
statusReason: expected undefined to be false // Object.is equality

[Killed] EqualityOperator
src/model/MintInfo.ts:635:12
    * NUT-4, `'melt'` → NUT-5).
    */
   supportsMintMeltMethod(op: 'mint' | 'melt', method: string, unit: string): boolean {
-    return this.getMintMeltMethod(op, method, unit) !== undefined;
+    return this.getMintMeltMethod(op, method, unit) === undefined;
   }
 
killedBy: requestTokens test requestTokens
statusReason: Mint does not support bolt11 mint for unit 'sat'

[Killed] ConditionalExpression
src/model/MintInfo.ts:635:12
    * NUT-4, `'melt'` → NUT-5).
    */
   supportsMintMeltMethod(op: 'mint' | 'melt', method: string, unit: string): boolean {
-    return this.getMintMeltMethod(op, method, unit) !== undefined;
+    return false;
   }
 
killedBy: MintInfo snapshot accessors supportedMethods and isSupported(4).params return copies
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/model/MintInfo.ts:638:80
     return this.getMintMeltMethod(op, method, unit) !== undefined;
   }
 
-  supportsAmountless(method: string = 'bolt11', unit: string = 'sat'): boolean {
-    const meltMethods = this._mintInfo?.nuts?.[5]?.methods ?? [];
-
-    if (!Array.isArray(meltMethods)) return false;
-
-    return meltMethods.some(
-      (met) => met.method === method && met.unit === unit && met.options?.amountless === true,
-    );
-  }
+  supportsAmountless(method: string = 'bolt11', unit: string = 'sat'): boolean {}
 }
 
killedBy: createMeltQuoteBolt11 mutants attaches amountless options for an amountless invoice on a supporting mint
statusReason: expected undefined to be defined

[Killed] StringLiteral
src/model/MintInfo.ts:638:39
     return this.getMintMeltMethod(op, method, unit) !== undefined;
   }
 
-  supportsAmountless(method: string = 'bolt11', unit: string = 'sat'): boolean {
+  supportsAmountless(method: string = "", unit: string = 'sat'): boolean {
     const meltMethods = this._mintInfo?.nuts?.[5]?.methods ?? [];
 
killedBy: MintInfo method/unit capability checks supportsAmountless defaults to bolt11/sat and requires an exact method/unit match
statusReason: expected false to be true // Object.is equality

[Killed] OptionalChaining
src/model/MintInfo.ts:639:25
   }
 
   supportsAmountless(method: string = 'bolt11', unit: string = 'sat'): boolean {
-    const meltMethods = this._mintInfo?.nuts?.[5]?.methods ?? [];
+    const meltMethods = this._mintInfo?.nuts?.[5].methods ?? [];
 
     if (!Array.isArray(meltMethods)) return false;
killedBy: MintInfo method/unit capability checks supportsAmountless returns false when NUT-5 info is absent
statusReason: Cannot read properties of undefined (reading 'methods')

[Killed] LogicalOperator
src/model/MintInfo.ts:639:25
   }
 
   supportsAmountless(method: string = 'bolt11', unit: string = 'sat'): boolean {
-    const meltMethods = this._mintInfo?.nuts?.[5]?.methods ?? [];
+    const meltMethods = this._mintInfo?.nuts?.[5]?.methods && [];
 
     if (!Array.isArray(meltMethods)) return false;
killedBy: MintInfo method/unit capability checks supportsAmountless defaults to bolt11/sat and requires an exact method/unit match
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/model/MintInfo.ts:641:9
   supportsAmountless(method: string = 'bolt11', unit: string = 'sat'): boolean {
     const meltMethods = this._mintInfo?.nuts?.[5]?.methods ?? [];
 
-    if (!Array.isArray(meltMethods)) return false;
+    if (Array.isArray(meltMethods)) return false;
 
     return meltMethods.some(
killedBy: createMeltQuoteBolt11 mutants attaches amountless options for an amountless invoice on a supporting mint
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/model/MintInfo.ts:641:9
   supportsAmountless(method: string = 'bolt11', unit: string = 'sat'): boolean {
     const meltMethods = this._mintInfo?.nuts?.[5]?.methods ?? [];
 
-    if (!Array.isArray(meltMethods)) return false;
+    if (true) return false;
 
     return meltMethods.some(
killedBy: test info supportsAmountless() correctly detects amountless option in melt methods
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/model/MintInfo.ts:643:12
 
     if (!Array.isArray(meltMethods)) return false;
 
-    return meltMethods.some(
-      (met) => met.method === method && met.unit === unit && met.options?.amountless === true,
-    );
+    return meltMethods.every(met => met.method === method && met.unit === unit && met.options?.amountless === true);
   }
 }
killedBy: test info supportsAmountless() correctly detects amountless option in melt methods
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/model/MintInfo.ts:644:90
     if (!Array.isArray(meltMethods)) return false;
 
     return meltMethods.some(
-      (met) => met.method === method && met.unit === unit && met.options?.amountless === true,
+      (met) => met.method === method && met.unit === unit && met.options?.amountless === false,
     );
   }
killedBy: test info supportsAmountless() correctly detects amountless option in melt methods
statusReason: expected false to be true // Object.is equality

[Killed] OptionalChaining
src/model/MintInfo.ts:644:62
     if (!Array.isArray(meltMethods)) return false;
 
     return meltMethods.some(
-      (met) => met.method === method && met.unit === unit && met.options?.amountless === true,
+      (met) => met.method === method && met.unit === unit && met.options.amountless === true,
     );
   }
killedBy: test info supportsAmountless() correctly detects amountless option in melt methods
statusReason: Cannot read properties of undefined (reading 'amountless')
