[Killed] StringLiteral
src/model/OutputData.ts:54:3
 } from './types';
 
 const RECOVERY_HINT =
-  'Inputs may already be spent; if the wallet is seeded, try restoring (NUT-09) to recover.';
+  "";
 
 /**
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/model/OutputData.ts:100:31
 
 export function isOutputDataFactory(
   value: OutputData[] | OutputDataFactory,
-): value is OutputDataFactory {
-  return typeof value === 'function';
-}
+): value is OutputDataFactory {}
 
 export class OutputData implements OutputDataLike {
killedBy: OutputData helpers detects output data factories
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/model/OutputData.ts:101:10
 export function isOutputDataFactory(
   value: OutputData[] | OutputDataFactory,
 ): value is OutputDataFactory {
-  return typeof value === 'function';
+  return typeof value !== 'function';
 }
 
killedBy: OutputData helpers detects output data factories
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/model/OutputData.ts:101:10
 export function isOutputDataFactory(
   value: OutputData[] | OutputDataFactory,
 ): value is OutputDataFactory {
-  return typeof value === 'function';
+  return true;
 }
 
killedBy: OutputData helpers detects output data factories
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/model/OutputData.ts:134:5
     ephemeralE?: string,
     secretKey?: Uint8Array,
     spendInfo?: SpendInfo,
-  ) {
-    this.secret = secret;
-    this.blindingFactor = blindingFactor;
-    this.blindedMessage = blindedMessage;
-    this.ephemeralE = ephemeralE;
-    this.secretKey = secretKey;
-    this.spendInfo = spendInfo;
-  }
+  ) {}
 
   toProof(sig: SerializedBlindedSignature, keyset: HasKeysetKeys) {
killedBy: requestTokens test requestTokens
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/model/OutputData.ts:144:9
   }
 
   toProof(sig: SerializedBlindedSignature, keyset: HasKeysetKeys) {
-    if (sig == undefined) {
+    if (true) {
       throw new CTSError(
         `Mint response is missing a signature for one of the outputs. ${RECOVERY_HINT}`,
killedBy: requestTokens test requestTokens
statusReason: Mint response is missing a signature for one of the outputs. Inputs may already be spent; if the wallet is seeded, try restoring (NUT-09) to recover.

[Killed] BlockStatement
src/model/OutputData.ts:144:27
   }
 
   toProof(sig: SerializedBlindedSignature, keyset: HasKeysetKeys) {
-    if (sig == undefined) {
-      throw new CTSError(
-        `Mint response is missing a signature for one of the outputs. ${RECOVERY_HINT}`,
-      );
-    }
+    if (sig == undefined) {}
     // The keys must be the keyset the mint signed under: DLEQ/pairing verify against them, and
     // unblinding with any other keyset yields an unspendable proof.
killedBy: OutputData.toProof DLEQ verification toProof throws on undefined signature
statusReason: expected [Function] to throw error including 'Mint response is missing a signature …' but got 'Cannot read properties of undefined (…'

[Killed] EqualityOperator
src/model/OutputData.ts:151:9
     }
     // The keys must be the keyset the mint signed under: DLEQ/pairing verify against them, and
     // unblinding with any other keyset yields an unspendable proof.
-    if (sig.id !== keyset.id) {
+    if (sig.id === keyset.id) {
       throw new CTSError(`Mint signature keyset id ${sig.id} does not match keys for ${keyset.id}`);
     }
killedBy: requestTokens test requestTokens
statusReason: Mint signature keyset id 00bd033559de27d0 does not match keys for 00bd033559de27d0

[Killed] ConditionalExpression
src/model/OutputData.ts:151:9
     }
     // The keys must be the keyset the mint signed under: DLEQ/pairing verify against them, and
     // unblinding with any other keyset yields an unspendable proof.
-    if (sig.id !== keyset.id) {
+    if (false) {
       throw new CTSError(`Mint signature keyset id ${sig.id} does not match keys for ${keyset.id}`);
     }
killedBy: OutputData.toProof rejects a signature whose keyset id does not match the keys
statusReason: expected [Function] to throw error matching /Mint signature keyset id .* does not …/ but got 'Mint signature keyset id 00ad268c4d1f…'

[Killed] StringLiteral
src/model/OutputData.ts:152:26
     // The keys must be the keyset the mint signed under: DLEQ/pairing verify against them, and
     // unblinding with any other keyset yields an unspendable proof.
     if (sig.id !== keyset.id) {
-      throw new CTSError(`Mint signature keyset id ${sig.id} does not match keys for ${keyset.id}`);
+      throw new CTSError(``);
     }
 
killedBy: OutputData.toProof rejects a signature whose keyset id does not match the keys
statusReason: expected [Function] to throw error matching /Mint signature keyset id .* does not …/ but got ''

[Killed] BooleanLiteral
src/model/OutputData.ts:161:9
     // a malicious mint can otherwise sign a smaller denomination and return it as `sig.amount`,
     // which verifies under K2/A of the downgraded amount, or move the output to a worse keyset.
     const requested = this.blindedMessage.amount;
-    if (!requested.isZero() && sig.id !== this.blindedMessage.id) {
+    if (requested.isZero() && sig.id !== this.blindedMessage.id) {
       throw new CTSError(
         `Mint signature keyset id ${sig.id} does not match output ${this.blindedMessage.id}`,
killedBy: OutputData.toProof unblinds a blank with the keyset the signature names, not the blank's
statusReason: Mint signature keyset id 00ad268c4d1f5826 does not match output 009a1f293253e41e

[Killed] ConditionalExpression
src/model/OutputData.ts:161:9
     // a malicious mint can otherwise sign a smaller denomination and return it as `sig.amount`,
     // which verifies under K2/A of the downgraded amount, or move the output to a worse keyset.
     const requested = this.blindedMessage.amount;
-    if (!requested.isZero() && sig.id !== this.blindedMessage.id) {
+    if (true) {
       throw new CTSError(
         `Mint signature keyset id ${sig.id} does not match output ${this.blindedMessage.id}`,
killedBy: requestTokens test requestTokens
statusReason: Mint signature keyset id 00bd033559de27d0 does not match output 00bd033559de27d0

[Killed] BooleanLiteral
src/model/OutputData.ts:166:9
         `Mint signature keyset id ${sig.id} does not match output ${this.blindedMessage.id}`,
       );
     }
-    if (!requested.isZero() && !sig.amount.equals(requested)) {
+    if (requested.isZero() && !sig.amount.equals(requested)) {
       throw new CTSError(
         `Mint signature amount ${sig.amount.toString()} does not match requested amount ${requested.toString()}. ${RECOVERY_HINT}`,
killedBy: OutputData.toProof unblinds a blank with the keyset the signature names, not the blank's
statusReason: Mint signature amount 1 does not match requested amount 0. Inputs may already be spent; if the wallet is seeded, try restoring (NUT-09) to recover.

[Killed] BooleanLiteral
src/model/OutputData.ts:166:32
         `Mint signature keyset id ${sig.id} does not match output ${this.blindedMessage.id}`,
       );
     }
-    if (!requested.isZero() && !sig.amount.equals(requested)) {
+    if (!requested.isZero() && sig.amount.equals(requested)) {
       throw new CTSError(
         `Mint signature amount ${sig.amount.toString()} does not match requested amount ${requested.toString()}. ${RECOVERY_HINT}`,
killedBy: requestTokens test requestTokens
statusReason: Mint signature amount 1 does not match requested amount 1. Inputs may already be spent; if the wallet is seeded, try restoring (NUT-09) to recover.

[Killed] StringLiteral
src/model/OutputData.ts:168:9
     }
     if (!requested.isZero() && !sig.amount.equals(requested)) {
       throw new CTSError(
-        `Mint signature amount ${sig.amount.toString()} does not match requested amount ${requested.toString()}. ${RECOVERY_HINT}`,
+        ``,
       );
     }
killedBy: OutputData.toProof DLEQ verification toProof rejects amount downgrade on secp (malicious mint)
statusReason: expected [Function] to throw error matching /does not match requested amount/ but got ''

[Killed] ConditionalExpression
src/model/OutputData.ts:177:9
     // DLEQ — the pairing is the only check that the returned `C_` is a real signature, so it
     // MUST run here. Without it, a malicious mint can return garbage `C_`, the wallet stores an
     // invalid `C`, marks inputs spent, and the user loses funds. Mirrors the secp DLEQ check below.
-    if (isBlsKeyset(sig.id)) {
+    if (true) {
       let C_: G1Point;
       let K2: G2Point;
killedBy: requestTokens test requestTokens
statusReason: Mint returned invalid signature or amount. Inputs may already be spent; if the wallet is seeded, try restoring (NUT-09) to recover.

[Killed] ConditionalExpression
src/model/OutputData.ts:177:9
     // DLEQ — the pairing is the only check that the returned `C_` is a real signature, so it
     // MUST run here. Without it, a malicious mint can return garbage `C_`, the wallet stores an
     // invalid `C`, marks inputs spent, and the user loses funds. Mirrors the secp DLEQ check below.
-    if (isBlsKeyset(sig.id)) {
+    if (false) {
       let C_: G1Point;
       let K2: G2Point;
killedBy: OutputData v3 round-trip (BLS12-381) createSingleRandomData gives a v3 output a real keypair
statusReason: Mint returned invalid signature or amount. Inputs may already be spent; if the wallet is seeded, try restoring (NUT-09) to recover.

[Killed] BlockStatement
src/model/OutputData.ts:180:11
     if (isBlsKeyset(sig.id)) {
       let C_: G1Point;
       let K2: G2Point;
-      try {
-        const K2Hex = keyset.keys[sig.amount.toString()];
-        if (!K2Hex) {
-          throw new CTSError(`Amount ${sig.amount.toString()} not in keyset`);
-        }
-        C_ = pointFromHexG1(sig.C_);
-        K2 = pointFromHexG2(K2Hex);
-      } catch (e) {
+      try {} catch (e) {
         throw new CTSError(`Mint returned invalid signature or amount. ${RECOVERY_HINT}`, {
           cause: e,
killedBy: OutputData v3 round-trip (BLS12-381) createSingleRandomData gives a v3 output a real keypair
statusReason: Cannot read properties of undefined (reading 'multiply')

[Killed] ConditionalExpression
src/model/OutputData.ts:182:13
       let K2: G2Point;
       try {
         const K2Hex = keyset.keys[sig.amount.toString()];
-        if (!K2Hex) {
+        if (false) {
           throw new CTSError(`Amount ${sig.amount.toString()} not in keyset`);
         }
killedBy: OutputData v3 round-trip (BLS12-381) wraps a missing v3 keyset key with the underlying cause
statusReason: expected 'hex string expected, got undefined' to match /Amount 128 not in keyset/

[Killed] BooleanLiteral
src/model/OutputData.ts:182:13
       let K2: G2Point;
       try {
         const K2Hex = keyset.keys[sig.amount.toString()];
-        if (!K2Hex) {
+        if (K2Hex) {
           throw new CTSError(`Amount ${sig.amount.toString()} not in keyset`);
         }
killedBy: OutputData v3 round-trip (BLS12-381) createSingleRandomData gives a v3 output a real keypair
statusReason: Mint returned invalid signature or amount. Inputs may already be spent; if the wallet is seeded, try restoring (NUT-09) to recover.

[Killed] BlockStatement
src/model/OutputData.ts:187:19
         }
         C_ = pointFromHexG1(sig.C_);
         K2 = pointFromHexG2(K2Hex);
-      } catch (e) {
-        throw new CTSError(`Mint returned invalid signature or amount. ${RECOVERY_HINT}`, {
-          cause: e,
-        });
-      }
+      } catch (e) {}
       const blindSig: BlindSignature = { id: sig.id, C_ };
       const unblinded = constructUnblindedSignatureBls(blindSig, this.blindingFactor, this.secret);
killedBy: OutputData v3 round-trip (BLS12-381) maps malformed BLS C_ to a CTSError with NUT-09 hint
statusReason: expected [Function] to throw error matching /Mint returned invalid signature or am…/ but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
src/model/OutputData.ts:194:11
       }
       const blindSig: BlindSignature = { id: sig.id, C_ };
       const unblinded = constructUnblindedSignatureBls(blindSig, this.blindingFactor, this.secret);
-      if (!verifyUnblindedSignatureBls(K2, unblinded.C, unblinded.secret)) {
+      if (true) {
         throw new CTSError('BLS pairing verification failed on mint response');
       }
killedBy: OutputData v3 round-trip (BLS12-381) createSingleRandomData gives a v3 output a real keypair
statusReason: BLS pairing verification failed on mint response

[Killed] BlockStatement
src/model/OutputData.ts:194:76
       }
       const blindSig: BlindSignature = { id: sig.id, C_ };
       const unblinded = constructUnblindedSignatureBls(blindSig, this.blindingFactor, this.secret);
-      if (!verifyUnblindedSignatureBls(K2, unblinded.C, unblinded.secret)) {
-        throw new CTSError('BLS pairing verification failed on mint response');
-      }
+      if (!verifyUnblindedSignatureBls(K2, unblinded.C, unblinded.secret)) {}
       const proof: Proof = {
         id: sig.id,
killedBy: OutputData v3 round-trip (BLS12-381) toProof rejects a forged C_ via inline pairing check
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/model/OutputData.ts:195:28
       const blindSig: BlindSignature = { id: sig.id, C_ };
       const unblinded = constructUnblindedSignatureBls(blindSig, this.blindingFactor, this.secret);
       if (!verifyUnblindedSignatureBls(K2, unblinded.C, unblinded.secret)) {
-        throw new CTSError('BLS pairing verification failed on mint response');
+        throw new CTSError("");
       }
       const proof: Proof = {
killedBy: OutputData v3 round-trip (BLS12-381) toProof rejects a forged C_ via inline pairing check
statusReason: expected [Function] to throw error matching /BLS pairing verification failed/ but got ''

[Killed] BooleanLiteral
src/model/OutputData.ts:200:30
       const proof: Proof = {
         id: sig.id,
         amount: sig.amount,
-        C: unblinded.C.toHex(true),
+        C: unblinded.C.toHex(false),
         secret: decodeUtf8Field(unblinded.secret),
       };
killedBy: OutputData v3 round-trip (BLS12-381) full mint → swap path: outputs round-trip and verify under pairing
statusReason: expected '08e67d1825b63b282aac7f5f36d9ada511475…' to match /^[0-9a-f]{96}$/

[Killed] ConditionalExpression
src/model/OutputData.ts:203:11
         C: unblinded.C.toHex(true),
         secret: decodeUtf8Field(unblinded.secret),
       };
-      if (this.ephemeralE) proof.p2pk_e = this.ephemeralE;
+      if (true) proof.p2pk_e = this.ephemeralE;
       if (this.spendInfo) proof.spend_info = this.spendInfo;
       return proof;
killedBy: OutputData v3 round-trip (BLS12-381) does not attach p2pk_e when the output has no ephemeral key
statusReason: expected true to be false // Object.is equality

[Survived] ConditionalExpression
src/model/OutputData.ts:203:11
         C: unblinded.C.toHex(true),
         secret: decodeUtf8Field(unblinded.secret),
       };
-      if (this.ephemeralE) proof.p2pk_e = this.ephemeralE;
+      if (false) proof.p2pk_e = this.ephemeralE;
       if (this.spendInfo) proof.spend_info = this.spendInfo;
       return proof;

[Killed] ConditionalExpression
src/model/OutputData.ts:204:11
         secret: decodeUtf8Field(unblinded.secret),
       };
       if (this.ephemeralE) proof.p2pk_e = this.ephemeralE;
-      if (this.spendInfo) proof.spend_info = this.spendInfo;
+      if (false) proof.spend_info = this.spendInfo;
       return proof;
     }
killedBy: OutputData v3 round-trip (BLS12-381) createSingleRandomData gives a v3 output a real keypair
statusReason: expected undefined to be 'a6cefd1a4d98750ed6dd0680ad02a268c1b70…' // Object.is equality

[Survived] ConditionalExpression
src/model/OutputData.ts:204:11
         secret: decodeUtf8Field(unblinded.secret),
       };
       if (this.ephemeralE) proof.p2pk_e = this.ephemeralE;
-      if (this.spendInfo) proof.spend_info = this.spendInfo;
+      if (true) proof.spend_info = this.spendInfo;
       return proof;
     }

[Killed] BlockStatement
src/model/OutputData.ts:210:9
 
     let A: WeierstrassPoint<bigint>;
     let C_: WeierstrassPoint<bigint>;
-    try {
-      const AHex = keyset.keys[sig.amount.toString()];
-      if (!AHex) {
-        throw new CTSError(`Amount ${sig.amount.toString()} not in keyset`);
-      }
-      A = pointFromHex(AHex);
-      C_ = pointFromHex(sig.C_);
-    } catch (e) {
+    try {} catch (e) {
       throw new CTSError(`Mint returned invalid signature or amount. ${RECOVERY_HINT}`, {
         cause: e,
killedBy: requestTokens test requestTokens
statusReason: Cannot read properties of undefined (reading 'subtract')

[Killed] BooleanLiteral
src/model/OutputData.ts:212:11
     let C_: WeierstrassPoint<bigint>;
     try {
       const AHex = keyset.keys[sig.amount.toString()];
-      if (!AHex) {
+      if (AHex) {
         throw new CTSError(`Amount ${sig.amount.toString()} not in keyset`);
       }
killedBy: restore sends zero-amount blanks and maps signatures to proofs
statusReason: Mint returned invalid signature or amount. Inputs may already be spent; if the wallet is seeded, try restoring (NUT-09) to recover.

[Killed] ConditionalExpression
src/model/OutputData.ts:212:11
     let C_: WeierstrassPoint<bigint>;
     try {
       const AHex = keyset.keys[sig.amount.toString()];
-      if (!AHex) {
+      if (false) {
         throw new CTSError(`Amount ${sig.amount.toString()} not in keyset`);
       }
killedBy: OutputData secp round-trip (secp256k1 + NUT-12 DLEQ) wraps a missing secp keyset key with the underlying cause
statusReason: expected 'hex string expected, got undefined' to match /Amount 128 not in keyset/

[Killed] StringLiteral
src/model/OutputData.ts:213:28
     try {
       const AHex = keyset.keys[sig.amount.toString()];
       if (!AHex) {
-        throw new CTSError(`Amount ${sig.amount.toString()} not in keyset`);
+        throw new CTSError(``);
       }
       A = pointFromHex(AHex);
killedBy: OutputData secp round-trip (secp256k1 + NUT-12 DLEQ) wraps a missing secp keyset key with the underlying cause
statusReason: expected '' to match /Amount 128 not in keyset/

[Killed] BlockStatement
src/model/OutputData.ts:217:17
       }
       A = pointFromHex(AHex);
       C_ = pointFromHex(sig.C_);
-    } catch (e) {
-      throw new CTSError(`Mint returned invalid signature or amount. ${RECOVERY_HINT}`, {
-        cause: e,
-      });
-    }
+    } catch (e) {}
 
     let dleq: DLEQ | undefined;
killedBy: OutputData.toProof maps malformed secp C_ to a CTSError with NUT-09 hint
statusReason: expected [Function] to throw error matching /Mint returned invalid signature or am…/ but got 'Cannot read properties of undefined (…'

[Killed] StringLiteral
src/model/OutputData.ts:218:26
       A = pointFromHex(AHex);
       C_ = pointFromHex(sig.C_);
     } catch (e) {
-      throw new CTSError(`Mint returned invalid signature or amount. ${RECOVERY_HINT}`, {
+      throw new CTSError(``, {
         cause: e,
       });
killedBy: OutputData secp round-trip (secp256k1 + NUT-12 DLEQ) wraps a missing secp keyset key with the underlying cause
statusReason: expected '' to match /Mint returned invalid signature or am…/

[Killed] ConditionalExpression
src/model/OutputData.ts:224:9
     }
 
     let dleq: DLEQ | undefined;
-    if (sig.dleq) {
+    if (false) {
       dleq = {
         s: hexToBytes(sig.dleq.s),
killedBy: OutputData.toProof DLEQ verification toProof succeeds with valid DLEQ
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/model/OutputData.ts:224:9
     }
 
     let dleq: DLEQ | undefined;
-    if (sig.dleq) {
+    if (true) {
       dleq = {
         s: hexToBytes(sig.dleq.s),
killedBy: requestTokens test requestTokens
statusReason: Cannot read properties of undefined (reading 's')

[Killed] ObjectLiteral
src/model/OutputData.ts:225:14
 
     let dleq: DLEQ | undefined;
     if (sig.dleq) {
-      dleq = {
-        s: hexToBytes(sig.dleq.s),
-        e: hexToBytes(sig.dleq.e),
-        r: this.blindingFactor,
-      };
+      dleq = {};
     }
 
killedBy: OutputData.toProof DLEQ verification toProof succeeds with valid DLEQ
statusReason: expected Uint8Array, got type=undefined

[Killed] ConditionalExpression
src/model/OutputData.ts:233:9
     }
 
     // NUT-12: Verify DLEQ proof if present. Only secp keysets carry DLEQ.
-    if (dleq) {
+    if (false) {
       const bAuto = pointFromHexAuto(this.blindedMessage.B_);
       if (bAuto.kind === 'secp') {
killedBy: OutputData.toProof DLEQ verification toProof throws on invalid DLEQ
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/model/OutputData.ts:233:15
     }
 
     // NUT-12: Verify DLEQ proof if present. Only secp keysets carry DLEQ.
-    if (dleq) {
-      const bAuto = pointFromHexAuto(this.blindedMessage.B_);
-      if (bAuto.kind === 'secp') {
-        if (!verifyDLEQProof(dleq, bAuto.pt, C_, A)) {
-          throw new CTSError('DLEQ verification failed on mint response');
-        }
-      }
-    }
+    if (dleq) {}
 
     const blindSig: BlindSignature = { id: sig.id, C_ };
killedBy: OutputData secp round-trip (secp256k1 + NUT-12 DLEQ) rejects a tampered DLEQ proof
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/model/OutputData.ts:235:11
     // NUT-12: Verify DLEQ proof if present. Only secp keysets carry DLEQ.
     if (dleq) {
       const bAuto = pointFromHexAuto(this.blindedMessage.B_);
-      if (bAuto.kind === 'secp') {
+      if (false) {
         if (!verifyDLEQProof(dleq, bAuto.pt, C_, A)) {
           throw new CTSError('DLEQ verification failed on mint response');
killedBy: OutputData.toProof DLEQ verification toProof throws on invalid DLEQ
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/model/OutputData.ts:235:11
     // NUT-12: Verify DLEQ proof if present. Only secp keysets carry DLEQ.
     if (dleq) {
       const bAuto = pointFromHexAuto(this.blindedMessage.B_);
-      if (bAuto.kind === 'secp') {
+      if (bAuto.kind !== 'secp') {
         if (!verifyDLEQProof(dleq, bAuto.pt, C_, A)) {
           throw new CTSError('DLEQ verification failed on mint response');
killedBy: OutputData secp round-trip (secp256k1 + NUT-12 DLEQ) rejects a tampered DLEQ proof
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/model/OutputData.ts:236:13
     if (dleq) {
       const bAuto = pointFromHexAuto(this.blindedMessage.B_);
       if (bAuto.kind === 'secp') {
-        if (!verifyDLEQProof(dleq, bAuto.pt, C_, A)) {
+        if (false) {
           throw new CTSError('DLEQ verification failed on mint response');
         }
killedBy: OutputData secp round-trip (secp256k1 + NUT-12 DLEQ) rejects a tampered DLEQ proof
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/model/OutputData.ts:236:13
     if (dleq) {
       const bAuto = pointFromHexAuto(this.blindedMessage.B_);
       if (bAuto.kind === 'secp') {
-        if (!verifyDLEQProof(dleq, bAuto.pt, C_, A)) {
+        if (verifyDLEQProof(dleq, bAuto.pt, C_, A)) {
           throw new CTSError('DLEQ verification failed on mint response');
         }
killedBy: OutputData.toProof DLEQ verification toProof succeeds with valid DLEQ
statusReason: DLEQ verification failed on mint response

[Killed] StringLiteral
src/model/OutputData.ts:237:30
       const bAuto = pointFromHexAuto(this.blindedMessage.B_);
       if (bAuto.kind === 'secp') {
         if (!verifyDLEQProof(dleq, bAuto.pt, C_, A)) {
-          throw new CTSError('DLEQ verification failed on mint response');
+          throw new CTSError("");
         }
       }
killedBy: OutputData.toProof DLEQ verification toProof throws on invalid DLEQ
statusReason: expected [Function] to throw error including 'DLEQ verification failed' but got ''

[Killed] ConditionalExpression
src/model/OutputData.ts:249:11
       amount: sig.amount,
       C: unblinded.C.toHex(true),
       secret: decodeUtf8Field(unblinded.secret),
-      ...(dleq && {
-        dleq: {
-          s: bytesToHex(dleq.s),
-          e: bytesToHex(dleq.e),
-          r: numberToHexPadded64(dleq.r ?? BigInt(0)),
-        },
-      }),
+      ...(true),
     };
 
killedBy: OutputData secp round-trip (secp256k1 + NUT-12 DLEQ) attaches the DLEQ proof with wallet r on the Proof
statusReason: expected undefined to be defined

[Killed] LogicalOperator
src/model/OutputData.ts:249:11
       amount: sig.amount,
       C: unblinded.C.toHex(true),
       secret: decodeUtf8Field(unblinded.secret),
-      ...(dleq && {
-        dleq: {
-          s: bytesToHex(dleq.s),
-          e: bytesToHex(dleq.e),
-          r: numberToHexPadded64(dleq.r ?? BigInt(0)),
-        },
-      }),
+      ...(dleq || {
+  dleq: {
+    s: bytesToHex(dleq.s),
+    e: bytesToHex(dleq.e),
+    r: numberToHexPadded64(dleq.r ?? BigInt(0))
+  }
+}),
     };
 
killedBy: OutputData secp round-trip (secp256k1 + NUT-12 DLEQ) attaches the DLEQ proof with wallet r on the Proof
statusReason: expected undefined to be defined

[Killed] ObjectLiteral
src/model/OutputData.ts:250:15
       C: unblinded.C.toHex(true),
       secret: decodeUtf8Field(unblinded.secret),
       ...(dleq && {
-        dleq: {
-          s: bytesToHex(dleq.s),
-          e: bytesToHex(dleq.e),
-          r: numberToHexPadded64(dleq.r ?? BigInt(0)),
-        },
+        dleq: {},
       }),
     };
killedBy: OutputData secp round-trip (secp256k1 + NUT-12 DLEQ) attaches the DLEQ proof with wallet r on the Proof
statusReason: expected undefined to be 'c2ef2cf978e5ebd1ab37c42b01a9c684bb046…' // Object.is equality

[Killed] LogicalOperator
src/model/OutputData.ts:253:34
         dleq: {
           s: bytesToHex(dleq.s),
           e: bytesToHex(dleq.e),
-          r: numberToHexPadded64(dleq.r ?? BigInt(0)),
+          r: numberToHexPadded64(dleq.r && BigInt(0)),
         },
       }),
killedBy: OutputData secp round-trip (secp256k1 + NUT-12 DLEQ) attaches the DLEQ proof with wallet r on the Proof
statusReason: expected '0000000000000000000000000000000000000…' to be '8abf5ac6fa4e0bedeceea67c97c4c1db90d12…' // Object.is equality

[Killed] ConditionalExpression
src/model/OutputData.ts:259:9
     };
 
     // Add P2BK (Pay to Blinded Key) blinding factors if needed
-    if (this.ephemeralE) proof.p2pk_e = this.ephemeralE;
+    if (true) proof.p2pk_e = this.ephemeralE;
     if (this.spendInfo) proof.spend_info = this.spendInfo;
 
killedBy: OutputData secp round-trip (secp256k1 + NUT-12 DLEQ) full mint -> swap path: outputs round-trip, verify DLEQ, and unblind to C = a·Y
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/model/OutputData.ts:259:9
     };
 
     // Add P2BK (Pay to Blinded Key) blinding factors if needed
-    if (this.ephemeralE) proof.p2pk_e = this.ephemeralE;
+    if (false) proof.p2pk_e = this.ephemeralE;
     if (this.spendInfo) proof.spend_info = this.spendInfo;
 
killedBy: OutputData.toProof DLEQ verification toProof preserves p2pk_e from OutputData instance
statusReason: expected undefined to be '0337813ca2d66647f482016578c1beca9f3db…' // Object.is equality

[Killed] BlockStatement
src/model/OutputData.ts:270:19
     amount: AmountLike,
     keyset: HasKeysetKeys,
     customSplit?: AmountLike[],
-  ): OutputData[] {
-    const amounts = splitAmount(amount, keyset.keys, customSplit);
-    // NUT-28: a SIG_ALL batch shares one ephemeral key so every secret carries the
-    // identical data/tags that NUT-11 requires; SIG_INPUTS keeps per-output keys.
-    const eBytes =
-      p2pk.blindKeys && p2pk.sigFlag === 'SIG_ALL' ? createRandomSecretKey() : undefined;
-    return amounts.map((a) => this.createSingleP2PKData(p2pk, a, keyset.id, eBytes));
-  }
+  ): OutputData[] {}
 
   /**
killedBy: receive test receive p2pk
statusReason: Cannot read properties of undefined (reading 'entries')

[Killed] LogicalOperator
src/model/OutputData.ts:275:7
     // NUT-28: a SIG_ALL batch shares one ephemeral key so every secret carries the
     // identical data/tags that NUT-11 requires; SIG_INPUTS keeps per-output keys.
     const eBytes =
-      p2pk.blindKeys && p2pk.sigFlag === 'SIG_ALL' ? createRandomSecretKey() : undefined;
+      p2pk.blindKeys || p2pk.sigFlag === 'SIG_ALL' ? createRandomSecretKey() : undefined;
     return amounts.map((a) => this.createSingleP2PKData(p2pk, a, keyset.id, eBytes));
   }
killedBy: OutputData helpers a blinded SIG_INPUTS batch blinds each output with its own ephemeral key
statusReason: expected 1 to be 3 // Object.is equality

[Killed] ConditionalExpression
src/model/OutputData.ts:275:25
     // NUT-28: a SIG_ALL batch shares one ephemeral key so every secret carries the
     // identical data/tags that NUT-11 requires; SIG_INPUTS keeps per-output keys.
     const eBytes =
-      p2pk.blindKeys && p2pk.sigFlag === 'SIG_ALL' ? createRandomSecretKey() : undefined;
+      p2pk.blindKeys && true ? createRandomSecretKey() : undefined;
     return amounts.map((a) => this.createSingleP2PKData(p2pk, a, keyset.id, eBytes));
   }
killedBy: OutputData helpers a blinded SIG_INPUTS batch blinds each output with its own ephemeral key
statusReason: expected 1 to be 3 // Object.is equality
