[Killed] LogicalOperator
src/model/PaymentRequest.ts:225:11
     }
     const payload: PaymentRequestPayload = {
       ...(this.id !== undefined && { id: this.id }),
-      ...(opts?.memo !== undefined && { memo: opts.memo }),
+      ...(opts?.memo !== undefined || {
+  memo: opts.memo
+}),
       unit: this.unit ?? opts?.unit ?? 'sat',
       mint,
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: expected undefined to be 'hi' // Object.is equality

[Killed] OptionalChaining
src/model/PaymentRequest.ts:226:26
     const payload: PaymentRequestPayload = {
       ...(this.id !== undefined && { id: this.id }),
       ...(opts?.memo !== undefined && { memo: opts.memo }),
-      unit: this.unit ?? opts?.unit ?? 'sat',
+      unit: this.unit ?? opts.unit ?? 'sat',
       mint,
       proofs,
killedBy: NUT-18 payment payloads encodePayload omits id and memo when absent and defaults the unit
statusReason: Cannot read properties of undefined (reading 'unit')

[Killed] LogicalOperator
src/model/PaymentRequest.ts:226:13
     const payload: PaymentRequestPayload = {
       ...(this.id !== undefined && { id: this.id }),
       ...(opts?.memo !== undefined && { memo: opts.memo }),
-      unit: this.unit ?? opts?.unit ?? 'sat',
+      unit: this.unit && opts?.unit ?? 'sat',
       mint,
       proofs,
killedBy: NUT-18 payment payloads encodePayload omits id and memo when absent and defaults the unit
statusReason: expected 'sat' to be 'usd' // Object.is equality

[Killed] BlockStatement
src/model/PaymentRequest.ts:245:9
    */
   static decodePayload(json: string): PaymentRequestPayload {
     let raw: unknown;
-    try {
-      raw = JSONInt.parse(json, undefined, { strict: true });
-    } catch (e) {
+    try {} catch (e) {
       throw new CTSError('invalid payment payload: not valid JSON', { cause: e });
     }
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: invalid payment payload: expected a JSON object

[Survived] BooleanLiteral
src/model/PaymentRequest.ts:246:54
   static decodePayload(json: string): PaymentRequestPayload {
     let raw: unknown;
     try {
-      raw = JSONInt.parse(json, undefined, { strict: true });
+      raw = JSONInt.parse(json, undefined, { strict: false });
     } catch (e) {
       throw new CTSError('invalid payment payload: not valid JSON', { cause: e });

[Survived] ObjectLiteral
src/model/PaymentRequest.ts:246:44
   static decodePayload(json: string): PaymentRequestPayload {
     let raw: unknown;
     try {
-      raw = JSONInt.parse(json, undefined, { strict: true });
+      raw = JSONInt.parse(json, undefined, {});
     } catch (e) {
       throw new CTSError('invalid payment payload: not valid JSON', { cause: e });

[Killed] BlockStatement
src/model/PaymentRequest.ts:247:17
     let raw: unknown;
     try {
       raw = JSONInt.parse(json, undefined, { strict: true });
-    } catch (e) {
-      throw new CTSError('invalid payment payload: not valid JSON', { cause: e });
-    }
+    } catch (e) {}
     if (typeof raw !== 'object' || raw === null || Array.isArray(raw)) {
       throw new CTSError('invalid payment payload: expected a JSON object');
killedBy: NUT-18 payment payloads decodePayload rejects not JSON
statusReason: expected [Function] to throw error matching /not valid JSON/ but got 'invalid payment payload: expected a J…'

[Killed] StringLiteral
src/model/PaymentRequest.ts:248:26
     try {
       raw = JSONInt.parse(json, undefined, { strict: true });
     } catch (e) {
-      throw new CTSError('invalid payment payload: not valid JSON', { cause: e });
+      throw new CTSError("", { cause: e });
     }
     if (typeof raw !== 'object' || raw === null || Array.isArray(raw)) {
killedBy: NUT-18 payment payloads decodePayload rejects not JSON
statusReason: expected [Function] to throw error matching /not valid JSON/ but got ''

[Killed] LogicalOperator
src/model/PaymentRequest.ts:250:9
     } catch (e) {
       throw new CTSError('invalid payment payload: not valid JSON', { cause: e });
     }
-    if (typeof raw !== 'object' || raw === null || Array.isArray(raw)) {
+    if ((typeof raw !== 'object' || raw === null) && Array.isArray(raw)) {
       throw new CTSError('invalid payment payload: expected a JSON object');
     }
killedBy: NUT-18 payment payloads decodePayload rejects a JSON array
statusReason: expected [Function] to throw error matching /expected a JSON object/ but got 'invalid payment payload: missing mint'

[Killed] BlockStatement
src/model/PaymentRequest.ts:250:72
     } catch (e) {
       throw new CTSError('invalid payment payload: not valid JSON', { cause: e });
     }
-    if (typeof raw !== 'object' || raw === null || Array.isArray(raw)) {
-      throw new CTSError('invalid payment payload: expected a JSON object');
-    }
+    if (typeof raw !== 'object' || raw === null || Array.isArray(raw)) {}
     const { id, memo, unit, mint, proofs } = raw as Record<string, unknown>;
     if (typeof mint !== 'string' || !mint) {
killedBy: NUT-18 payment payloads decodePayload rejects a JSON array
statusReason: expected [Function] to throw error matching /expected a JSON object/ but got 'invalid payment payload: missing mint'

[Killed] StringLiteral
src/model/PaymentRequest.ts:251:26
       throw new CTSError('invalid payment payload: not valid JSON', { cause: e });
     }
     if (typeof raw !== 'object' || raw === null || Array.isArray(raw)) {
-      throw new CTSError('invalid payment payload: expected a JSON object');
+      throw new CTSError("");
     }
     const { id, memo, unit, mint, proofs } = raw as Record<string, unknown>;
killedBy: NUT-18 payment payloads decodePayload rejects a JSON array
statusReason: expected [Function] to throw error matching /expected a JSON object/ but got ''

[Killed] BlockStatement
src/model/PaymentRequest.ts:254:44
       throw new CTSError('invalid payment payload: expected a JSON object');
     }
     const { id, memo, unit, mint, proofs } = raw as Record<string, unknown>;
-    if (typeof mint !== 'string' || !mint) {
-      throw new CTSError('invalid payment payload: missing mint');
-    }
+    if (typeof mint !== 'string' || !mint) {}
     if (typeof unit !== 'string' || !unit) {
       throw new CTSError('invalid payment payload: missing unit');
killedBy: NUT-18 payment payloads decodePayload rejects missing mint
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:254:9
       throw new CTSError('invalid payment payload: expected a JSON object');
     }
     const { id, memo, unit, mint, proofs } = raw as Record<string, unknown>;
-    if (typeof mint !== 'string' || !mint) {
+    if (false) {
       throw new CTSError('invalid payment payload: missing mint');
     }
killedBy: NUT-18 payment payloads decodePayload rejects missing mint
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:257:9
     if (typeof mint !== 'string' || !mint) {
       throw new CTSError('invalid payment payload: missing mint');
     }
-    if (typeof unit !== 'string' || !unit) {
+    if (true) {
       throw new CTSError('invalid payment payload: missing unit');
     }
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: invalid payment payload: missing unit

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:257:9
     if (typeof mint !== 'string' || !mint) {
       throw new CTSError('invalid payment payload: missing mint');
     }
-    if (typeof unit !== 'string' || !unit) {
+    if (false) {
       throw new CTSError('invalid payment payload: missing unit');
     }
killedBy: NUT-18 payment payloads decodePayload rejects missing unit
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/model/PaymentRequest.ts:258:26
       throw new CTSError('invalid payment payload: missing mint');
     }
     if (typeof unit !== 'string' || !unit) {
-      throw new CTSError('invalid payment payload: missing unit');
+      throw new CTSError("");
     }
     if (id !== undefined && typeof id !== 'string') {
killedBy: NUT-18 payment payloads decodePayload rejects missing unit
statusReason: expected [Function] to throw error matching /missing unit/ but got ''

[Killed] EqualityOperator
src/model/PaymentRequest.ts:260:9
     if (typeof unit !== 'string' || !unit) {
       throw new CTSError('invalid payment payload: missing unit');
     }
-    if (id !== undefined && typeof id !== 'string') {
+    if (id === undefined && typeof id !== 'string') {
       throw new CTSError('invalid payment payload: id must be a string');
     }
killedBy: NUT-18 payment payloads encodePayload omits id and memo when absent and defaults the unit
statusReason: invalid payment payload: id must be a string

[Killed] EqualityOperator
src/model/PaymentRequest.ts:260:29
     if (typeof unit !== 'string' || !unit) {
       throw new CTSError('invalid payment payload: missing unit');
     }
-    if (id !== undefined && typeof id !== 'string') {
+    if (id !== undefined && typeof id === 'string') {
       throw new CTSError('invalid payment payload: id must be a string');
     }
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: invalid payment payload: id must be a string

[Killed] StringLiteral
src/model/PaymentRequest.ts:261:26
       throw new CTSError('invalid payment payload: missing unit');
     }
     if (id !== undefined && typeof id !== 'string') {
-      throw new CTSError('invalid payment payload: id must be a string');
+      throw new CTSError("");
     }
     if (memo !== undefined && typeof memo !== 'string') {
killedBy: NUT-18 payment payloads decodePayload rejects a non-string id
statusReason: expected [Function] to throw error matching /id must be a string/ but got ''

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:263:9
     if (id !== undefined && typeof id !== 'string') {
       throw new CTSError('invalid payment payload: id must be a string');
     }
-    if (memo !== undefined && typeof memo !== 'string') {
+    if (true) {
       throw new CTSError('invalid payment payload: memo must be a string');
     }
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: invalid payment payload: memo must be a string

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:263:9
     if (id !== undefined && typeof id !== 'string') {
       throw new CTSError('invalid payment payload: id must be a string');
     }
-    if (memo !== undefined && typeof memo !== 'string') {
+    if (true && typeof memo !== 'string') {
       throw new CTSError('invalid payment payload: memo must be a string');
     }
killedBy: NUT-18 payment payloads encodePayload omits id and memo when absent and defaults the unit
statusReason: invalid payment payload: memo must be a string

[Killed] BlockStatement
src/model/PaymentRequest.ts:266:56
     if (memo !== undefined && typeof memo !== 'string') {
       throw new CTSError('invalid payment payload: memo must be a string');
     }
-    if (!Array.isArray(proofs) || proofs.length === 0) {
-      throw new CTSError('invalid payment payload: missing proofs');
-    }
+    if (!Array.isArray(proofs) || proofs.length === 0) {}
     const normalized = proofs.map((p: unknown, i: number) => {
       if (
killedBy: NUT-18 payment payloads decodePayload rejects missing proofs
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:266:9
     if (memo !== undefined && typeof memo !== 'string') {
       throw new CTSError('invalid payment payload: memo must be a string');
     }
-    if (!Array.isArray(proofs) || proofs.length === 0) {
+    if (true) {
       throw new CTSError('invalid payment payload: missing proofs');
     }
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: invalid payment payload: missing proofs

[Killed] BlockStatement
src/model/PaymentRequest.ts:269:62
     if (!Array.isArray(proofs) || proofs.length === 0) {
       throw new CTSError('invalid payment payload: missing proofs');
     }
-    const normalized = proofs.map((p: unknown, i: number) => {
-      if (
-        typeof p !== 'object' ||
-        p === null ||
-        Array.isArray(p) ||
-        typeof (p as Record<string, unknown>).id !== 'string' ||
-        typeof (p as Record<string, unknown>).secret !== 'string' ||
-        typeof (p as Record<string, unknown>).C !== 'string'
-      ) {
-        throw new CTSError(`invalid payment payload: malformed proof at index ${i}`);
-      }
-      const amount = (p as Record<string, unknown>).amount;
-      if (typeof amount === 'string') {
-        // A quoted amount is the tell-tale of plain JSON.stringify over bigint proofs (or an
-        // Amount VO via toJSON). NUT-18 amounts are JSON numbers: point the payer at the encoder.
-        throw new CTSError(
-          `invalid payment payload: proof amount at index ${i} is a string; amounts must be JSON numbers (serialize with encodePayload() or JSONInt.stringify, not JSON.stringify)`,
-        );
-      }
-      if (typeof amount !== 'number' && typeof amount !== 'bigint') {
-        throw new CTSError(`invalid payment payload: malformed proof amount at index ${i}`);
-      }
-      return { ...(p as Omit<Proof, 'amount'>), amount: Amount.from(amount) };
-    });
+    const normalized = proofs.map((p: unknown, i: number) => {});
     return {
       ...(id !== undefined && { id }),
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: Cannot read properties of undefined (reading 'amount')

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:271:9
     }
     const normalized = proofs.map((p: unknown, i: number) => {
       if (
-        typeof p !== 'object' ||
-        p === null ||
-        Array.isArray(p) ||
-        typeof (p as Record<string, unknown>).id !== 'string' ||
-        typeof (p as Record<string, unknown>).secret !== 'string' ||
-        typeof (p as Record<string, unknown>).C !== 'string'
+        false
       ) {
         throw new CTSError(`invalid payment payload: malformed proof at index ${i}`);
killedBy: NUT-18 payment payloads decodePayload rejects a malformed proof
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:271:9
     }
     const normalized = proofs.map((p: unknown, i: number) => {
       if (
-        typeof p !== 'object' ||
-        p === null ||
-        Array.isArray(p) ||
-        typeof (p as Record<string, unknown>).id !== 'string' ||
-        typeof (p as Record<string, unknown>).secret !== 'string' ||
-        typeof (p as Record<string, unknown>).C !== 'string'
+        true
       ) {
         throw new CTSError(`invalid payment payload: malformed proof at index ${i}`);
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: invalid payment payload: malformed proof at index 0

[Killed] EqualityOperator
src/model/PaymentRequest.ts:272:9
     const normalized = proofs.map((p: unknown, i: number) => {
       if (
         typeof p !== 'object' ||
-        p === null ||
+        p !== null ||
         Array.isArray(p) ||
         typeof (p as Record<string, unknown>).id !== 'string' ||
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: invalid payment payload: malformed proof at index 0

[Survived] ConditionalExpression
src/model/PaymentRequest.ts:272:9
     const normalized = proofs.map((p: unknown, i: number) => {
       if (
         typeof p !== 'object' ||
-        p === null ||
+        false ||
         Array.isArray(p) ||
         typeof (p as Record<string, unknown>).id !== 'string' ||

[Killed] EqualityOperator
src/model/PaymentRequest.ts:274:9
         typeof p !== 'object' ||
         p === null ||
         Array.isArray(p) ||
-        typeof (p as Record<string, unknown>).id !== 'string' ||
+        typeof (p as Record<string, unknown>).id === 'string' ||
         typeof (p as Record<string, unknown>).secret !== 'string' ||
         typeof (p as Record<string, unknown>).C !== 'string'
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: invalid payment payload: malformed proof at index 0

[Survived] ConditionalExpression
src/model/PaymentRequest.ts:274:9
         typeof p !== 'object' ||
         p === null ||
         Array.isArray(p) ||
-        typeof (p as Record<string, unknown>).id !== 'string' ||
+        false ||
         typeof (p as Record<string, unknown>).secret !== 'string' ||
         typeof (p as Record<string, unknown>).C !== 'string'

[Killed] EqualityOperator
src/model/PaymentRequest.ts:275:9
         p === null ||
         Array.isArray(p) ||
         typeof (p as Record<string, unknown>).id !== 'string' ||
-        typeof (p as Record<string, unknown>).secret !== 'string' ||
+        typeof (p as Record<string, unknown>).secret === 'string' ||
         typeof (p as Record<string, unknown>).C !== 'string'
       ) {
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: invalid payment payload: malformed proof at index 0

[Survived] ConditionalExpression
src/model/PaymentRequest.ts:275:9
         p === null ||
         Array.isArray(p) ||
         typeof (p as Record<string, unknown>).id !== 'string' ||
-        typeof (p as Record<string, unknown>).secret !== 'string' ||
+        false ||
         typeof (p as Record<string, unknown>).C !== 'string'
       ) {

[Killed] EqualityOperator
src/model/PaymentRequest.ts:276:9
         Array.isArray(p) ||
         typeof (p as Record<string, unknown>).id !== 'string' ||
         typeof (p as Record<string, unknown>).secret !== 'string' ||
-        typeof (p as Record<string, unknown>).C !== 'string'
+        typeof (p as Record<string, unknown>).C === 'string'
       ) {
         throw new CTSError(`invalid payment payload: malformed proof at index ${i}`);
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: invalid payment payload: malformed proof at index 0

[Survived] ConditionalExpression
src/model/PaymentRequest.ts:276:9
         Array.isArray(p) ||
         typeof (p as Record<string, unknown>).id !== 'string' ||
         typeof (p as Record<string, unknown>).secret !== 'string' ||
-        typeof (p as Record<string, unknown>).C !== 'string'
+        false
       ) {
         throw new CTSError(`invalid payment payload: malformed proof at index ${i}`);

[Killed] BlockStatement
src/model/PaymentRequest.ts:277:9
         typeof (p as Record<string, unknown>).id !== 'string' ||
         typeof (p as Record<string, unknown>).secret !== 'string' ||
         typeof (p as Record<string, unknown>).C !== 'string'
-      ) {
-        throw new CTSError(`invalid payment payload: malformed proof at index ${i}`);
-      }
+      ) {}
       const amount = (p as Record<string, unknown>).amount;
       if (typeof amount === 'string') {
killedBy: NUT-18 payment payloads decodePayload rejects a malformed proof
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:281:11
         throw new CTSError(`invalid payment payload: malformed proof at index ${i}`);
       }
       const amount = (p as Record<string, unknown>).amount;
-      if (typeof amount === 'string') {
+      if (false) {
         // A quoted amount is the tell-tale of plain JSON.stringify over bigint proofs (or an
         // Amount VO via toJSON). NUT-18 amounts are JSON numbers: point the payer at the encoder.
killedBy: NUT-18 payment payloads decodePayload rejects a quoted proof amount (plain JSON.stringify tell)
statusReason: expected [Function] to throw error matching /amounts must be JSON numbers/ but got 'invalid payment payload: malformed pr…'

[Killed] BlockStatement
src/model/PaymentRequest.ts:281:39
         throw new CTSError(`invalid payment payload: malformed proof at index ${i}`);
       }
       const amount = (p as Record<string, unknown>).amount;
-      if (typeof amount === 'string') {
-        // A quoted amount is the tell-tale of plain JSON.stringify over bigint proofs (or an
-        // Amount VO via toJSON). NUT-18 amounts are JSON numbers: point the payer at the encoder.
-        throw new CTSError(
-          `invalid payment payload: proof amount at index ${i} is a string; amounts must be JSON numbers (serialize with encodePayload() or JSONInt.stringify, not JSON.stringify)`,
-        );
-      }
+      if (typeof amount === 'string') {}
       if (typeof amount !== 'number' && typeof amount !== 'bigint') {
         throw new CTSError(`invalid payment payload: malformed proof amount at index ${i}`);
killedBy: NUT-18 payment payloads decodePayload rejects a quoted proof amount (plain JSON.stringify tell)
statusReason: expected [Function] to throw error matching /amounts must be JSON numbers/ but got 'invalid payment payload: malformed pr…'

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:288:11
           `invalid payment payload: proof amount at index ${i} is a string; amounts must be JSON numbers (serialize with encodePayload() or JSONInt.stringify, not JSON.stringify)`,
         );
       }
-      if (typeof amount !== 'number' && typeof amount !== 'bigint') {
+      if (true) {
         throw new CTSError(`invalid payment payload: malformed proof amount at index ${i}`);
       }
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: invalid payment payload: malformed proof amount at index 0

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:288:11
           `invalid payment payload: proof amount at index ${i} is a string; amounts must be JSON numbers (serialize with encodePayload() or JSONInt.stringify, not JSON.stringify)`,
         );
       }
-      if (typeof amount !== 'number' && typeof amount !== 'bigint') {
+      if (true && typeof amount !== 'bigint') {
         throw new CTSError(`invalid payment payload: malformed proof amount at index ${i}`);
       }
killedBy: NUT-18 payment payloads encodePayload omits id and memo when absent and defaults the unit
statusReason: invalid payment payload: malformed proof amount at index 0

[Killed] ObjectLiteral
src/model/PaymentRequest.ts:291:14
       if (typeof amount !== 'number' && typeof amount !== 'bigint') {
         throw new CTSError(`invalid payment payload: malformed proof amount at index ${i}`);
       }
-      return { ...(p as Omit<Proof, 'amount'>), amount: Amount.from(amount) };
+      return {};
     });
     return {
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: Cannot read properties of undefined (reading 'toBigInt')

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:294:11
       return { ...(p as Omit<Proof, 'amount'>), amount: Amount.from(amount) };
     });
     return {
-      ...(id !== undefined && { id }),
+      ...(true),
       ...(memo !== undefined && { memo }),
       unit,
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: expected undefined to be 'inv-1' // Object.is equality

[Killed] EqualityOperator
src/model/PaymentRequest.ts:294:11
       return { ...(p as Omit<Proof, 'amount'>), amount: Amount.from(amount) };
     });
     return {
-      ...(id !== undefined && { id }),
+      ...(id === undefined && { id }),
       ...(memo !== undefined && { memo }),
       unit,
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: expected undefined to be 'inv-1' // Object.is equality

[Killed] LogicalOperator
src/model/PaymentRequest.ts:295:11
     });
     return {
       ...(id !== undefined && { id }),
-      ...(memo !== undefined && { memo }),
+      ...(memo !== undefined || {
+  memo
+}),
       unit,
       mint,
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: expected undefined to be 'hi' // Object.is equality

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:295:11
     });
     return {
       ...(id !== undefined && { id }),
-      ...(memo !== undefined && { memo }),
+      ...(true),
       unit,
       mint,
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: expected undefined to be 'hi' // Object.is equality

[Killed] CallExpression
src/model/PaymentRequest.ts:303:5
   }
 
   toRawRequest() {
-    this.assertUnitRule();
+    ;
     const rawRequest: RawPaymentRequest = {};
     if (this.transport) {
killedBy: payment requests mint preferences (mp, sm) unit rule: a or sm without u fails on encode and pricing, decode stays lenient
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:305:9
   toRawRequest() {
     this.assertUnitRule();
     const rawRequest: RawPaymentRequest = {};
-    if (this.transport) {
+    if (true) {
       rawRequest.t = this.transport.map((t: PaymentRequestTransport) => ({
         t: t.type,
killedBy: payment requests encode payment requests
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/model/PaymentRequest.ts:305:25
   toRawRequest() {
     this.assertUnitRule();
     const rawRequest: RawPaymentRequest = {};
-    if (this.transport) {
-      rawRequest.t = this.transport.map((t: PaymentRequestTransport) => ({
-        t: t.type,
-        a: t.target,
-        g: t.tags,
-      }));
-    }
+    if (this.transport) {}
     if (this.id) {
       rawRequest.i = this.id;
killedBy: payment requests encode payment requests
statusReason: expected undefined to be defined

[Killed] ArrowFunction
src/model/PaymentRequest.ts:306:41
     this.assertUnitRule();
     const rawRequest: RawPaymentRequest = {};
     if (this.transport) {
-      rawRequest.t = this.transport.map((t: PaymentRequestTransport) => ({
-        t: t.type,
-        a: t.target,
-        g: t.tags,
-      }));
+      rawRequest.t = this.transport.map(() => undefined);
     }
     if (this.id) {
killedBy: payment requests encode payment requests
statusReason: Cannot read properties of undefined (reading 't')

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:312:9
         g: t.tags,
       }));
     }
-    if (this.id) {
+    if (true) {
       rawRequest.i = this.id;
     }
killedBy: payment requests toRawRequest omits every optional field, including the tri-state singleUse
statusReason: expected { i: undefined } to strictly equal {}

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:312:9
         g: t.tags,
       }));
     }
-    if (this.id) {
+    if (false) {
       rawRequest.i = this.id;
     }
killedBy: payment requests encode payment requests
statusReason: expected undefined to be '4840f51e' // Object.is equality

[Killed] BlockStatement
src/model/PaymentRequest.ts:315:22
     if (this.id) {
       rawRequest.i = this.id;
     }
-    if (this.amount) {
-      rawRequest.a = this.amount.toBigInt();
-    }
+    if (this.amount) {}
     if (this.unit) {
       rawRequest.u = this.unit;
killedBy: payment requests encode payment requests
statusReason: expected undefined to be truthy

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:315:9
     if (this.id) {
       rawRequest.i = this.id;
     }
-    if (this.amount) {
+    if (true) {
       rawRequest.a = this.amount.toBigInt();
     }
killedBy: payment requests toRawRequest omits every optional field, including the tri-state singleUse
statusReason: Cannot read properties of undefined (reading 'toBigInt')

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:318:9
     if (this.amount) {
       rawRequest.a = this.amount.toBigInt();
     }
-    if (this.unit) {
+    if (false) {
       rawRequest.u = this.unit;
     }
killedBy: payment requests encode payment requests
statusReason: expected undefined to be 'sat' // Object.is equality

[Killed] BlockStatement
src/model/PaymentRequest.ts:318:20
     if (this.amount) {
       rawRequest.a = this.amount.toBigInt();
     }
-    if (this.unit) {
-      rawRequest.u = this.unit;
-    }
+    if (this.unit) {}
     if (this.mints) {
       rawRequest.m = this.mints;
killedBy: payment requests encode payment requests
statusReason: expected undefined to be 'sat' // Object.is equality

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:321:9
     if (this.unit) {
       rawRequest.u = this.unit;
     }
-    if (this.mints) {
+    if (false) {
       rawRequest.m = this.mints;
     }
killedBy: payment requests encode payment requests
statusReason: expected undefined to strictly equal [ 'https://mint.com' ]
