[Killed] LogicalOperator
src/model/PaymentRequest.ts:479:32
     // Every blind-me key must be a leaf key, so the tree's own key count (at most
     // NUTROOT_MAX_SLOTS) bounds the list before any EC decompression.
     const leafKeys = new Set(leaves.flatMap((leaf) => leaf.keys));
-    const requestedBlindKeys = nutroot.blindKeys ?? [];
+    const requestedBlindKeys = nutroot.blindKeys && [];
     if (requestedBlindKeys.length > leafKeys.size) {
       throw new CTSError(`Too many blind-me keys: ${requestedBlindKeys.length}`);
killedBy: nutroot (v3) request marking the option converts to sender-side derivation arguments
statusReason: expected { …(2) } to deeply equal { …(3) }

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:480:9
     // NUTROOT_MAX_SLOTS) bounds the list before any EC decompression.
     const leafKeys = new Set(leaves.flatMap((leaf) => leaf.keys));
     const requestedBlindKeys = nutroot.blindKeys ?? [];
-    if (requestedBlindKeys.length > leafKeys.size) {
+    if (true) {
       throw new CTSError(`Too many blind-me keys: ${requestedBlindKeys.length}`);
     }
killedBy: nutroot (v3) request marking the option converts to sender-side derivation arguments
statusReason: Too many blind-me keys: 1

[Killed] EqualityOperator
src/model/PaymentRequest.ts:480:9
     // NUTROOT_MAX_SLOTS) bounds the list before any EC decompression.
     const leafKeys = new Set(leaves.flatMap((leaf) => leaf.keys));
     const requestedBlindKeys = nutroot.blindKeys ?? [];
-    if (requestedBlindKeys.length > leafKeys.size) {
+    if (requestedBlindKeys.length <= leafKeys.size) {
       throw new CTSError(`Too many blind-me keys: ${requestedBlindKeys.length}`);
     }
killedBy: nutroot (v3) request marking the option converts to sender-side derivation arguments
statusReason: Too many blind-me keys: 1

[Killed] ArrowFunction
src/model/PaymentRequest.ts:483:46
     if (requestedBlindKeys.length > leafKeys.size) {
       throw new CTSError(`Too many blind-me keys: ${requestedBlindKeys.length}`);
     }
-    const blindKeys = requestedBlindKeys.map((key) => normalizeSecpPubkey(key));
+    const blindKeys = requestedBlindKeys.map(() => undefined);
     for (const key of blindKeys) {
       if (!leafKeys.has(key)) {
killedBy: nutroot (v3) request marking the option converts to sender-side derivation arguments
statusReason: blind-me key is not in the requested tree: undefined

[Killed] BlockStatement
src/model/PaymentRequest.ts:484:34
       throw new CTSError(`Too many blind-me keys: ${requestedBlindKeys.length}`);
     }
     const blindKeys = requestedBlindKeys.map((key) => normalizeSecpPubkey(key));
-    for (const key of blindKeys) {
-      if (!leafKeys.has(key)) {
-        throw new CTSError(`blind-me key is not in the requested tree: ${key}`);
-      }
-    }
+    for (const key of blindKeys) {}
     return {
       receiverKey,
killedBy: nutroot (v3) request marking foreign blind-me keys require a tree and must belong to it
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:485:11
     }
     const blindKeys = requestedBlindKeys.map((key) => normalizeSecpPubkey(key));
     for (const key of blindKeys) {
-      if (!leafKeys.has(key)) {
+      if (true) {
         throw new CTSError(`blind-me key is not in the requested tree: ${key}`);
       }
killedBy: nutroot (v3) request marking the option converts to sender-side derivation arguments
statusReason: blind-me key is not in the requested tree: 02e493dbf1c10d80f3581e4904930b1404cc6c13900ee0758474fa94abe8c4cd13

[Killed] BlockStatement
src/model/PaymentRequest.ts:485:31
     }
     const blindKeys = requestedBlindKeys.map((key) => normalizeSecpPubkey(key));
     for (const key of blindKeys) {
-      if (!leafKeys.has(key)) {
-        throw new CTSError(`blind-me key is not in the requested tree: ${key}`);
-      }
+      if (!leafKeys.has(key)) {}
     }
     return {
killedBy: nutroot (v3) request marking foreign blind-me keys require a tree and must belong to it
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:492:11
     return {
       receiverKey,
       leaves,
-      ...(blindKeys.length && { blindKeys }),
+      ...(true),
     };
   }
killedBy: nutroot (v3) request marking the option converts to sender-side derivation arguments
statusReason: expected { …(2) } to deeply equal { …(3) }

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:492:11
     return {
       receiverKey,
       leaves,
-      ...(blindKeys.length && { blindKeys }),
+      ...(false),
     };
   }
killedBy: nutroot (v3) request marking the option converts to sender-side derivation arguments
statusReason: expected { …(2) } to deeply equal { …(3) }

[Killed] ArrowFunction
src/model/PaymentRequest.ts:505:33
    */
   static fromRawRequest(rawPaymentRequest: RawPaymentRequest): PaymentRequest {
     const transports = rawPaymentRequest.t
-      ? rawPaymentRequest.t.map((t: RawTransport) => ({
-          type: t.t,
-          target: t.a,
-          tags: t.g,
-        }))
+      ? rawPaymentRequest.t.map(() => undefined)
       : undefined;
     const nut10 = rawPaymentRequest.nut10
killedBy: payment requests encode payment requests
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ArrowFunction
src/model/PaymentRequest.ts:518:56
           tags: rawPaymentRequest.nut10.t,
         }
       : undefined;
-    const supportedMethods = rawPaymentRequest.sm?.map((m) => ({ method: m.mn, fee: m.mf }));
+    const supportedMethods = rawPaymentRequest.sm?.map(() => undefined);
     const nutroot = rawPaymentRequest.nutroot
       ? {
killedBy: payment requests mint preferences (mp, sm) encode/decode preferred mint list with supported methods (creqA)
statusReason: Cannot read properties of undefined (reading 'method')

[Killed] OptionalChaining
src/model/PaymentRequest.ts:518:30
           tags: rawPaymentRequest.nut10.t,
         }
       : undefined;
-    const supportedMethods = rawPaymentRequest.sm?.map((m) => ({ method: m.mn, fee: m.mf }));
+    const supportedMethods = rawPaymentRequest.sm.map((m) => ({ method: m.mn, fee: m.mf }));
     const nutroot = rawPaymentRequest.nutroot
       ? {
killedBy: payment requests encode payment requests
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ObjectLiteral
src/model/PaymentRequest.ts:526:31
           blindKeys: rawPaymentRequest.nutroot.b,
         }
       : undefined;
-    return new PaymentRequest({
-      nutroot,
-      transport: transports,
-      id: rawPaymentRequest.i,
-      amount: rawPaymentRequest.a,
-      unit: rawPaymentRequest.u,
-      mints: rawPaymentRequest.m,
-      description: rawPaymentRequest.d,
-      singleUse: rawPaymentRequest.s,
-      nut10,
-      mintsPreferred: rawPaymentRequest.mp,
-      supportedMethods,
-    });
+    return new PaymentRequest({});
   }
 
killedBy: payment requests encode payment requests
statusReason: expected undefined to be '4840f51e' // Object.is equality

[Killed] MethodExpression
src/model/PaymentRequest.ts:542:26
   }
 
   static fromEncodedRequest(encodedRequest: string): PaymentRequest {
-    const lowerRequest = encodedRequest.toLowerCase();
+    const lowerRequest = encodedRequest.toUpperCase();
 
     // Version B: bech32m + TLV encoding (creqb...)
killedBy: payment requests encode payment requests
statusReason: unsupported pr: invalid prefix

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:545:9
     const lowerRequest = encodedRequest.toLowerCase();
 
     // Version B: bech32m + TLV encoding (creqb...)
-    if (lowerRequest.startsWith('creqb')) {
+    if (false) {
       // The HRP must be exactly `creqb` (NUT-26); a longer HRP shares the prefix but is not it.
       const { hrp, data } = decodeBech32m(lowerRequest);
killedBy: payment requests mint preferences (mp, sm) encode/decode preferred mint list with supported methods (creqB)
statusReason: unsupported pr version

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:545:9
     const lowerRequest = encodedRequest.toLowerCase();
 
     // Version B: bech32m + TLV encoding (creqb...)
-    if (lowerRequest.startsWith('creqb')) {
+    if (true) {
       // The HRP must be exactly `creqb` (NUT-26); a longer HRP shares the prefix but is not it.
       const { hrp, data } = decodeBech32m(lowerRequest);
killedBy: payment requests encode payment requests
statusReason: invalid data length

[Killed] EqualityOperator
src/model/PaymentRequest.ts:548:11
     if (lowerRequest.startsWith('creqb')) {
       // The HRP must be exactly `creqb` (NUT-26); a longer HRP shares the prefix but is not it.
       const { hrp, data } = decodeBech32m(lowerRequest);
-      if (hrp !== 'creqb') {
+      if (hrp === 'creqb') {
         throw new CTSError('unsupported pr: invalid prefix');
       }
killedBy: payment requests mint preferences (mp, sm) encode/decode preferred mint list with supported methods (creqB)
statusReason: unsupported pr: invalid prefix

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:548:11
     if (lowerRequest.startsWith('creqb')) {
       // The HRP must be exactly `creqb` (NUT-26); a longer HRP shares the prefix but is not it.
       const { hrp, data } = decodeBech32m(lowerRequest);
-      if (hrp !== 'creqb') {
+      if (false) {
         throw new CTSError('unsupported pr: invalid prefix');
       }
killedBy: payment requests toEncodedCreqB - creqB format (TLV + bech32m) rejects a bech32m string whose HRP is not exactly creqb
statusReason: expected [Function] to throw an error

[Killed] ObjectLiteral
src/model/PaymentRequest.ts:553:11
       }
       const decoded = decodeTLV(data);
       const nut10 = decoded.nut10
-        ? {
-            kind: decoded.nut10.kind,
-            data: decoded.nut10.data,
-            tags: decoded.nut10.tags ?? [],
-          }
+        ? {}
         : undefined;
       return new PaymentRequest({
killedBy: payment requests toEncodedCreqB - creqB format (TLV + bech32m) encode and decode payment request with NUT-10
statusReason: expected undefined to be 'P2PK' // Object.is equality

[Killed] LogicalOperator
src/model/PaymentRequest.ts:556:19
         ? {
             kind: decoded.nut10.kind,
             data: decoded.nut10.data,
-            tags: decoded.nut10.tags ?? [],
+            tags: decoded.nut10.tags && [],
           }
         : undefined;
killedBy: payment requests toEncodedCreqB - creqB format (TLV + bech32m) encode and decode payment request with NUT-10
statusReason: expected [] to strictly equal [ [ 'timeout', '7200' ], …(1) ]

[Killed] MethodExpression
src/model/PaymentRequest.ts:576:10
 
     // Version A: CBOR encoding (creqA...). The prefix check is case-insensitive (NUT-26);
     // the base64 payload keeps its case.
-    if (!lowerRequest.startsWith('creq')) {
+    if (!lowerRequest.endsWith('creq')) {
       throw new CTSError('unsupported pr: invalid prefix');
     }
killedBy: payment requests encode payment requests
statusReason: unsupported pr: invalid prefix

[Killed] BooleanLiteral
src/model/PaymentRequest.ts:576:9
 
     // Version A: CBOR encoding (creqA...). The prefix check is case-insensitive (NUT-26);
     // the base64 payload keeps its case.
-    if (!lowerRequest.startsWith('creq')) {
+    if (lowerRequest.startsWith('creq')) {
       throw new CTSError('unsupported pr: invalid prefix');
     }
killedBy: payment requests encode payment requests
statusReason: unsupported pr: invalid prefix

[Killed] StringLiteral
src/model/PaymentRequest.ts:577:26
     // Version A: CBOR encoding (creqA...). The prefix check is case-insensitive (NUT-26);
     // the base64 payload keeps its case.
     if (!lowerRequest.startsWith('creq')) {
-      throw new CTSError('unsupported pr: invalid prefix');
+      throw new CTSError("");
     }
     const version = lowerRequest[4];
killedBy: payment requests test unsupported prefix/version
statusReason: expected [Function] to throw error including 'unsupported pr: invalid prefix' but got ''

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:580:9
       throw new CTSError('unsupported pr: invalid prefix');
     }
     const version = lowerRequest[4];
-    if (version !== 'a') {
+    if (false) {
       throw new CTSError('unsupported pr version');
     }
killedBy: payment requests test unsupported prefix/version
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/model/PaymentRequest.ts:580:26
       throw new CTSError('unsupported pr: invalid prefix');
     }
     const version = lowerRequest[4];
-    if (version !== 'a') {
-      throw new CTSError('unsupported pr version');
-    }
+    if (version !== 'a') {}
     const encodedData = encodedRequest.slice(5);
     // NUT-18 mandates base64url, but requests this library emitted before it encoded that way
killedBy: payment requests test unsupported prefix/version
statusReason: expected [Function] to throw an error

[Killed] MethodExpression
src/model/PaymentRequest.ts:583:25
     if (version !== 'a') {
       throw new CTSError('unsupported pr version');
     }
-    const encodedData = encodedRequest.slice(5);
+    const encodedData = encodedRequest;
     // NUT-18 mandates base64url, but requests this library emitted before it encoded that way
     // are standard base64 and still in circulation. CDK falls back the same way, and only here.
killedBy: payment requests encode payment requests
statusReason: Malformed UTF-8 sequence

[Killed] BlockStatement
src/model/PaymentRequest.ts:587:9
     // NUT-18 mandates base64url, but requests this library emitted before it encoded that way
     // are standard base64 and still in circulation. CDK falls back the same way, and only here.
     let data: Uint8Array;
-    try {
-      data = decodeBase64UrlToUint8(encodedData);
-    } catch (urlSafeError) {
+    try {} catch (urlSafeError) {
       try {
         data = decodeBase64ToUint8Legacy(encodedData);
killedBy: payment requests encode payment requests
statusReason: Cannot read properties of undefined (reading 'buffer')

[Killed] BlockStatement
src/model/PaymentRequest.ts:589:28
     let data: Uint8Array;
     try {
       data = decodeBase64UrlToUint8(encodedData);
-    } catch (urlSafeError) {
-      try {
-        data = decodeBase64ToUint8Legacy(encodedData);
-      } catch {
-        throw urlSafeError;
-      }
-    }
+    } catch (urlSafeError) {}
     const decoded = decodeCBOR(data) as RawPaymentRequest;
     return this.fromRawRequest(decoded);
killedBy: creqA alphabet compatibility decodes standard base64 from older versions
statusReason: Cannot read properties of undefined (reading 'buffer')

[Killed] BlockStatement
src/model/PaymentRequest.ts:590:11
     try {
       data = decodeBase64UrlToUint8(encodedData);
     } catch (urlSafeError) {
-      try {
-        data = decodeBase64ToUint8Legacy(encodedData);
-      } catch {
+      try {} catch {
         throw urlSafeError;
       }
killedBy: creqA alphabet compatibility decodes standard base64 from older versions
statusReason: Cannot read properties of undefined (reading 'buffer')

[Killed] BlockStatement
src/model/PaymentRequest.ts:592:15
     } catch (urlSafeError) {
       try {
         data = decodeBase64ToUint8Legacy(encodedData);
-      } catch {
-        throw urlSafeError;
-      }
+      } catch {}
     }
     const decoded = decodeCBOR(data) as RawPaymentRequest;
killedBy: creqA alphabet compatibility still rejects input that is neither
statusReason: expected [Function] to throw error matching /Invalid base64url/ but got 'Cannot read properties of undefined (…'

[Killed] BlockStatement
src/model/PaymentRequest.ts:629:65
    * Lets a caller tell a deliberate omission (eg no `nut10` for blinded keys or disclosure) from a
    * bug, and show the reason. Reset by the next `lock()`.
    */
-  get omitted(): Readonly<{ nut10?: string; nutroot?: string }> {
-    return { ...this._omitted };
-  }
+  get omitted(): Readonly<{ nut10?: string; nutroot?: string }> {}
   private _methods: Array<{ method: string; fee?: AmountLike }> = [];
 
killedBy: PaymentRequestBuilder omitted names why an encoding was dropped, and clears on the next lock()
statusReason: expected undefined to deeply equal {}

[Killed] BlockStatement
src/model/PaymentRequest.ts:637:24
   /**
    * Sets the optional payment ID reference.
    */
-  id(id: string): this {
-    this._id = id;
-    return this;
-  }
+  id(id: string): this {}
 
   /**
killedBy: PaymentRequestBuilder builds a full request that round-trips through creqA
statusReason: Cannot read properties of undefined (reading 'amount')

[Killed] BlockStatement
src/model/PaymentRequest.ts:647:50
    *
    * @throws If the unit is empty.
    */
-  amount(amount: AmountLike, unit: string): this {
-    if (!unit) {
-      throw new CTSError('amount requires a unit (NUT-18: `u` MUST be set when `a` is set)');
-    }
-    this._amount = amount;
-    this._unit = unit;
-    return this;
-  }
+  amount(amount: AmountLike, unit: string): this {}
 
   /**
killedBy: nutroot (v3) request marking round-trips through creqA, tags and all
statusReason: Cannot read properties of undefined (reading 'requestNutroot')

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:648:9
    * @throws If the unit is empty.
    */
   amount(amount: AmountLike, unit: string): this {
-    if (!unit) {
+    if (false) {
       throw new CTSError('amount requires a unit (NUT-18: `u` MUST be set when `a` is set)');
     }
killedBy: PaymentRequestBuilder amount() rejects an empty unit; addSupportedMethod() rejects an empty method
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/model/PaymentRequest.ts:648:16
    * @throws If the unit is empty.
    */
   amount(amount: AmountLike, unit: string): this {
-    if (!unit) {
-      throw new CTSError('amount requires a unit (NUT-18: `u` MUST be set when `a` is set)');
-    }
+    if (!unit) {}
     this._amount = amount;
     this._unit = unit;
killedBy: PaymentRequestBuilder amount() rejects an empty unit; addSupportedMethod() rejects an empty method
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/model/PaymentRequest.ts:649:26
    */
   amount(amount: AmountLike, unit: string): this {
     if (!unit) {
-      throw new CTSError('amount requires a unit (NUT-18: `u` MUST be set when `a` is set)');
+      throw new CTSError("");
     }
     this._amount = amount;
killedBy: PaymentRequestBuilder amount() rejects an empty unit; addSupportedMethod() rejects an empty method
statusReason: expected [Function] to throw error matching /requires a unit/ but got ''

[Killed] BlockStatement
src/model/PaymentRequest.ts:661:28
    *
    * @throws If the unit is empty.
    */
-  unit(unit: string): this {
-    if (!unit) {
-      throw new CTSError('unit must be a non-empty string');
-    }
-    this._unit = unit;
-    return this;
-  }
+  unit(unit: string): this {}
 
   /**
killedBy: PaymentRequestBuilder amount() sets amount and unit together; unit() alone works for amountless
statusReason: Cannot read properties of undefined (reading 'build')

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:662:9
    * @throws If the unit is empty.
    */
   unit(unit: string): this {
-    if (!unit) {
+    if (true) {
       throw new CTSError('unit must be a non-empty string');
     }
killedBy: PaymentRequestBuilder amount() sets amount and unit together; unit() alone works for amountless
statusReason: unit must be a non-empty string

[Killed] BlockStatement
src/model/PaymentRequest.ts:662:16
    * @throws If the unit is empty.
    */
   unit(unit: string): this {
-    if (!unit) {
-      throw new CTSError('unit must be a non-empty string');
-    }
+    if (!unit) {}
     this._unit = unit;
     return this;
killedBy: PaymentRequestBuilder amount() rejects an empty unit; addSupportedMethod() rejects an empty method
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/model/PaymentRequest.ts:672:42
   /**
    * A human readable description for the payment request.
    */
-  description(description: string): this {
-    this._description = description;
-    return this;
-  }
+  description(description: string): this {}
 
   /**
killedBy: PaymentRequestBuilder builds a full request that round-trips through creqA
statusReason: Cannot read properties of undefined (reading 'addMint')

[Killed] BlockStatement
src/model/PaymentRequest.ts:683:42
    *
    * @throws If a URL is not a valid mint URL.
    */
-  addMint(mint: string | string[]): this {
-    const arr = Array.isArray(mint) ? mint : [mint];
-    for (const m of arr) {
-      const normalized = normalizeMintUrl(m);
-      if (!this._mints.includes(normalized)) this._mints.push(normalized);
-    }
-    return this;
-  }
+  addMint(mint: string | string[]): this {}
 
   /**
killedBy: PaymentRequestBuilder builds a full request that round-trips through creqA
statusReason: Cannot read properties of undefined (reading 'mintsPreferred')

[Killed] BlockStatement
src/model/PaymentRequest.ts:685:26
    */
   addMint(mint: string | string[]): this {
     const arr = Array.isArray(mint) ? mint : [mint];
-    for (const m of arr) {
-      const normalized = normalizeMintUrl(m);
-      if (!this._mints.includes(normalized)) this._mints.push(normalized);
-    }
+    for (const m of arr) {}
     return this;
   }
killedBy: PaymentRequestBuilder builds a full request that round-trips through creqA
statusReason: mintsPreferred (mp) requires a mint list; add mints or drop the flag

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:687:11
     const arr = Array.isArray(mint) ? mint : [mint];
     for (const m of arr) {
       const normalized = normalizeMintUrl(m);
-      if (!this._mints.includes(normalized)) this._mints.push(normalized);
+      if (true) this._mints.push(normalized);
     }
     return this;
killedBy: PaymentRequestBuilder addMint normalizes URLs and dedupes with first-seen order
statusReason: expected [ 'https://a.mint', …(2) ] to deeply equal [ 'https://a.mint', 'https://b.mint' ]

[Killed] CallExpression
src/model/PaymentRequest.ts:687:46
     const arr = Array.isArray(mint) ? mint : [mint];
     for (const m of arr) {
       const normalized = normalizeMintUrl(m);
-      if (!this._mints.includes(normalized)) this._mints.push(normalized);
+      if (!this._mints.includes(normalized)) ;
     }
     return this;
killedBy: PaymentRequestBuilder builds a full request that round-trips through creqA
statusReason: mintsPreferred (mp) requires a mint list; add mints or drop the flag

[Killed] BooleanLiteral
src/model/PaymentRequest.ts:695:30
   /**
    * Marks the mint list advisory (`mp`) rather than strict; requires mints at `build()`.
    */
-  mintsPreferred(preferred = true): this {
+  mintsPreferred(preferred = false): this {
     this._mintsPreferred = preferred;
     return this;
killedBy: PaymentRequestBuilder builds a full request that round-trips through creqA
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/model/PaymentRequest.ts:695:42
   /**
    * Marks the mint list advisory (`mp`) rather than strict; requires mints at `build()`.
    */
-  mintsPreferred(preferred = true): this {
-    this._mintsPreferred = preferred;
-    return this;
-  }
+  mintsPreferred(preferred = true): this {}
 
   singleUse(single = true): this {
killedBy: PaymentRequestBuilder builds a full request that round-trips through creqA
statusReason: Cannot read properties of undefined (reading 'addNostrTransport')

[Killed] BooleanLiteral
src/model/PaymentRequest.ts:700:22
     return this;
   }
 
-  singleUse(single = true): this {
+  singleUse(single = false): this {
     this._singleUse = single;
     return this;
killedBy: PaymentRequestBuilder builds a full request that round-trips through creqA
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/model/PaymentRequest.ts:700:34
     return this;
   }
 
-  singleUse(single = true): this {
-    this._singleUse = single;
-    return this;
-  }
+  singleUse(single = true): this {}
 
   /**
killedBy: PaymentRequestBuilder builds a full request that round-trips through creqA
statusReason: Cannot read properties of undefined (reading 'build')

[Killed] BlockStatement
src/model/PaymentRequest.ts:708:58
   /**
    * Appends a transport; order is preference order (NUT-18).
    */
-  addTransport(transport: PaymentRequestTransport): this {
-    this._transports.push(transport);
-    return this;
-  }
+  addTransport(transport: PaymentRequestTransport): this {}
 
   /**
killedBy: PaymentRequestBuilder builds a full request that round-trips through creqA
statusReason: Cannot read properties of undefined (reading 'addHttpPostTransport')

[Killed] CallExpression
src/model/PaymentRequest.ts:709:5
    * Appends a transport; order is preference order (NUT-18).
    */
   addTransport(transport: PaymentRequestTransport): this {
-    this._transports.push(transport);
+    ;
     return this;
   }
killedBy: PaymentRequestBuilder builds a full request that round-trips through creqA
statusReason: expected undefined to deeply equal [ { type: 'nostr', …(2) }, …(1) ]

[Killed] BlockStatement
src/model/PaymentRequest.ts:719:70
    * @throws If the target is not an nprofile, or `nips` is empty (the `n` tag MUST carry at least
    *   one value).
    */
-  addNostrTransport(nprofile: string, nips: string[] = ['17']): this {
-    if (!nprofile.startsWith('nprofile1')) {
-      throw new CTSError('nostr transport target must be an nprofile');
-    }
-    if (nips.length === 0) {
-      throw new CTSError('nostr transport requires at least one NIP (`n` tag value)');
-    }
-    return this.addTransport({
-      type: PaymentRequestTransportType.NOSTR,
-      target: nprofile,
-      tags: [['n', ...nips.map(String)]],
-    });
-  }
+  addNostrTransport(nprofile: string, nips: string[] = ['17']): this {}
 
   /**
killedBy: PaymentRequestBuilder builds a full request that round-trips through creqA
statusReason: Cannot read properties of undefined (reading 'addHttpPostTransport')

[Killed] BlockStatement
src/model/PaymentRequest.ts:720:44
    *   one value).
    */
   addNostrTransport(nprofile: string, nips: string[] = ['17']): this {
-    if (!nprofile.startsWith('nprofile1')) {
-      throw new CTSError('nostr transport target must be an nprofile');
-    }
+    if (!nprofile.startsWith('nprofile1')) {}
     if (nips.length === 0) {
       throw new CTSError('nostr transport requires at least one NIP (`n` tag value)');
killedBy: PaymentRequestBuilder addNostrTransport validates target and nips
statusReason: expected [Function] to throw an error

[Killed] MethodExpression
src/model/PaymentRequest.ts:720:10
    *   one value).
    */
   addNostrTransport(nprofile: string, nips: string[] = ['17']): this {
-    if (!nprofile.startsWith('nprofile1')) {
+    if (!nprofile.endsWith('nprofile1')) {
       throw new CTSError('nostr transport target must be an nprofile');
     }
killedBy: PaymentRequestBuilder builds a full request that round-trips through creqA
statusReason: nostr transport target must be an nprofile

[Killed] BlockStatement
src/model/PaymentRequest.ts:723:28
     if (!nprofile.startsWith('nprofile1')) {
       throw new CTSError('nostr transport target must be an nprofile');
     }
-    if (nips.length === 0) {
-      throw new CTSError('nostr transport requires at least one NIP (`n` tag value)');
-    }
+    if (nips.length === 0) {}
     return this.addTransport({
       type: PaymentRequestTransportType.NOSTR,
killedBy: PaymentRequestBuilder addNostrTransport validates target and nips
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:723:9
     if (!nprofile.startsWith('nprofile1')) {
       throw new CTSError('nostr transport target must be an nprofile');
     }
-    if (nips.length === 0) {
+    if (true) {
       throw new CTSError('nostr transport requires at least one NIP (`n` tag value)');
     }
killedBy: PaymentRequestBuilder builds a full request that round-trips through creqA
statusReason: nostr transport requires at least one NIP (`n` tag value)

[Killed] ArrayDeclaration
src/model/PaymentRequest.ts:729:13
     return this.addTransport({
       type: PaymentRequestTransportType.NOSTR,
       target: nprofile,
-      tags: [['n', ...nips.map(String)]],
+      tags: [],
     });
   }
killedBy: PaymentRequestBuilder builds a full request that round-trips through creqA
statusReason: expected [ { type: 'nostr', …(2) }, …(1) ] to deeply equal [ { type: 'nostr', …(2) }, …(1) ]

[Killed] BlockStatement
src/model/PaymentRequest.ts:736:43
   /**
    * Appends an HTTP POST transport; the payer POSTs the payment payload to `url`.
    */
-  addHttpPostTransport(url: string): this {
-    return this.addTransport({ type: PaymentRequestTransportType.POST, target: url });
-  }
+  addHttpPostTransport(url: string): this {}
 
   /**
killedBy: PaymentRequestBuilder builds a full request that round-trips through creqA
statusReason: Cannot read properties of undefined (reading 'addSupportedMethod')

[Killed] BlockStatement
src/model/PaymentRequest.ts:745:62
    *
    * @throws If the method name is empty.
    */
-  addSupportedMethod(method: string, fee?: AmountLike): this {
-    if (!method) {
-      throw new CTSError('supported method name must be a non-empty string');
-    }
-    this._methods.push({ method, fee });
-    return this;
-  }
+  addSupportedMethod(method: string, fee?: AmountLike): this {}
 
   /**
killedBy: PaymentRequestBuilder builds a full request that round-trips through creqA
statusReason: Cannot read properties of undefined (reading 'addSupportedMethod')
