[Killed] BlockStatement
src/model/PaymentRequest.ts:746:18
    * @throws If the method name is empty.
    */
   addSupportedMethod(method: string, fee?: AmountLike): this {
-    if (!method) {
-      throw new CTSError('supported method name must be a non-empty string');
-    }
+    if (!method) {}
     this._methods.push({ method, fee });
     return this;
killedBy: PaymentRequestBuilder amount() rejects an empty unit; addSupportedMethod() rejects an empty method
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/model/PaymentRequest.ts:746:9
    * @throws If the method name is empty.
    */
   addSupportedMethod(method: string, fee?: AmountLike): this {
-    if (!method) {
+    if (method) {
       throw new CTSError('supported method name must be a non-empty string');
     }
killedBy: PaymentRequestBuilder builds a full request that round-trips through creqA
statusReason: supported method name must be a non-empty string

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:766:9
   lock(lock: LockOptions | LockBuilder | P2PKOptions, opts?: { legacy?: boolean }): this {
     const semantic = asLockOptions(lock);
     this._omitted = {};
-    if (!semantic) {
+    if (false) {
       this._nut10 = p2pkOptionsToPRNut10(lock as P2PKOptions);
       this._nutroot = undefined;
killedBy: PaymentRequestBuilder wire P2PKOptions input still targets nut10 alone
statusReason: lock fits no permitted request encoding: Cannot read properties of undefined (reading 'leaves'); Cannot read properties of undefined (reading 'additionalTags')

[Killed] BooleanLiteral
src/model/PaymentRequest.ts:766:9
   lock(lock: LockOptions | LockBuilder | P2PKOptions, opts?: { legacy?: boolean }): this {
     const semantic = asLockOptions(lock);
     this._omitted = {};
-    if (!semantic) {
+    if (semantic) {
       this._nut10 = p2pkOptionsToPRNut10(lock as P2PKOptions);
       this._nutroot = undefined;
killedBy: PaymentRequestBuilder lock() accepts a LockBuilder and semantic LockOptions directly
statusReason: Unknown lock kind: undefined

[Killed] BlockStatement
src/model/PaymentRequest.ts:772:89
       return this;
     }
     const omitted: { nut10?: string; nutroot?: string } = {};
-    const tryEncode = <T>(key: keyof typeof omitted, encode: () => T): T | undefined => {
-      try {
-        return encode();
-      } catch (e) {
-        omitted[key] = e instanceof Error ? e.message : String(e);
-        return undefined;
-      }
-    };
+    const tryEncode = <T>(key: keyof typeof omitted, encode: () => T): T | undefined => {};
     const nut10 =
       opts?.legacy === false
killedBy: PaymentRequestBuilder lock() accepts a LockBuilder and semantic LockOptions directly
statusReason: lock fits no permitted request encoding:

[Killed] BlockStatement
src/model/PaymentRequest.ts:773:11
     }
     const omitted: { nut10?: string; nutroot?: string } = {};
     const tryEncode = <T>(key: keyof typeof omitted, encode: () => T): T | undefined => {
-      try {
-        return encode();
-      } catch (e) {
+      try {} catch (e) {
         omitted[key] = e instanceof Error ? e.message : String(e);
         return undefined;
killedBy: PaymentRequestBuilder lock() accepts a LockBuilder and semantic LockOptions directly
statusReason: lock fits no permitted request encoding:

[Killed] BlockStatement
src/model/PaymentRequest.ts:775:19
     const tryEncode = <T>(key: keyof typeof omitted, encode: () => T): T | undefined => {
       try {
         return encode();
-      } catch (e) {
-        omitted[key] = e instanceof Error ? e.message : String(e);
-        return undefined;
-      }
+      } catch (e) {}
     };
     const nut10 =
killedBy: PaymentRequestBuilder omitted names why an encoding was dropped, and clears on the next lock()
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:781:7
       }
     };
     const nut10 =
-      opts?.legacy === false
+      false
         ? undefined
         : tryEncode('nut10', () => p2pkOptionsToPRNut10(lockToP2PKOptions(semantic)));
killedBy: PaymentRequestBuilder legacy: false generates the current spec alone
statusReason: expected { kind: 'P2PK', …(2) } to be undefined

[Killed] BooleanLiteral
src/model/PaymentRequest.ts:781:24
       }
     };
     const nut10 =
-      opts?.legacy === false
+      opts?.legacy === true
         ? undefined
         : tryEncode('nut10', () => p2pkOptionsToPRNut10(lockToP2PKOptions(semantic)));
killedBy: PaymentRequestBuilder legacy: false generates the current spec alone
statusReason: expected { kind: 'P2PK', …(2) } to be undefined

[Killed] ArrowFunction
src/model/PaymentRequest.ts:783:30
     const nut10 =
       opts?.legacy === false
         ? undefined
-        : tryEncode('nut10', () => p2pkOptionsToPRNut10(lockToP2PKOptions(semantic)));
+        : tryEncode('nut10', () => undefined);
     const nutroot = tryEncode('nutroot', () => encodeNutrootRequest(semantic));
     if (!nut10 && !nutroot) {
killedBy: PaymentRequestBuilder lock() accepts a LockBuilder and semantic LockOptions directly
statusReason: expected undefined to be 'P2PK' // Object.is equality

[Killed] ArrowFunction
src/model/PaymentRequest.ts:784:42
       opts?.legacy === false
         ? undefined
         : tryEncode('nut10', () => p2pkOptionsToPRNut10(lockToP2PKOptions(semantic)));
-    const nutroot = tryEncode('nutroot', () => encodeNutrootRequest(semantic));
+    const nutroot = tryEncode('nutroot', () => undefined);
     if (!nut10 && !nutroot) {
       throw new CTSError(
killedBy: PaymentRequestBuilder lock() emits both encodings when both can express the condition
statusReason: expected undefined to be '02a9acc1e48c25eeeb9289b5031cc57da9fe7…' // Object.is equality

[Killed] BooleanLiteral
src/model/PaymentRequest.ts:785:19
         ? undefined
         : tryEncode('nut10', () => p2pkOptionsToPRNut10(lockToP2PKOptions(semantic)));
     const nutroot = tryEncode('nutroot', () => encodeNutrootRequest(semantic));
-    if (!nut10 && !nutroot) {
+    if (!nut10 && nutroot) {
       throw new CTSError(
         `lock fits no permitted request encoding: ${Object.values(omitted).join('; ')}`,
killedBy: PaymentRequestBuilder lock() emits only the encoding that fits a one-sided shape
statusReason: lock fits no permitted request encoding: Leaf locks need a v3 keyset: NUT-11 tags cannot express a tree

[Killed] LogicalOperator
src/model/PaymentRequest.ts:785:9
         ? undefined
         : tryEncode('nut10', () => p2pkOptionsToPRNut10(lockToP2PKOptions(semantic)));
     const nutroot = tryEncode('nutroot', () => encodeNutrootRequest(semantic));
-    if (!nut10 && !nutroot) {
+    if (!nut10 || !nutroot) {
       throw new CTSError(
         `lock fits no permitted request encoding: ${Object.values(omitted).join('; ')}`,
killedBy: PaymentRequestBuilder lock() emits only the encoding that fits a one-sided shape
statusReason: lock fits no permitted request encoding: Extra tags do not fit a v3 lock: v3 secrets carry no tags

[Killed] StringLiteral
src/model/PaymentRequest.ts:787:9
     const nutroot = tryEncode('nutroot', () => encodeNutrootRequest(semantic));
     if (!nut10 && !nutroot) {
       throw new CTSError(
-        `lock fits no permitted request encoding: ${Object.values(omitted).join('; ')}`,
+        ``,
       );
     }
killedBy: PaymentRequestBuilder lock() refuses a shape neither encoding expresses
statusReason: expected [Function] to throw error matching /no permitted request encoding/i but got ''

[Killed] CallExpression
src/model/PaymentRequest.ts:793:18
     this._omitted = omitted;
     this._nut10 = nut10;
     this._nutroot = undefined;
-    if (nutroot) this.requestNutroot(nutroot);
+    if (nutroot) ;
     return this;
   }
killedBy: PaymentRequestBuilder lock() emits both encodings when both can express the condition
statusReason: expected undefined to be '02a9acc1e48c25eeeb9289b5031cc57da9fe7…' // Object.is equality

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:793:9
     this._omitted = omitted;
     this._nut10 = nut10;
     this._nutroot = undefined;
-    if (nutroot) this.requestNutroot(nutroot);
+    if (true) this.requestNutroot(nutroot);
     return this;
   }
killedBy: PaymentRequestBuilder lock() emits only the encoding that fits a one-sided shape
statusReason: Cannot read properties of undefined (reading 'toOptions')

[Killed] BlockStatement
src/model/PaymentRequest.ts:800:36
   /**
    * Sets the `nut10` locking condition verbatim, for kinds `lock()` cannot express.
    */
-  nut10(option: NUT10Option): this {
-    this._nut10 = option;
-    return this;
-  }
+  nut10(option: NUT10Option): this {}
 
   /**
killedBy: PaymentRequestBuilder nut10() passes arbitrary kinds through verbatim; last lock write wins
statusReason: Cannot read properties of undefined (reading 'build')

[Killed] ObjectLiteral
src/model/PaymentRequest.ts:821:36
     const option: NutrootOption = semantic
       ? encodeNutrootRequest(semantic)
       : (lock as NutrootOption);
-    const nutroot: NutrootOption = {
-      receiverKey: normalizeSecpPubkey(option.receiverKey),
-      ...(option.leaves?.length && { leaves: [...option.leaves] }),
-      ...(option.blindKeys?.length && {
-        blindKeys: option.blindKeys.map((k) => normalizeSecpPubkey(k)),
-      }),
-    };
+    const nutroot: NutrootOption = {};
     if ((nutroot.leaves?.length ?? 0) > NUTROOT_MAX_TREE_LEAVES) {
       throw new CTSError(`nutroot tree exceeds ${NUTROOT_MAX_TREE_LEAVES} leaves`);
killedBy: nutroot (v3) request marking round-trips through creqA, tags and all
statusReason: expected { receiverKey: undefined, …(2) } to deeply equal { …(3) }

[Killed] LogicalOperator
src/model/PaymentRequest.ts:823:11
       : (lock as NutrootOption);
     const nutroot: NutrootOption = {
       receiverKey: normalizeSecpPubkey(option.receiverKey),
-      ...(option.leaves?.length && { leaves: [...option.leaves] }),
+      ...(option.leaves?.length || {
+  leaves: [...option.leaves]
+}),
       ...(option.blindKeys?.length && {
         blindKeys: option.blindKeys.map((k) => normalizeSecpPubkey(k)),
killedBy: PaymentRequestBuilder lock() accepts a LockBuilder and semantic LockOptions directly
statusReason: option.leaves is not iterable

[Killed] OptionalChaining
src/model/PaymentRequest.ts:823:11
       : (lock as NutrootOption);
     const nutroot: NutrootOption = {
       receiverKey: normalizeSecpPubkey(option.receiverKey),
-      ...(option.leaves?.length && { leaves: [...option.leaves] }),
+      ...(option.leaves.length && { leaves: [...option.leaves] }),
       ...(option.blindKeys?.length && {
         blindKeys: option.blindKeys.map((k) => normalizeSecpPubkey(k)),
killedBy: nutroot (v3) request marking round-trips through creqA, tags and all
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:824:11
     const nutroot: NutrootOption = {
       receiverKey: normalizeSecpPubkey(option.receiverKey),
       ...(option.leaves?.length && { leaves: [...option.leaves] }),
-      ...(option.blindKeys?.length && {
-        blindKeys: option.blindKeys.map((k) => normalizeSecpPubkey(k)),
-      }),
+      ...(true),
     };
     if ((nutroot.leaves?.length ?? 0) > NUTROOT_MAX_TREE_LEAVES) {
killedBy: PaymentRequestBuilder requestNutroot() accepts semantic LockOptions and serializes the tree
statusReason: expected undefined to deeply equal [ Array(1) ]

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:824:11
     const nutroot: NutrootOption = {
       receiverKey: normalizeSecpPubkey(option.receiverKey),
       ...(option.leaves?.length && { leaves: [...option.leaves] }),
-      ...(option.blindKeys?.length && {
-        blindKeys: option.blindKeys.map((k) => normalizeSecpPubkey(k)),
-      }),
+      ...(false),
     };
     if ((nutroot.leaves?.length ?? 0) > NUTROOT_MAX_TREE_LEAVES) {
killedBy: nutroot (v3) request marking round-trips through creqA, tags and all
statusReason: expected { …(3) } to deeply equal { …(3) }

[Killed] ArrowFunction
src/model/PaymentRequest.ts:825:41
       receiverKey: normalizeSecpPubkey(option.receiverKey),
       ...(option.leaves?.length && { leaves: [...option.leaves] }),
       ...(option.blindKeys?.length && {
-        blindKeys: option.blindKeys.map((k) => normalizeSecpPubkey(k)),
+        blindKeys: option.blindKeys.map(() => undefined),
       }),
     };
killedBy: nutroot (v3) request marking round-trips through creqA, tags and all
statusReason: blind-me key is not in the requested tree: undefined

[Killed] LogicalOperator
src/model/PaymentRequest.ts:828:10
         blindKeys: option.blindKeys.map((k) => normalizeSecpPubkey(k)),
       }),
     };
-    if ((nutroot.leaves?.length ?? 0) > NUTROOT_MAX_TREE_LEAVES) {
+    if ((nutroot.leaves?.length && 0) > NUTROOT_MAX_TREE_LEAVES) {
       throw new CTSError(`nutroot tree exceeds ${NUTROOT_MAX_TREE_LEAVES} leaves`);
     }
killedBy: nutroot (v3) request marking more than eight requested leaves are refused when authored and parsed
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/model/PaymentRequest.ts:828:9
         blindKeys: option.blindKeys.map((k) => normalizeSecpPubkey(k)),
       }),
     };
-    if ((nutroot.leaves?.length ?? 0) > NUTROOT_MAX_TREE_LEAVES) {
+    if ((nutroot.leaves?.length ?? 0) <= NUTROOT_MAX_TREE_LEAVES) {
       throw new CTSError(`nutroot tree exceeds ${NUTROOT_MAX_TREE_LEAVES} leaves`);
     }
killedBy: nutroot (v3) request marking round-trips through creqA, tags and all
statusReason: nutroot tree exceeds 8 leaves

[Killed] StringLiteral
src/model/PaymentRequest.ts:829:26
       }),
     };
     if ((nutroot.leaves?.length ?? 0) > NUTROOT_MAX_TREE_LEAVES) {
-      throw new CTSError(`nutroot tree exceeds ${NUTROOT_MAX_TREE_LEAVES} leaves`);
+      throw new CTSError(``);
     }
     // Validate here rather than at build(): a request nobody can pay is worth catching at the
killedBy: nutroot (v3) request marking more than eight requested leaves are refused when authored and parsed
statusReason: expected [Function] to throw error matching /exceeds 8 leaves/ but got ''

[Killed] ArrowFunction
src/model/PaymentRequest.ts:834:38
     // Validate here rather than at build(): a request nobody can pay is worth catching at the
     // point the payee wrote it, not at the payer.
     const leafKeys = new Set(
-      (nutroot.leaves ?? []).flatMap((hex) => parseNutrootLeaf(hexToBytes(hex)).keys),
+      (nutroot.leaves ?? []).flatMap(() => undefined),
     );
     for (const key of nutroot.blindKeys ?? []) {
killedBy: nutroot (v3) request marking round-trips through creqA, tags and all
statusReason: blind-me key is not in the requested tree: 02e493dbf1c10d80f3581e4904930b1404cc6c13900ee0758474fa94abe8c4cd13

[Killed] LogicalOperator
src/model/PaymentRequest.ts:834:8
     // Validate here rather than at build(): a request nobody can pay is worth catching at the
     // point the payee wrote it, not at the payer.
     const leafKeys = new Set(
-      (nutroot.leaves ?? []).flatMap((hex) => parseNutrootLeaf(hexToBytes(hex)).keys),
+      (nutroot.leaves && []).flatMap((hex) => parseNutrootLeaf(hexToBytes(hex)).keys),
     );
     for (const key of nutroot.blindKeys ?? []) {
killedBy: nutroot (v3) request marking round-trips through creqA, tags and all
statusReason: blind-me key is not in the requested tree: 02e493dbf1c10d80f3581e4904930b1404cc6c13900ee0758474fa94abe8c4cd13

[Killed] BlockStatement
src/model/PaymentRequest.ts:836:48
     const leafKeys = new Set(
       (nutroot.leaves ?? []).flatMap((hex) => parseNutrootLeaf(hexToBytes(hex)).keys),
     );
-    for (const key of nutroot.blindKeys ?? []) {
-      if (!leafKeys.has(key)) {
-        throw new CTSError(`blind-me key is not in the requested tree: ${key}`);
-      }
-    }
+    for (const key of nutroot.blindKeys ?? []) {}
     if (nutroot.receiverKey === NUTROOT_NUMS_KEY && !nutroot.leaves?.length) {
       throw new CTSError('A NUMS receiver key requires leaves');
killedBy: nutroot (v3) request marking a blind-me key outside the requested tree is refused when authored
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
src/model/PaymentRequest.ts:836:23
     const leafKeys = new Set(
       (nutroot.leaves ?? []).flatMap((hex) => parseNutrootLeaf(hexToBytes(hex)).keys),
     );
-    for (const key of nutroot.blindKeys ?? []) {
+    for (const key of nutroot.blindKeys && []) {
       if (!leafKeys.has(key)) {
         throw new CTSError(`blind-me key is not in the requested tree: ${key}`);
killedBy: nutroot (v3) request marking round-trips through creqA, tags and all
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:837:11
       (nutroot.leaves ?? []).flatMap((hex) => parseNutrootLeaf(hexToBytes(hex)).keys),
     );
     for (const key of nutroot.blindKeys ?? []) {
-      if (!leafKeys.has(key)) {
+      if (true) {
         throw new CTSError(`blind-me key is not in the requested tree: ${key}`);
       }
killedBy: nutroot (v3) request marking round-trips through creqA, tags and all
statusReason: blind-me key is not in the requested tree: 02e493dbf1c10d80f3581e4904930b1404cc6c13900ee0758474fa94abe8c4cd13

[Killed] BlockStatement
src/model/PaymentRequest.ts:837:31
       (nutroot.leaves ?? []).flatMap((hex) => parseNutrootLeaf(hexToBytes(hex)).keys),
     );
     for (const key of nutroot.blindKeys ?? []) {
-      if (!leafKeys.has(key)) {
-        throw new CTSError(`blind-me key is not in the requested tree: ${key}`);
-      }
+      if (!leafKeys.has(key)) {}
     }
     if (nutroot.receiverKey === NUTROOT_NUMS_KEY && !nutroot.leaves?.length) {
killedBy: nutroot (v3) request marking a blind-me key outside the requested tree is refused when authored
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/model/PaymentRequest.ts:838:28
     );
     for (const key of nutroot.blindKeys ?? []) {
       if (!leafKeys.has(key)) {
-        throw new CTSError(`blind-me key is not in the requested tree: ${key}`);
+        throw new CTSError(``);
       }
     }
killedBy: nutroot (v3) request marking a blind-me key outside the requested tree is refused when authored
statusReason: expected [Function] to throw error matching /not in the requested tree/ but got ''

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:841:9
         throw new CTSError(`blind-me key is not in the requested tree: ${key}`);
       }
     }
-    if (nutroot.receiverKey === NUTROOT_NUMS_KEY && !nutroot.leaves?.length) {
+    if (true) {
       throw new CTSError('A NUMS receiver key requires leaves');
     }
killedBy: nutroot (v3) request marking round-trips through creqA, tags and all
statusReason: A NUMS receiver key requires leaves

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:841:9
         throw new CTSError(`blind-me key is not in the requested tree: ${key}`);
       }
     }
-    if (nutroot.receiverKey === NUTROOT_NUMS_KEY && !nutroot.leaves?.length) {
+    if (true && !nutroot.leaves?.length) {
       throw new CTSError('A NUMS receiver key requires leaves');
     }
killedBy: nutroot (v3) request marking round-trips through creqA, tags and all
statusReason: A NUMS receiver key requires leaves

[Killed] LogicalOperator
src/model/PaymentRequest.ts:856:9
    *   when `sm` is set).
    */
   build(): PaymentRequest {
-    if (this._mintsPreferred !== undefined && this._mints.length === 0) {
+    if (this._mintsPreferred !== undefined || this._mints.length === 0) {
       throw new CTSError('mintsPreferred (mp) requires a mint list; add mints or drop the flag');
     }
killedBy: nutroot (v3) request marking round-trips through creqA, tags and all
statusReason: mintsPreferred (mp) requires a mint list; add mints or drop the flag

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:856:47
    *   when `sm` is set).
    */
   build(): PaymentRequest {
-    if (this._mintsPreferred !== undefined && this._mints.length === 0) {
+    if (this._mintsPreferred !== undefined && true) {
       throw new CTSError('mintsPreferred (mp) requires a mint list; add mints or drop the flag');
     }
killedBy: PaymentRequestBuilder builds a full request that round-trips through creqA
statusReason: mintsPreferred (mp) requires a mint list; add mints or drop the flag

[Killed] BooleanLiteral
src/model/PaymentRequest.ts:859:37
     if (this._mintsPreferred !== undefined && this._mints.length === 0) {
       throw new CTSError('mintsPreferred (mp) requires a mint list; add mints or drop the flag');
     }
-    if (this._methods.length > 0 && !this._unit) {
+    if (this._methods.length > 0 && this._unit) {
       throw new CTSError(
         'supported methods (sm) require a unit; set it via amount(value, unit) or unit()',
killedBy: PaymentRequestBuilder builds a full request that round-trips through creqA
statusReason: supported methods (sm) require a unit; set it via amount(value, unit) or unit()

[Killed] BlockStatement
src/model/PaymentRequest.ts:859:50
     if (this._mintsPreferred !== undefined && this._mints.length === 0) {
       throw new CTSError('mintsPreferred (mp) requires a mint list; add mints or drop the flag');
     }
-    if (this._methods.length > 0 && !this._unit) {
-      throw new CTSError(
-        'supported methods (sm) require a unit; set it via amount(value, unit) or unit()',
-      );
-    }
+    if (this._methods.length > 0 && !this._unit) {}
     const seen = new Set<string>();
     for (const m of this._methods) {
killedBy: PaymentRequestBuilder supported methods without a unit throw at build(), in any call order
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/model/PaymentRequest.ts:865:36
       );
     }
     const seen = new Set<string>();
-    for (const m of this._methods) {
-      if (seen.has(m.method)) {
-        throw new CTSError(`duplicate supported method "${m.method}"`);
-      }
-      seen.add(m.method);
-    }
+    for (const m of this._methods) {}
     // Copy the collected arrays so reusing the builder cannot mutate the built request.
     return new PaymentRequest({
killedBy: PaymentRequestBuilder duplicate supported methods throw at build()
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:866:11
     }
     const seen = new Set<string>();
     for (const m of this._methods) {
-      if (seen.has(m.method)) {
+      if (false) {
         throw new CTSError(`duplicate supported method "${m.method}"`);
       }
killedBy: PaymentRequestBuilder duplicate supported methods throw at build()
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:866:11
     }
     const seen = new Set<string>();
     for (const m of this._methods) {
-      if (seen.has(m.method)) {
+      if (true) {
         throw new CTSError(`duplicate supported method "${m.method}"`);
       }
killedBy: PaymentRequestBuilder builds a full request that round-trips through creqA
statusReason: duplicate supported method "bolt11"

[Killed] CallExpression
src/model/PaymentRequest.ts:869:7
       if (seen.has(m.method)) {
         throw new CTSError(`duplicate supported method "${m.method}"`);
       }
-      seen.add(m.method);
+      ;
     }
     // Copy the collected arrays so reusing the builder cannot mutate the built request.
killedBy: PaymentRequestBuilder duplicate supported methods throw at build()
statusReason: expected [Function] to throw an error

[Killed] ObjectLiteral
src/model/PaymentRequest.ts:872:31
       seen.add(m.method);
     }
     // Copy the collected arrays so reusing the builder cannot mutate the built request.
-    return new PaymentRequest({
-      id: this._id,
-      amount: this._amount,
-      unit: this._unit,
-      mints: this._mints.length ? [...this._mints] : undefined,
-      description: this._description,
-      transport: this._transports.length ? [...this._transports] : undefined,
-      singleUse: this._singleUse,
-      nut10: this._nut10,
-      mintsPreferred: this._mintsPreferred,
-      supportedMethods: this._methods.length ? this._methods : undefined,
-      nutroot: this._nutroot,
-    });
+    return new PaymentRequest({});
   }
 }
killedBy: nutroot (v3) request marking round-trips through creqA, tags and all
statusReason: expected undefined to deeply equal { …(3) }

[Killed] BlockStatement
src/model/PaymentRequest.ts:894:28
  */
 function asLockOptions(
   lock: LockOptions | LockBuilder | P2PKOptions | NutrootOption,
-): LockOptions | undefined {
-  if (typeof (lock as LockBuilder).toOptions === 'function') {
-    return (lock as LockBuilder).toOptions();
-  }
-  if ('kind' in lock || 'receiverKey' in lock) return undefined;
-  return lock as LockOptions;
-}
+): LockOptions | undefined {}
 
 /**
killedBy: PaymentRequestBuilder lock() accepts a LockBuilder and semantic LockOptions directly
statusReason: Unknown lock kind: undefined

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:895:7
 function asLockOptions(
   lock: LockOptions | LockBuilder | P2PKOptions | NutrootOption,
 ): LockOptions | undefined {
-  if (typeof (lock as LockBuilder).toOptions === 'function') {
+  if (true) {
     return (lock as LockBuilder).toOptions();
   }
killedBy: nutroot (v3) request marking round-trips through creqA, tags and all
statusReason: lock.toOptions is not a function

[Killed] EqualityOperator
src/model/PaymentRequest.ts:895:7
 function asLockOptions(
   lock: LockOptions | LockBuilder | P2PKOptions | NutrootOption,
 ): LockOptions | undefined {
-  if (typeof (lock as LockBuilder).toOptions === 'function') {
+  if (typeof (lock as LockBuilder).toOptions !== 'function') {
     return (lock as LockBuilder).toOptions();
   }
killedBy: nutroot (v3) request marking round-trips through creqA, tags and all
statusReason: lock.toOptions is not a function

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:898:7
   if (typeof (lock as LockBuilder).toOptions === 'function') {
     return (lock as LockBuilder).toOptions();
   }
-  if ('kind' in lock || 'receiverKey' in lock) return undefined;
+  if (true) return undefined;
   return lock as LockOptions;
 }
killedBy: PaymentRequestBuilder lock() accepts a LockBuilder and semantic LockOptions directly
statusReason: Unknown lock kind: undefined

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:898:7
   if (typeof (lock as LockBuilder).toOptions === 'function') {
     return (lock as LockBuilder).toOptions();
   }
-  if ('kind' in lock || 'receiverKey' in lock) return undefined;
+  if (false) return undefined;
   return lock as LockOptions;
 }
killedBy: nutroot (v3) request marking round-trips through creqA, tags and all
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/model/PaymentRequest.ts:905:65
 /**
  * Encodes semantic lock options as a wire nutroot request.
  */
-function encodeNutrootRequest(lock: LockOptions): NutrootOption {
-  const { receiverKey, leaves, blindKeys } = lockToNutrootOptions(lock);
-  return {
-    receiverKey,
-    ...(leaves?.length && { leaves: leaves.map((leaf) => serializeNutrootLeafHex(leaf)) }),
-    ...(blindKeys?.length && { blindKeys }),
-  };
-}
+function encodeNutrootRequest(lock: LockOptions): NutrootOption {}
 
 /**
killedBy: PaymentRequestBuilder lock() emits both encodings when both can express the condition
statusReason: expected undefined to be '02a9acc1e48c25eeeb9289b5031cc57da9fe7…' // Object.is equality

[Killed] OptionalChaining
src/model/PaymentRequest.ts:909:9
   const { receiverKey, leaves, blindKeys } = lockToNutrootOptions(lock);
   return {
     receiverKey,
-    ...(leaves?.length && { leaves: leaves.map((leaf) => serializeNutrootLeafHex(leaf)) }),
+    ...(leaves.length && { leaves: leaves.map((leaf) => serializeNutrootLeafHex(leaf)) }),
     ...(blindKeys?.length && { blindKeys }),
   };
killedBy: PaymentRequestBuilder lock() emits both encodings when both can express the condition
statusReason: expected undefined to be '02a9acc1e48c25eeeb9289b5031cc57da9fe7…' // Object.is equality

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:909:9
   const { receiverKey, leaves, blindKeys } = lockToNutrootOptions(lock);
   return {
     receiverKey,
-    ...(leaves?.length && { leaves: leaves.map((leaf) => serializeNutrootLeafHex(leaf)) }),
+    ...(true),
     ...(blindKeys?.length && { blindKeys }),
   };
killedBy: PaymentRequestBuilder lock() accepts a LockBuilder and semantic LockOptions directly
statusReason: A NUMS receiver key requires leaves

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:910:9
   return {
     receiverKey,
     ...(leaves?.length && { leaves: leaves.map((leaf) => serializeNutrootLeafHex(leaf)) }),
-    ...(blindKeys?.length && { blindKeys }),
+    ...(false),
   };
 }
killedBy: PaymentRequestBuilder requestNutroot() accepts semantic LockOptions and serializes the tree
statusReason: expected undefined to deeply equal [ Array(1) ]

[Killed] OptionalChaining
src/model/PaymentRequest.ts:910:9
   return {
     receiverKey,
     ...(leaves?.length && { leaves: leaves.map((leaf) => serializeNutrootLeafHex(leaf)) }),
-    ...(blindKeys?.length && { blindKeys }),
+    ...(blindKeys.length && { blindKeys }),
   };
 }
killedBy: PaymentRequestBuilder lock() emits both encodings when both can express the condition
statusReason: expected undefined to be '02a9acc1e48c25eeeb9289b5031cc57da9fe7…' // Object.is equality
