[Survived] LogicalOperator
src/model/ScriptPath.ts:219:5
 function orderedOutputs(preview: SwapPreview): SerializedBlindedMessage[] {
   return orderOutputsForPayload(
     preview.keepOutputs ?? [],
-    preview.sendOutputs ?? [],
+    preview.sendOutputs && [],
   ).outputData.map((d) => d.blindedMessage);
 }

[Killed] ArrayDeclaration
src/model/ScriptPath.ts:219:28
 function orderedOutputs(preview: SwapPreview): SerializedBlindedMessage[] {
   return orderOutputsForPayload(
     preview.keepOutputs ?? [],
-    preview.sendOutputs ?? [],
+    preview.sendOutputs ?? ["Stryker was here"],
   ).outputData.map((d) => d.blindedMessage);
 }
killedBy: ScriptPath signing packages signs a blinded key at its hinted absolute slot in a later leaf
statusReason: Cannot read properties of undefined (reading 'amount')

[Killed] ArrowFunction
src/model/ScriptPath.ts:220:20
   return orderOutputsForPayload(
     preview.keepOutputs ?? [],
     preview.sendOutputs ?? [],
-  ).outputData.map((d) => d.blindedMessage);
+  ).outputData.map(() => undefined);
 }
 
killedBy: ScriptPath signing packages signs a blinded key at its hinted absolute slot in a later leaf
statusReason: Signing package output 0 is malformed

[Killed] BlockStatement
src/model/ScriptPath.ts:226:29
 function extractSwapPackage(
   preview: SwapPreview,
   plans: ScriptPathPlan[],
-): ScriptPathSigningPackage {
-  return buildPackage('swap', preview.inputs, orderedOutputs(preview), plans);
-}
+): ScriptPathSigningPackage {}
 
 function extractMeltPackage<TQuote extends Pick<MeltQuoteBaseResponse, 'quote' | 'amount'>>(
killedBy: ScriptPath signing packages signs a blinded key at its hinted absolute slot in a later leaf
statusReason: Cannot read properties of undefined (reading 'spends')

[Killed] StringLiteral
src/model/ScriptPath.ts:227:23
   preview: SwapPreview,
   plans: ScriptPathPlan[],
 ): ScriptPathSigningPackage {
-  return buildPackage('swap', preview.inputs, orderedOutputs(preview), plans);
+  return buildPackage("", preview.inputs, orderedOutputs(preview), plans);
 }
 
killedBy: ScriptPath signing packages signs a blinded key at its hinted absolute slot in a later leaf
statusReason: Invalid signing package type

[Killed] BlockStatement
src/model/ScriptPath.ts:233:29
 function extractMeltPackage<TQuote extends Pick<MeltQuoteBaseResponse, 'quote' | 'amount'>>(
   preview: MeltPreview<TQuote>,
   plans: ScriptPathPlan[],
-): ScriptPathSigningPackage {
-  return buildPackage(
-    'melt',
-    preview.inputs,
-    preview.outputData.map((d) => d.blindedMessage),
-    plans,
-    { quoteId: preview.quote.quote, amount: Amount.from(preview.quote.amount).toBigInt() },
-  );
-}
+): ScriptPathSigningPackage {}
 
 function serializePackage(pkg: ScriptPathSigningPackage): string {
killedBy: ScriptPath melt packages the melt quote is part of the signed digest
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] StringLiteral
src/model/ScriptPath.ts:235:5
   plans: ScriptPathPlan[],
 ): ScriptPathSigningPackage {
   return buildPackage(
-    'melt',
+    "",
     preview.inputs,
     preview.outputData.map((d) => d.blindedMessage),
killedBy: ScriptPath melt packages the melt quote is part of the signed digest
statusReason: expected '' to be 'melt' // Object.is equality

[Killed] ArrowFunction
src/model/ScriptPath.ts:237:28
   return buildPackage(
     'melt',
     preview.inputs,
-    preview.outputData.map((d) => d.blindedMessage),
+    preview.outputData.map(() => undefined),
     plans,
     { quoteId: preview.quote.quote, amount: Amount.from(preview.quote.amount).toBigInt() },
killedBy: ScriptPath melt packages the melt quote is part of the signed digest
statusReason: Cannot read properties of undefined (reading 'amount')

[Killed] ObjectLiteral
src/model/ScriptPath.ts:239:5
     preview.inputs,
     preview.outputData.map((d) => d.blindedMessage),
     plans,
-    { quoteId: preview.quote.quote, amount: Amount.from(preview.quote.amount).toBigInt() },
+    {},
   );
 }
killedBy: ScriptPath melt packages the melt quote is part of the signed digest
statusReason: expected undefined to be 'quote-1' // Object.is equality

[Killed] BlockStatement
src/model/ScriptPath.ts:243:66
   );
 }
 
-function serializePackage(pkg: ScriptPathSigningPackage): string {
-  const json = JSONInt.stringify(pkg) ?? '{}';
-  return `${SCRIPT_PATH_PREFIX}${encodeUint8ToBase64Url(utf8ToBytes(json))}`;
-}
+function serializePackage(pkg: ScriptPathSigningPackage): string {}
 
 function deserializePackage(input: string): ScriptPathSigningPackage {
killedBy: ScriptPath signing packages refuses to sign a leaf that is not committed by the input secret
statusReason: expected [Function] to throw error matching /does not commit/ but got 'Cannot read properties of undefined (…'

[Killed] LogicalOperator
src/model/ScriptPath.ts:244:16
 }
 
 function serializePackage(pkg: ScriptPathSigningPackage): string {
-  const json = JSONInt.stringify(pkg) ?? '{}';
+  const json = JSONInt.stringify(pkg) && '{}';
   return `${SCRIPT_PATH_PREFIX}${encodeUint8ToBase64Url(utf8ToBytes(json))}`;
 }
killedBy: ScriptPath signing packages refuses to sign a leaf that is not committed by the input secret
statusReason: expected [Function] to throw error matching /does not commit/ but got 'Invalid signing package version'

[Killed] StringLiteral
src/model/ScriptPath.ts:245:10
 
 function serializePackage(pkg: ScriptPathSigningPackage): string {
   const json = JSONInt.stringify(pkg) ?? '{}';
-  return `${SCRIPT_PATH_PREFIX}${encodeUint8ToBase64Url(utf8ToBytes(json))}`;
+  return ``;
 }
 
killedBy: ScriptPath signing packages refuses to sign a leaf that is not committed by the input secret
statusReason: expected [Function] to throw error matching /does not commit/ but got 'Invalid signing package: must start w…'

[Killed] BlockStatement
src/model/ScriptPath.ts:248:70
   return `${SCRIPT_PATH_PREFIX}${encodeUint8ToBase64Url(utf8ToBytes(json))}`;
 }
 
-function deserializePackage(input: string): ScriptPathSigningPackage {
-  if (!input.startsWith(SCRIPT_PATH_PREFIX)) {
-    throw new CTSError(`Invalid signing package: must start with "${SCRIPT_PATH_PREFIX}"`);
-  }
-  let data: unknown;
-  try {
-    data = JSONInt.parse(
-      bytesToUtf8(decodeBase64UrlToUint8(input.slice(SCRIPT_PATH_PREFIX.length))),
-      undefined,
-      { strict: true },
-    );
-  } catch (e) {
-    throw new CTSError('Failed to parse signing package', { cause: e });
-  }
-  const pkg = data as ScriptPathSigningPackage;
-  assertValidPackage(pkg);
-  return pkg;
-}
+function deserializePackage(input: string): ScriptPathSigningPackage {}
 
 function assertValidPackage(pkg: ScriptPathSigningPackage): void {
killedBy: ScriptPath signing packages refuses to sign a leaf that is not committed by the input secret
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/model/ScriptPath.ts:249:7
 }
 
 function deserializePackage(input: string): ScriptPathSigningPackage {
-  if (!input.startsWith(SCRIPT_PATH_PREFIX)) {
+  if (false) {
     throw new CTSError(`Invalid signing package: must start with "${SCRIPT_PATH_PREFIX}"`);
   }
killedBy: ScriptPath signing packages deserialize fails closed on malformed transport strings
statusReason: expected [Function] to throw error matching /must start with/ but got 'Failed to parse signing package'

[Killed] MethodExpression
src/model/ScriptPath.ts:249:8
 }
 
 function deserializePackage(input: string): ScriptPathSigningPackage {
-  if (!input.startsWith(SCRIPT_PATH_PREFIX)) {
+  if (!input.endsWith(SCRIPT_PATH_PREFIX)) {
     throw new CTSError(`Invalid signing package: must start with "${SCRIPT_PATH_PREFIX}"`);
   }
killedBy: ScriptPath signing packages refuses to sign a leaf that is not committed by the input secret
statusReason: expected [Function] to throw error matching /does not commit/ but got 'Invalid signing package: must start w…'

[Killed] BlockStatement
src/model/ScriptPath.ts:253:7
     throw new CTSError(`Invalid signing package: must start with "${SCRIPT_PATH_PREFIX}"`);
   }
   let data: unknown;
-  try {
-    data = JSONInt.parse(
-      bytesToUtf8(decodeBase64UrlToUint8(input.slice(SCRIPT_PATH_PREFIX.length))),
-      undefined,
-      { strict: true },
-    );
-  } catch (e) {
+  try {} catch (e) {
     throw new CTSError('Failed to parse signing package', { cause: e });
   }
killedBy: ScriptPath signing packages refuses to sign a leaf that is not committed by the input secret
statusReason: expected [Function] to throw error matching /does not commit/ but got 'Invalid signing package version'

[Killed] MethodExpression
src/model/ScriptPath.ts:255:42
   let data: unknown;
   try {
     data = JSONInt.parse(
-      bytesToUtf8(decodeBase64UrlToUint8(input.slice(SCRIPT_PATH_PREFIX.length))),
+      bytesToUtf8(decodeBase64UrlToUint8(input)),
       undefined,
       { strict: true },
killedBy: ScriptPath signing packages refuses to sign a leaf that is not committed by the input secret
statusReason: expected [Function] to throw error matching /does not commit/ but got 'Failed to parse signing package'

[Killed] BooleanLiteral
src/model/ScriptPath.ts:257:17
     data = JSONInt.parse(
       bytesToUtf8(decodeBase64UrlToUint8(input.slice(SCRIPT_PATH_PREFIX.length))),
       undefined,
-      { strict: true },
+      { strict: false },
     );
   } catch (e) {
killedBy: ScriptPath signing packages deserialize fails closed on malformed transport strings
statusReason: expected [Function] to throw error matching /parse/ but got 'Invalid signing package version'

[Killed] BlockStatement
src/model/ScriptPath.ts:259:15
       undefined,
       { strict: true },
     );
-  } catch (e) {
-    throw new CTSError('Failed to parse signing package', { cause: e });
-  }
+  } catch (e) {}
   const pkg = data as ScriptPathSigningPackage;
   assertValidPackage(pkg);
killedBy: ScriptPath signing packages deserialize fails closed on malformed transport strings
statusReason: expected [Function] to throw error matching /parse/ but got 'Invalid signing package version'

[Killed] StringLiteral
src/model/ScriptPath.ts:260:24
       { strict: true },
     );
   } catch (e) {
-    throw new CTSError('Failed to parse signing package', { cause: e });
+    throw new CTSError("", { cause: e });
   }
   const pkg = data as ScriptPathSigningPackage;
killedBy: ScriptPath signing packages deserialize fails closed on malformed transport strings
statusReason: expected [Function] to throw error matching /parse/ but got ''

[Survived] ObjectLiteral
src/model/ScriptPath.ts:260:59
       { strict: true },
     );
   } catch (e) {
-    throw new CTSError('Failed to parse signing package', { cause: e });
+    throw new CTSError('Failed to parse signing package', {});
   }
   const pkg = data as ScriptPathSigningPackage;

[Killed] CallExpression
src/model/ScriptPath.ts:263:3
     throw new CTSError('Failed to parse signing package', { cause: e });
   }
   const pkg = data as ScriptPathSigningPackage;
-  assertValidPackage(pkg);
+  ;
   return pkg;
 }
killedBy: ScriptPath signing packages refuses to sign a leaf that is not committed by the input secret
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/model/ScriptPath.ts:268:78
 }
 
 function assertValidPackage(pkg: ScriptPathSigningPackage): void {
-  if (!pkg || typeof pkg !== 'object' || pkg.version !== SCRIPT_PATH_PREFIX) {
-    throw new CTSError('Invalid signing package version');
-  }
+  if (!pkg || typeof pkg !== 'object' || pkg.version !== SCRIPT_PATH_PREFIX) {}
   if (pkg.type !== 'swap' && pkg.type !== 'melt') {
     throw new CTSError('Invalid signing package type');
killedBy: ScriptPath signing packages deserialize fails closed on malformed transport strings
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/model/ScriptPath.ts:268:42
 }
 
 function assertValidPackage(pkg: ScriptPathSigningPackage): void {
-  if (!pkg || typeof pkg !== 'object' || pkg.version !== SCRIPT_PATH_PREFIX) {
+  if (!pkg || typeof pkg !== 'object' || pkg.version === SCRIPT_PATH_PREFIX) {
     throw new CTSError('Invalid signing package version');
   }
killedBy: ScriptPath signing packages signs a blinded key at its hinted absolute slot in a later leaf
statusReason: Invalid signing package version

[Killed] EqualityOperator
src/model/ScriptPath.ts:271:30
   if (!pkg || typeof pkg !== 'object' || pkg.version !== SCRIPT_PATH_PREFIX) {
     throw new CTSError('Invalid signing package version');
   }
-  if (pkg.type !== 'swap' && pkg.type !== 'melt') {
+  if (pkg.type !== 'swap' && pkg.type === 'melt') {
     throw new CTSError('Invalid signing package type');
   }
killedBy: ScriptPath signing packages deserialize fails closed on malformed transport strings
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/model/ScriptPath.ts:271:7
   if (!pkg || typeof pkg !== 'object' || pkg.version !== SCRIPT_PATH_PREFIX) {
     throw new CTSError('Invalid signing package version');
   }
-  if (pkg.type !== 'swap' && pkg.type !== 'melt') {
+  if (pkg.type === 'swap' && pkg.type !== 'melt') {
     throw new CTSError('Invalid signing package type');
   }
killedBy: ScriptPath signing packages signs a blinded key at its hinted absolute slot in a later leaf
statusReason: Invalid signing package type

[Killed] BooleanLiteral
src/model/ScriptPath.ts:274:7
   if (pkg.type !== 'swap' && pkg.type !== 'melt') {
     throw new CTSError('Invalid signing package type');
   }
-  if (!Array.isArray(pkg.inputs) || !Array.isArray(pkg.outputs) || !Array.isArray(pkg.spends)) {
+  if (Array.isArray(pkg.inputs) || !Array.isArray(pkg.outputs) || !Array.isArray(pkg.spends)) {
     throw new CTSError('Malformed signing package');
   }
killedBy: ScriptPath signing packages signs a blinded key at its hinted absolute slot in a later leaf
statusReason: Malformed signing package

[Killed] BooleanLiteral
src/model/ScriptPath.ts:274:37
   if (pkg.type !== 'swap' && pkg.type !== 'melt') {
     throw new CTSError('Invalid signing package type');
   }
-  if (!Array.isArray(pkg.inputs) || !Array.isArray(pkg.outputs) || !Array.isArray(pkg.spends)) {
+  if (!Array.isArray(pkg.inputs) || Array.isArray(pkg.outputs) || !Array.isArray(pkg.spends)) {
     throw new CTSError('Malformed signing package');
   }
killedBy: ScriptPath signing packages signs a blinded key at its hinted absolute slot in a later leaf
statusReason: Malformed signing package

[Killed] BlockStatement
src/model/ScriptPath.ts:279:50
   }
   // JSONInt flattens Amount to bare integers, so a decoded package must be rehydrated
   // before consumers touch it; digestOf normalizing internally would otherwise mask this.
-  for (const [i, input] of pkg.inputs.entries()) {
-    if (
-      !input ||
-      typeof input !== 'object' ||
-      typeof input.secret !== 'string' ||
-      typeof input.id !== 'string' ||
-      typeof input.C !== 'string'
-    ) {
-      throw new CTSError(`Signing package input ${i} is malformed`);
-    }
-    try {
-      input.amount = Amount.from(input.amount);
-    } catch (e) {
-      throw new CTSError(`Signing package input ${i} amount is invalid`, { cause: e });
-    }
-  }
+  for (const [i, input] of pkg.inputs.entries()) {}
   for (const [i, output] of pkg.outputs.entries()) {
     if (
killedBy: ScriptPath signing packages deserialize rehydrates amounts to their model types
statusReason: expected 1 to be an instance of Amount

[Killed] ConditionalExpression
src/model/ScriptPath.ts:281:7
   // before consumers touch it; digestOf normalizing internally would otherwise mask this.
   for (const [i, input] of pkg.inputs.entries()) {
     if (
-      !input ||
-      typeof input !== 'object' ||
-      typeof input.secret !== 'string' ||
-      typeof input.id !== 'string' ||
-      typeof input.C !== 'string'
+      true
     ) {
       throw new CTSError(`Signing package input ${i} is malformed`);
killedBy: ScriptPath signing packages signs a blinded key at its hinted absolute slot in a later leaf
statusReason: Signing package input 0 is malformed

[Killed] BooleanLiteral
src/model/ScriptPath.ts:281:7
   // before consumers touch it; digestOf normalizing internally would otherwise mask this.
   for (const [i, input] of pkg.inputs.entries()) {
     if (
-      !input ||
+      input ||
       typeof input !== 'object' ||
       typeof input.secret !== 'string' ||
killedBy: ScriptPath signing packages signs a blinded key at its hinted absolute slot in a later leaf
statusReason: Signing package input 0 is malformed

[Killed] EqualityOperator
src/model/ScriptPath.ts:282:7
   for (const [i, input] of pkg.inputs.entries()) {
     if (
       !input ||
-      typeof input !== 'object' ||
+      typeof input === 'object' ||
       typeof input.secret !== 'string' ||
       typeof input.id !== 'string' ||
killedBy: ScriptPath signing packages signs a blinded key at its hinted absolute slot in a later leaf
statusReason: Signing package input 0 is malformed

[Survived] ConditionalExpression
src/model/ScriptPath.ts:282:7
   for (const [i, input] of pkg.inputs.entries()) {
     if (
       !input ||
-      typeof input !== 'object' ||
+      false ||
       typeof input.secret !== 'string' ||
       typeof input.id !== 'string' ||

[Killed] EqualityOperator
src/model/ScriptPath.ts:283:7
     if (
       !input ||
       typeof input !== 'object' ||
-      typeof input.secret !== 'string' ||
+      typeof input.secret === 'string' ||
       typeof input.id !== 'string' ||
       typeof input.C !== 'string'
killedBy: ScriptPath signing packages signs a blinded key at its hinted absolute slot in a later leaf
statusReason: Signing package input 0 is malformed

[Survived] ConditionalExpression
src/model/ScriptPath.ts:283:7
     if (
       !input ||
       typeof input !== 'object' ||
-      typeof input.secret !== 'string' ||
+      false ||
       typeof input.id !== 'string' ||
       typeof input.C !== 'string'

[Killed] EqualityOperator
src/model/ScriptPath.ts:284:7
       !input ||
       typeof input !== 'object' ||
       typeof input.secret !== 'string' ||
-      typeof input.id !== 'string' ||
+      typeof input.id === 'string' ||
       typeof input.C !== 'string'
     ) {
killedBy: ScriptPath signing packages signs a blinded key at its hinted absolute slot in a later leaf
statusReason: Signing package input 0 is malformed

[Survived] ConditionalExpression
src/model/ScriptPath.ts:284:7
       !input ||
       typeof input !== 'object' ||
       typeof input.secret !== 'string' ||
-      typeof input.id !== 'string' ||
+      false ||
       typeof input.C !== 'string'
     ) {

[Killed] EqualityOperator
src/model/ScriptPath.ts:285:7
       typeof input !== 'object' ||
       typeof input.secret !== 'string' ||
       typeof input.id !== 'string' ||
-      typeof input.C !== 'string'
+      typeof input.C === 'string'
     ) {
       throw new CTSError(`Signing package input ${i} is malformed`);
killedBy: ScriptPath signing packages signs a blinded key at its hinted absolute slot in a later leaf
statusReason: Signing package input 0 is malformed

[Survived] ConditionalExpression
src/model/ScriptPath.ts:285:7
       typeof input !== 'object' ||
       typeof input.secret !== 'string' ||
       typeof input.id !== 'string' ||
-      typeof input.C !== 'string'
+      false
     ) {
       throw new CTSError(`Signing package input ${i} is malformed`);

[NoCoverage] BlockStatement
src/model/ScriptPath.ts:286:7
       typeof input.secret !== 'string' ||
       typeof input.id !== 'string' ||
       typeof input.C !== 'string'
-    ) {
-      throw new CTSError(`Signing package input ${i} is malformed`);
-    }
+    ) {}
     try {
       input.amount = Amount.from(input.amount);

[Killed] BlockStatement
src/model/ScriptPath.ts:289:9
     ) {
       throw new CTSError(`Signing package input ${i} is malformed`);
     }
-    try {
-      input.amount = Amount.from(input.amount);
-    } catch (e) {
+    try {} catch (e) {
       throw new CTSError(`Signing package input ${i} amount is invalid`, { cause: e });
     }
killedBy: ScriptPath signing packages deserialize rehydrates amounts to their model types
statusReason: expected 1 to be an instance of Amount

[NoCoverage] BlockStatement
src/model/ScriptPath.ts:291:17
     }
     try {
       input.amount = Amount.from(input.amount);
-    } catch (e) {
-      throw new CTSError(`Signing package input ${i} amount is invalid`, { cause: e });
-    }
+    } catch (e) {}
   }
   for (const [i, output] of pkg.outputs.entries()) {

[Killed] BlockStatement
src/model/ScriptPath.ts:295:52
       throw new CTSError(`Signing package input ${i} amount is invalid`, { cause: e });
     }
   }
-  for (const [i, output] of pkg.outputs.entries()) {
-    if (
-      !output ||
-      typeof output !== 'object' ||
-      typeof output.B_ !== 'string' ||
-      typeof output.id !== 'string'
-    ) {
-      throw new CTSError(`Signing package output ${i} is malformed`);
-    }
-    try {
-      output.amount = Amount.from(output.amount);
-    } catch (e) {
-      throw new CTSError(`Signing package output ${i} amount is invalid`, { cause: e });
-    }
-  }
+  for (const [i, output] of pkg.outputs.entries()) {}
   if (
     pkg.type === 'melt' &&
killedBy: ScriptPath signing packages deserialize rehydrates amounts to their model types
statusReason: expected 1 to be an instance of Amount

[Killed] BooleanLiteral
src/model/ScriptPath.ts:297:7
   }
   for (const [i, output] of pkg.outputs.entries()) {
     if (
-      !output ||
+      output ||
       typeof output !== 'object' ||
       typeof output.B_ !== 'string' ||
killedBy: ScriptPath signing packages signs a blinded key at its hinted absolute slot in a later leaf
statusReason: Signing package output 0 is malformed

[Killed] ConditionalExpression
src/model/ScriptPath.ts:297:7
   }
   for (const [i, output] of pkg.outputs.entries()) {
     if (
-      !output ||
-      typeof output !== 'object' ||
-      typeof output.B_ !== 'string' ||
-      typeof output.id !== 'string'
+      true
     ) {
       throw new CTSError(`Signing package output ${i} is malformed`);
killedBy: ScriptPath signing packages signs a blinded key at its hinted absolute slot in a later leaf
statusReason: Signing package output 0 is malformed

[Killed] EqualityOperator
src/model/ScriptPath.ts:298:7
   for (const [i, output] of pkg.outputs.entries()) {
     if (
       !output ||
-      typeof output !== 'object' ||
+      typeof output === 'object' ||
       typeof output.B_ !== 'string' ||
       typeof output.id !== 'string'
killedBy: ScriptPath signing packages signs a blinded key at its hinted absolute slot in a later leaf
statusReason: Signing package output 0 is malformed

[Survived] ConditionalExpression
src/model/ScriptPath.ts:298:7
   for (const [i, output] of pkg.outputs.entries()) {
     if (
       !output ||
-      typeof output !== 'object' ||
+      false ||
       typeof output.B_ !== 'string' ||
       typeof output.id !== 'string'

[Killed] EqualityOperator
src/model/ScriptPath.ts:299:7
     if (
       !output ||
       typeof output !== 'object' ||
-      typeof output.B_ !== 'string' ||
+      typeof output.B_ === 'string' ||
       typeof output.id !== 'string'
     ) {
killedBy: ScriptPath signing packages signs a blinded key at its hinted absolute slot in a later leaf
statusReason: Signing package output 0 is malformed

[Survived] ConditionalExpression
src/model/ScriptPath.ts:299:7
     if (
       !output ||
       typeof output !== 'object' ||
-      typeof output.B_ !== 'string' ||
+      false ||
       typeof output.id !== 'string'
     ) {

[Killed] EqualityOperator
src/model/ScriptPath.ts:300:7
       !output ||
       typeof output !== 'object' ||
       typeof output.B_ !== 'string' ||
-      typeof output.id !== 'string'
+      typeof output.id === 'string'
     ) {
       throw new CTSError(`Signing package output ${i} is malformed`);
killedBy: ScriptPath signing packages signs a blinded key at its hinted absolute slot in a later leaf
statusReason: Signing package output 0 is malformed

[Survived] ConditionalExpression
src/model/ScriptPath.ts:300:7
       !output ||
       typeof output !== 'object' ||
       typeof output.B_ !== 'string' ||
-      typeof output.id !== 'string'
+      false
     ) {
       throw new CTSError(`Signing package output ${i} is malformed`);

[NoCoverage] BlockStatement
src/model/ScriptPath.ts:301:7
       typeof output !== 'object' ||
       typeof output.B_ !== 'string' ||
       typeof output.id !== 'string'
-    ) {
-      throw new CTSError(`Signing package output ${i} is malformed`);
-    }
+    ) {}
     try {
       output.amount = Amount.from(output.amount);

[Killed] BlockStatement
src/model/ScriptPath.ts:304:9
     ) {
       throw new CTSError(`Signing package output ${i} is malformed`);
     }
-    try {
-      output.amount = Amount.from(output.amount);
-    } catch (e) {
+    try {} catch (e) {
       throw new CTSError(`Signing package output ${i} amount is invalid`, { cause: e });
     }
killedBy: ScriptPath signing packages deserialize rehydrates amounts to their model types
statusReason: expected 1 to be an instance of Amount

[NoCoverage] BlockStatement
src/model/ScriptPath.ts:306:17
     }
     try {
       output.amount = Amount.from(output.amount);
-    } catch (e) {
-      throw new CTSError(`Signing package output ${i} amount is invalid`, { cause: e });
-    }
+    } catch (e) {}
   }
   if (

[Killed] EqualityOperator
src/model/ScriptPath.ts:311:5
     }
   }
   if (
-    pkg.type === 'melt' &&
+    pkg.type !== 'melt' &&
     (typeof pkg.quote !== 'string' || pkg.quote.length === 0 || pkg.quoteAmount === undefined)
   ) {
killedBy: ScriptPath signing packages signs a blinded key at its hinted absolute slot in a later leaf
statusReason: Melt signing package needs a quote and amount

[Killed] LogicalOperator
src/model/ScriptPath.ts:311:5
     }
   }
   if (
-    pkg.type === 'melt' &&
-    (typeof pkg.quote !== 'string' || pkg.quote.length === 0 || pkg.quoteAmount === undefined)
+    pkg.type === 'melt' || typeof pkg.quote !== 'string' || pkg.quote.length === 0 || pkg.quoteAmount === undefined
   ) {
     throw new CTSError('Melt signing package needs a quote and amount');
killedBy: ScriptPath signing packages signs a blinded key at its hinted absolute slot in a later leaf
statusReason: Melt signing package needs a quote and amount

[Killed] LogicalOperator
src/model/ScriptPath.ts:312:6
   }
   if (
     pkg.type === 'melt' &&
-    (typeof pkg.quote !== 'string' || pkg.quote.length === 0 || pkg.quoteAmount === undefined)
+    (typeof pkg.quote !== 'string' && pkg.quote.length === 0 || pkg.quoteAmount === undefined)
   ) {
     throw new CTSError('Melt signing package needs a quote and amount');
killedBy: ScriptPath melt packages a melt package without its quote is rejected
statusReason: expected [Function] to throw error matching /needs a quote and amount/ but got 'Cannot read properties of undefined (…'

[Killed] EqualityOperator
src/model/ScriptPath.ts:312:6
   }
   if (
     pkg.type === 'melt' &&
-    (typeof pkg.quote !== 'string' || pkg.quote.length === 0 || pkg.quoteAmount === undefined)
+    (typeof pkg.quote === 'string' || pkg.quote.length === 0 || pkg.quoteAmount === undefined)
   ) {
     throw new CTSError('Melt signing package needs a quote and amount');
killedBy: ScriptPath melt packages deserialize rehydrates the melt quote amount as bigint
statusReason: Melt signing package needs a quote and amount

[Killed] BlockStatement
src/model/ScriptPath.ts:313:5
   if (
     pkg.type === 'melt' &&
     (typeof pkg.quote !== 'string' || pkg.quote.length === 0 || pkg.quoteAmount === undefined)
-  ) {
-    throw new CTSError('Melt signing package needs a quote and amount');
-  }
+  ) {}
   if (pkg.quoteAmount !== undefined) {
     try {
killedBy: ScriptPath melt packages a melt package without its quote is rejected
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/model/ScriptPath.ts:316:7
   ) {
     throw new CTSError('Melt signing package needs a quote and amount');
   }
-  if (pkg.quoteAmount !== undefined) {
+  if (pkg.quoteAmount === undefined) {
     try {
       pkg.quoteAmount = Amount.from(pkg.quoteAmount).toBigInt();
killedBy: ScriptPath signing packages signs a blinded key at its hinted absolute slot in a later leaf
statusReason: Signing package quote amount is invalid

[Killed] ConditionalExpression
src/model/ScriptPath.ts:316:7
   ) {
     throw new CTSError('Melt signing package needs a quote and amount');
   }
-  if (pkg.quoteAmount !== undefined) {
+  if (true) {
     try {
       pkg.quoteAmount = Amount.from(pkg.quoteAmount).toBigInt();
killedBy: ScriptPath signing packages signs a blinded key at its hinted absolute slot in a later leaf
statusReason: Signing package quote amount is invalid

[Killed] BlockStatement
src/model/ScriptPath.ts:317:9
     throw new CTSError('Melt signing package needs a quote and amount');
   }
   if (pkg.quoteAmount !== undefined) {
-    try {
-      pkg.quoteAmount = Amount.from(pkg.quoteAmount).toBigInt();
-    } catch (e) {
+    try {} catch (e) {
       throw new CTSError('Signing package quote amount is invalid', { cause: e });
     }
killedBy: ScriptPath melt packages deserialize rehydrates the melt quote amount as bigint
statusReason: expected 'number' to be 'bigint' // Object.is equality

[NoCoverage] BlockStatement
src/model/ScriptPath.ts:319:17
   if (pkg.quoteAmount !== undefined) {
     try {
       pkg.quoteAmount = Amount.from(pkg.quoteAmount).toBigInt();
-    } catch (e) {
-      throw new CTSError('Signing package quote amount is invalid', { cause: e });
-    }
+    } catch (e) {}
   }
   const inputSecrets = new Set(pkg.inputs.map((input) => input.secret));
