[Killed] StringLiteral
src/wallet/Wallet.ts:224:19
   public readonly counters: WalletCounters;
   private _keyChain: KeyChain;
   private _seed: Uint8Array | undefined = undefined;
-  private _unit = 'sat';
+  private _unit = "";
   private _mintInfo: MintInfo | undefined = undefined;
   private _denominationTarget = 3;
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/wallet/Wallet.ts:232:36
   private _boundKeysetId: string = PENDING_KEYSET_ID;
   private _pendingRepair: Promise<void> | null = null;
   private _lastRepairAt = 0;
-  private _explicitBind: boolean = false;
+  private _explicitBind: boolean = true;
   private _selectProofs: SelectProofs;
   private _outputDataCreator: OutputDataCreator;
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/wallet/Wallet.ts:236:29
   private _selectProofs: SelectProofs;
   private _outputDataCreator: OutputDataCreator;
   private _hashToCurve: (secret: string, keysetId: string) => string;
-  private _requireSigDleq = false;
+  private _requireSigDleq = true;
   private _strictCachedKeysets: boolean = false;
   private _logger: Logger;
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/wallet/Wallet.ts:237:43
   private _outputDataCreator: OutputDataCreator;
   private _hashToCurve: (secret: string, keysetId: string) => string;
   private _requireSigDleq = false;
-  private _strictCachedKeysets: boolean = false;
+  private _strictCachedKeysets: boolean = true;
   private _logger: Logger;
 
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] LogicalOperator
src/wallet/Wallet.ts:316:20
   ) {
     this.ops = new WalletOps(this);
     this.on = new WalletEvents(this);
-    this._logger = options?.logger ?? NULL_LOGGER; // init early (seed can throw)
+    this._logger = options?.logger && NULL_LOGGER; // init early (seed can throw)
     this._selectProofs = options?.selectProofs ?? selectProofsRotating; // vital
     this._outputDataCreator = options?.outputDataCreator ?? new DefaultOutputDataCreator();
killedBy: wallet.maxSpendableAfterFees returns total minus feeReserve when input fees are zero
statusReason: Cannot read properties of undefined (reading 'debug')

[Killed] OptionalChaining
src/wallet/Wallet.ts:316:20
   ) {
     this.ops = new WalletOps(this);
     this.on = new WalletEvents(this);
-    this._logger = options?.logger ?? NULL_LOGGER; // init early (seed can throw)
+    this._logger = options.logger ?? NULL_LOGGER; // init early (seed can throw)
     this._selectProofs = options?.selectProofs ?? selectProofsRotating; // vital
     this._outputDataCreator = options?.outputDataCreator ?? new DefaultOutputDataCreator();
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] LogicalOperator
src/wallet/Wallet.ts:317:26
     this.ops = new WalletOps(this);
     this.on = new WalletEvents(this);
     this._logger = options?.logger ?? NULL_LOGGER; // init early (seed can throw)
-    this._selectProofs = options?.selectProofs ?? selectProofsRotating; // vital
+    this._selectProofs = options?.selectProofs && selectProofsRotating; // vital
     this._outputDataCreator = options?.outputDataCreator ?? new DefaultOutputDataCreator();
     this._hashToCurve = options?.hashToCurve ?? hashToCurveHex;
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] OptionalChaining
src/wallet/Wallet.ts:317:26
     this.ops = new WalletOps(this);
     this.on = new WalletEvents(this);
     this._logger = options?.logger ?? NULL_LOGGER; // init early (seed can throw)
-    this._selectProofs = options?.selectProofs ?? selectProofsRotating; // vital
+    this._selectProofs = options.selectProofs ?? selectProofsRotating; // vital
     this._outputDataCreator = options?.outputDataCreator ?? new DefaultOutputDataCreator();
     this._hashToCurve = options?.hashToCurve ?? hashToCurveHex;
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] LogicalOperator
src/wallet/Wallet.ts:318:31
     this.on = new WalletEvents(this);
     this._logger = options?.logger ?? NULL_LOGGER; // init early (seed can throw)
     this._selectProofs = options?.selectProofs ?? selectProofsRotating; // vital
-    this._outputDataCreator = options?.outputDataCreator ?? new DefaultOutputDataCreator();
+    this._outputDataCreator = options?.outputDataCreator && new DefaultOutputDataCreator();
     this._hashToCurve = options?.hashToCurve ?? hashToCurveHex;
     this.mint =
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] OptionalChaining
src/wallet/Wallet.ts:318:31
     this.on = new WalletEvents(this);
     this._logger = options?.logger ?? NULL_LOGGER; // init early (seed can throw)
     this._selectProofs = options?.selectProofs ?? selectProofsRotating; // vital
-    this._outputDataCreator = options?.outputDataCreator ?? new DefaultOutputDataCreator();
+    this._outputDataCreator = options.outputDataCreator ?? new DefaultOutputDataCreator();
     this._hashToCurve = options?.hashToCurve ?? hashToCurveHex;
     this.mint =
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] LogicalOperator
src/wallet/Wallet.ts:319:25
     this._logger = options?.logger ?? NULL_LOGGER; // init early (seed can throw)
     this._selectProofs = options?.selectProofs ?? selectProofsRotating; // vital
     this._outputDataCreator = options?.outputDataCreator ?? new DefaultOutputDataCreator();
-    this._hashToCurve = options?.hashToCurve ?? hashToCurveHex;
+    this._hashToCurve = options?.hashToCurve && hashToCurveHex;
     this.mint =
       typeof mint === 'string'
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] OptionalChaining
src/wallet/Wallet.ts:319:25
     this._logger = options?.logger ?? NULL_LOGGER; // init early (seed can throw)
     this._selectProofs = options?.selectProofs ?? selectProofsRotating; // vital
     this._outputDataCreator = options?.outputDataCreator ?? new DefaultOutputDataCreator();
-    this._hashToCurve = options?.hashToCurve ?? hashToCurveHex;
+    this._hashToCurve = options.hashToCurve ?? hashToCurveHex;
     this.mint =
       typeof mint === 'string'
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/wallet/Wallet.ts:321:7
     this._outputDataCreator = options?.outputDataCreator ?? new DefaultOutputDataCreator();
     this._hashToCurve = options?.hashToCurve ?? hashToCurveHex;
     this.mint =
-      typeof mint === 'string'
+      false
         ? new Mint(mint, {
             authProvider: options?.authProvider,
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/wallet/Wallet.ts:321:7
     this._outputDataCreator = options?.outputDataCreator ?? new DefaultOutputDataCreator();
     this._hashToCurve = options?.hashToCurve ?? hashToCurveHex;
     this.mint =
-      typeof mint === 'string'
+      true
         ? new Mint(mint, {
             authProvider: options?.authProvider,
killedBy: wallet.maxSpendableAfterFees returns total minus feeReserve when input fees are zero
statusReason: Invalid mint URL: [object Object]

[Killed] OptionalChaining
src/wallet/Wallet.ts:323:27
     this.mint =
       typeof mint === 'string'
         ? new Mint(mint, {
-            authProvider: options?.authProvider,
+            authProvider: options.authProvider,
             customRequest: options?.customRequest,
             requestFetch: options?.requestFetch,
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] OptionalChaining
src/wallet/Wallet.ts:324:28
       typeof mint === 'string'
         ? new Mint(mint, {
             authProvider: options?.authProvider,
-            customRequest: options?.customRequest,
+            customRequest: options.customRequest,
             requestFetch: options?.requestFetch,
             logger: this._logger,
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] OptionalChaining
src/wallet/Wallet.ts:325:27
         ? new Mint(mint, {
             authProvider: options?.authProvider,
             customRequest: options?.customRequest,
-            requestFetch: options?.requestFetch,
+            requestFetch: options.requestFetch,
             logger: this._logger,
           })
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] OptionalChaining
src/wallet/Wallet.ts:329:18
             logger: this._logger,
           })
         : mint;
-    this._unit = options?.unit ?? this._unit;
+    this._unit = options.unit ?? this._unit;
     this._boundKeysetId = options?.keysetId ?? this._boundKeysetId;
     this._explicitBind = options?.keysetId !== undefined;
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] LogicalOperator
src/wallet/Wallet.ts:329:18
             logger: this._logger,
           })
         : mint;
-    this._unit = options?.unit ?? this._unit;
+    this._unit = options?.unit && this._unit;
     this._boundKeysetId = options?.keysetId ?? this._boundKeysetId;
     this._explicitBind = options?.keysetId !== undefined;
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] OptionalChaining
src/wallet/Wallet.ts:330:27
           })
         : mint;
     this._unit = options?.unit ?? this._unit;
-    this._boundKeysetId = options?.keysetId ?? this._boundKeysetId;
+    this._boundKeysetId = options.keysetId ?? this._boundKeysetId;
     this._explicitBind = options?.keysetId !== undefined;
     if (options?.bip39seed) {
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] LogicalOperator
src/wallet/Wallet.ts:330:27
           })
         : mint;
     this._unit = options?.unit ?? this._unit;
-    this._boundKeysetId = options?.keysetId ?? this._boundKeysetId;
+    this._boundKeysetId = options?.keysetId && this._boundKeysetId;
     this._explicitBind = options?.keysetId !== undefined;
     if (options?.bip39seed) {
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] EqualityOperator
src/wallet/Wallet.ts:331:26
         : mint;
     this._unit = options?.unit ?? this._unit;
     this._boundKeysetId = options?.keysetId ?? this._boundKeysetId;
-    this._explicitBind = options?.keysetId !== undefined;
+    this._explicitBind = options?.keysetId === undefined;
     if (options?.bip39seed) {
       // failIf forwards this context to the logger, so pass the type, never the seed.
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/wallet/Wallet.ts:331:26
         : mint;
     this._unit = options?.unit ?? this._unit;
     this._boundKeysetId = options?.keysetId ?? this._boundKeysetId;
-    this._explicitBind = options?.keysetId !== undefined;
+    this._explicitBind = true;
     if (options?.bip39seed) {
       // failIf forwards this context to the logger, so pass the type, never the seed.
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] OptionalChaining
src/wallet/Wallet.ts:332:9
     this._unit = options?.unit ?? this._unit;
     this._boundKeysetId = options?.keysetId ?? this._boundKeysetId;
     this._explicitBind = options?.keysetId !== undefined;
-    if (options?.bip39seed) {
+    if (options.bip39seed) {
       // failIf forwards this context to the logger, so pass the type, never the seed.
       this.failIf(
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/wallet/Wallet.ts:332:9
     this._unit = options?.unit ?? this._unit;
     this._boundKeysetId = options?.keysetId ?? this._boundKeysetId;
     this._explicitBind = options?.keysetId !== undefined;
-    if (options?.bip39seed) {
+    if (true) {
       // failIf forwards this context to the logger, so pass the type, never the seed.
       this.failIf(
killedBy: wallet.maxSpendableAfterFees returns total minus feeReserve when input fees are zero
statusReason: bip39seed must be a valid Uint8Array

[Killed] BooleanLiteral
src/wallet/Wallet.ts:335:9
     if (options?.bip39seed) {
       // failIf forwards this context to the logger, so pass the type, never the seed.
       this.failIf(
-        !(options.bip39seed instanceof Uint8Array),
+        options.bip39seed instanceof Uint8Array,
         'bip39seed must be a valid Uint8Array',
         { received: typeof options.bip39seed },
killedBy: send send with deterministic keep/send auto-offsets counters and fees
statusReason: bip39seed must be a valid Uint8Array

[Killed] ConditionalExpression
src/wallet/Wallet.ts:342:9
       // Fail here rather than at the first derivation: a wallet on a seed NUT-13 will refuse is
       // broken, and the deriver's own guard would surface it mid-operation.
       this.failIf(
-        options.bip39seed.length !== SEED_BYTES,
+        false,
         `bip39seed must be ${SEED_BYTES} bytes`,
         { length: options.bip39seed.length },
killedBy: constructor mutants rejects a bip39seed that is not 64 bytes
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/wallet/Wallet.ts:342:9
       // Fail here rather than at the first derivation: a wallet on a seed NUT-13 will refuse is
       // broken, and the deriver's own guard would surface it mid-operation.
       this.failIf(
-        options.bip39seed.length !== SEED_BYTES,
+        options.bip39seed.length === SEED_BYTES,
         `bip39seed must be ${SEED_BYTES} bytes`,
         { length: options.bip39seed.length },
killedBy: send send with deterministic keep/send auto-offsets counters and fees
statusReason: bip39seed must be 64 bytes

[Killed] StringLiteral
src/wallet/Wallet.ts:343:9
       // broken, and the deriver's own guard would surface it mid-operation.
       this.failIf(
         options.bip39seed.length !== SEED_BYTES,
-        `bip39seed must be ${SEED_BYTES} bytes`,
+        ``,
         { length: options.bip39seed.length },
       );
killedBy: constructor mutants rejects a bip39seed that is not 64 bytes
statusReason: expected [Function] to throw error matching /bip39seed must be 64 bytes/ but got ''

[Survived] ObjectLiteral
src/wallet/Wallet.ts:344:9
       this.failIf(
         options.bip39seed.length !== SEED_BYTES,
         `bip39seed must be ${SEED_BYTES} bytes`,
-        { length: options.bip39seed.length },
+        {},
       );
       this._seed = options.bip39seed;

[Killed] LogicalOperator
src/wallet/Wallet.ts:348:27
       );
       this._seed = options.bip39seed;
     }
-    this._secretsPolicy = options?.secretsPolicy ?? this._secretsPolicy;
+    this._secretsPolicy = options?.secretsPolicy && this._secretsPolicy;
     if (options?.counterSource) {
       this._counterSource = options.counterSource;
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] OptionalChaining
src/wallet/Wallet.ts:348:27
       );
       this._seed = options.bip39seed;
     }
-    this._secretsPolicy = options?.secretsPolicy ?? this._secretsPolicy;
+    this._secretsPolicy = options.secretsPolicy ?? this._secretsPolicy;
     if (options?.counterSource) {
       this._counterSource = options.counterSource;
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/wallet/Wallet.ts:349:9
       this._seed = options.bip39seed;
     }
     this._secretsPolicy = options?.secretsPolicy ?? this._secretsPolicy;
-    if (options?.counterSource) {
+    if (false) {
       this._counterSource = options.counterSource;
     } else {
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/wallet/Wallet.ts:349:33
       this._seed = options.bip39seed;
     }
     this._secretsPolicy = options?.secretsPolicy ?? this._secretsPolicy;
-    if (options?.counterSource) {
-      this._counterSource = options.counterSource;
-    } else {
+    if (options?.counterSource) {} else {
       this._counterSource = new EphemeralCounterSource(options?.counterInit);
     }
killedBy: send a manual counter already handed out is rejected, not silently reused
statusReason: Cannot read properties of undefined (reading 'reserve')

[Killed] BlockStatement
src/wallet/Wallet.ts:351:12
     this._secretsPolicy = options?.secretsPolicy ?? this._secretsPolicy;
     if (options?.counterSource) {
       this._counterSource = options.counterSource;
-    } else {
-      this._counterSource = new EphemeralCounterSource(options?.counterInit);
-    }
+    } else {}
     this.counters = new WalletCounters(this._counterSource);
     this._keyChain = new KeyChain(this.mint, this._unit);
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] OptionalChaining
src/wallet/Wallet.ts:352:56
     if (options?.counterSource) {
       this._counterSource = options.counterSource;
     } else {
-      this._counterSource = new EphemeralCounterSource(options?.counterInit);
+      this._counterSource = new EphemeralCounterSource(options.counterInit);
     }
     this.counters = new WalletCounters(this._counterSource);
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] LogicalOperator
src/wallet/Wallet.ts:356:32
     }
     this.counters = new WalletCounters(this._counterSource);
     this._keyChain = new KeyChain(this.mint, this._unit);
-    this._denominationTarget = options?.denominationTarget ?? this._denominationTarget;
+    this._denominationTarget = options?.denominationTarget && this._denominationTarget;
     this._requireSigDleq = options?.requireSigDleq ?? this._requireSigDleq;
     this._strictCachedKeysets = options?.strictCachedKeysets ?? this._strictCachedKeysets;
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] OptionalChaining
src/wallet/Wallet.ts:356:32
     }
     this.counters = new WalletCounters(this._counterSource);
     this._keyChain = new KeyChain(this.mint, this._unit);
-    this._denominationTarget = options?.denominationTarget ?? this._denominationTarget;
+    this._denominationTarget = options.denominationTarget ?? this._denominationTarget;
     this._requireSigDleq = options?.requireSigDleq ?? this._requireSigDleq;
     this._strictCachedKeysets = options?.strictCachedKeysets ?? this._strictCachedKeysets;
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] LogicalOperator
src/wallet/Wallet.ts:357:28
     this.counters = new WalletCounters(this._counterSource);
     this._keyChain = new KeyChain(this.mint, this._unit);
     this._denominationTarget = options?.denominationTarget ?? this._denominationTarget;
-    this._requireSigDleq = options?.requireSigDleq ?? this._requireSigDleq;
+    this._requireSigDleq = options?.requireSigDleq && this._requireSigDleq;
     this._strictCachedKeysets = options?.strictCachedKeysets ?? this._strictCachedKeysets;
   }
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] OptionalChaining
src/wallet/Wallet.ts:357:28
     this.counters = new WalletCounters(this._counterSource);
     this._keyChain = new KeyChain(this.mint, this._unit);
     this._denominationTarget = options?.denominationTarget ?? this._denominationTarget;
-    this._requireSigDleq = options?.requireSigDleq ?? this._requireSigDleq;
+    this._requireSigDleq = options.requireSigDleq ?? this._requireSigDleq;
     this._strictCachedKeysets = options?.strictCachedKeysets ?? this._strictCachedKeysets;
   }
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] OptionalChaining
src/wallet/Wallet.ts:358:33
     this._keyChain = new KeyChain(this.mint, this._unit);
     this._denominationTarget = options?.denominationTarget ?? this._denominationTarget;
     this._requireSigDleq = options?.requireSigDleq ?? this._requireSigDleq;
-    this._strictCachedKeysets = options?.strictCachedKeysets ?? this._strictCachedKeysets;
+    this._strictCachedKeysets = options.strictCachedKeysets ?? this._strictCachedKeysets;
   }
 
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] LogicalOperator
src/wallet/Wallet.ts:358:33
     this._keyChain = new KeyChain(this.mint, this._unit);
     this._denominationTarget = options?.denominationTarget ?? this._denominationTarget;
     this._requireSigDleq = options?.requireSigDleq ?? this._requireSigDleq;
-    this._strictCachedKeysets = options?.strictCachedKeysets ?? this._strictCachedKeysets;
+    this._strictCachedKeysets = options?.strictCachedKeysets && this._strictCachedKeysets;
   }
 
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/wallet/Wallet.ts:362:75
   }
 
   // Convenience wrappers for "log and throw"
-  private fail(message: string, context?: Record<string, unknown>): never {
-    return fail(message, this._logger, context);
-  }
+  private fail(message: string, context?: Record<string, unknown>): never {}
   private failIf(
     condition: boolean,
killedBy: createMintQuoteBolt11 mutants rejects a description when the mint does not advertise bolt11 description support
statusReason: promise resolved "{ quote: 'q-nodesc', …(10) }" instead of rejecting

[Killed] BlockStatement
src/wallet/Wallet.ts:369:33
     condition: boolean,
     message: string,
     context?: Record<string, unknown>,
-  ): asserts condition is false {
-    return failIf(condition, message, this._logger, context);
-  }
+  ): asserts condition is false {}
   private failIfNullish<T>(
     value: T,
killedBy: sendOffline witness normalization throws when no offline selection matches, rather than returning an empty send
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/wallet/Wallet.ts:376:52
     value: T,
     message: string,
     context?: Record<string, unknown>,
-  ): asserts value is Exclude<T, null | undefined> {
-    return failIfNullish(value, message, this._logger, context);
-  }
+  ): asserts value is Exclude<T, null | undefined> {}
   private requireSupport(op: 'mint' | 'melt', method: string): void {
     this.failIf(
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/wallet/Wallet.ts:379:69
   ): asserts value is Exclude<T, null | undefined> {
     return failIfNullish(value, message, this._logger, context);
   }
-  private requireSupport(op: 'mint' | 'melt', method: string): void {
-    this.failIf(
-      !this.getMintInfo().supportsMintMeltMethod(op, method, this._unit),
-      `Mint does not support ${method} ${op} for unit '${this._unit}'`,
-    );
-  }
+  private requireSupport(op: 'mint' | 'melt', method: string): void {}
   private safeCallback<T>(
     cb: ((p: T) => void) | undefined,
killedBy: generic mint/melt methods wallet.createMintQuote / checkMintQuote createMintQuoteOnchain throws when mint does not advertise onchain support
statusReason: expected [Function] to throw error including 'Mint does not support onchain mint fo…' but got 'createMintQuoteOnchain: no active key…'
