[Killed] BlockStatement
src/wallet/Wallet.ts:595:41
    * @returns The resolved `Keyset`.
    * @throws If the keyset is not found, has no keys, or its unit differs from the wallet.
    */
-  public getKeyset(id?: string): Keyset {
-    const keyset = this._keyChain.getKeyset(id ?? this.keysetId);
-    this.failIf(keyset.unit !== this._unit, 'Keyset unit does not match wallet unit', {
-      keyset: keyset.id,
-      unit: keyset.unit,
-      walletUnit: this._unit,
-    });
-    this.failIf(!keyset.hasKeys, 'Keyset has no keys loaded', { keyset: keyset.id });
-    return keyset;
-  }
+  public getKeyset(id?: string): Keyset {}
 
   /**
killedBy: Restoring deterministic proofs a range signed only at zero value counts as used but yields no proofs
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] LogicalOperator
src/wallet/Wallet.ts:596:45
    * @throws If the keyset is not found, has no keys, or its unit differs from the wallet.
    */
   public getKeyset(id?: string): Keyset {
-    const keyset = this._keyChain.getKeyset(id ?? this.keysetId);
+    const keyset = this._keyChain.getKeyset(id && this.keysetId);
     this.failIf(keyset.unit !== this._unit, 'Keyset unit does not match wallet unit', {
       keyset: keyset.id,
killedBy: restore unblinds restore signatures with the keyset they name and skips zero-value ones
statusReason: Mint signature keyset id 009a1f293253e41e does not match keys for 00bd033559de27d0

[Killed] EqualityOperator
src/wallet/Wallet.ts:597:17
    */
   public getKeyset(id?: string): Keyset {
     const keyset = this._keyChain.getKeyset(id ?? this.keysetId);
-    this.failIf(keyset.unit !== this._unit, 'Keyset unit does not match wallet unit', {
+    this.failIf(keyset.unit === this._unit, 'Keyset unit does not match wallet unit', {
       keyset: keyset.id,
       unit: keyset.unit,
killedBy: Restoring deterministic proofs a range signed only at zero value counts as used but yields no proofs
statusReason: Keyset unit does not match wallet unit

[Killed] ConditionalExpression
src/wallet/Wallet.ts:597:17
    */
   public getKeyset(id?: string): Keyset {
     const keyset = this._keyChain.getKeyset(id ?? this.keysetId);
-    this.failIf(keyset.unit !== this._unit, 'Keyset unit does not match wallet unit', {
+    this.failIf(true, 'Keyset unit does not match wallet unit', {
       keyset: keyset.id,
       unit: keyset.unit,
killedBy: Restoring deterministic proofs a range signed only at zero value counts as used but yields no proofs
statusReason: Keyset unit does not match wallet unit

[Killed] BooleanLiteral
src/wallet/Wallet.ts:602:17
       unit: keyset.unit,
       walletUnit: this._unit,
     });
-    this.failIf(!keyset.hasKeys, 'Keyset has no keys loaded', { keyset: keyset.id });
+    this.failIf(keyset.hasKeys, 'Keyset has no keys loaded', { keyset: keyset.id });
     return keyset;
   }
killedBy: wallet.getFeesToInclude returns zero when the keyset charges no input fees
statusReason: Keyset has no keys loaded

[Killed] StringLiteral
src/wallet/Wallet.ts:602:34
       unit: keyset.unit,
       walletUnit: this._unit,
     });
-    this.failIf(!keyset.hasKeys, 'Keyset has no keys loaded', { keyset: keyset.id });
+    this.failIf(!keyset.hasKeys, "", { keyset: keyset.id });
     return keyset;
   }
killedBy: wallet.getFeesToInclude fails fast instead of hanging when input_fee_ppk is degenerately large
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/wallet/Wallet.ts:621:48
    * @returns The resolved `Keyset`.
    * @throws If the keyset fails `getKeyset` validation, has a legacy (non-hex) id, or is inactive.
    */
-  private getOutputKeyset(id?: string): Keyset {
-    const keyset = this.getKeyset(id);
-    this.failIf(!keyset.hasHexId, 'Legacy keyset cannot be used to create new proofs', {
-      keyset: keyset.id,
-    });
-    this.failIf(!keyset.isActive, 'Inactive keyset cannot be used to create new proofs', {
-      keyset: keyset.id,
-    });
-    return keyset;
-  }
+  private getOutputKeyset(id?: string): Keyset {}
 
   /**
killedBy: requestTokens test requestTokens
statusReason: Cannot read properties of undefined (reading 'keys')

[Killed] BooleanLiteral
src/wallet/Wallet.ts:623:17
    */
   private getOutputKeyset(id?: string): Keyset {
     const keyset = this.getKeyset(id);
-    this.failIf(!keyset.hasHexId, 'Legacy keyset cannot be used to create new proofs', {
+    this.failIf(keyset.hasHexId, 'Legacy keyset cannot be used to create new proofs', {
       keyset: keyset.id,
     });
killedBy: requestTokens test requestTokens
statusReason: Legacy keyset cannot be used to create new proofs

[Killed] StringLiteral
src/wallet/Wallet.ts:623:35
    */
   private getOutputKeyset(id?: string): Keyset {
     const keyset = this.getKeyset(id);
-    this.failIf(!keyset.hasHexId, 'Legacy keyset cannot be used to create new proofs', {
+    this.failIf(!keyset.hasHexId, "", {
       keyset: keyset.id,
     });
killedBy: Legacy (pre-v1) keyset output gating prepareMint refuses to create proofs on a legacy keyset
statusReason: expected [Function] to throw error matching /legacy keyset/i but got ''

[Killed] BooleanLiteral
src/wallet/Wallet.ts:626:17
     this.failIf(!keyset.hasHexId, 'Legacy keyset cannot be used to create new proofs', {
       keyset: keyset.id,
     });
-    this.failIf(!keyset.isActive, 'Inactive keyset cannot be used to create new proofs', {
+    this.failIf(keyset.isActive, 'Inactive keyset cannot be used to create new proofs', {
       keyset: keyset.id,
     });
killedBy: receive across a rotation receives a pre-rotation token by loading the old keys once
statusReason: Inactive keyset cannot be used to create new proofs

[Killed] StringLiteral
src/wallet/Wallet.ts:626:35
     this.failIf(!keyset.hasHexId, 'Legacy keyset cannot be used to create new proofs', {
       keyset: keyset.id,
     });
-    this.failIf(!keyset.isActive, 'Inactive keyset cannot be used to create new proofs', {
+    this.failIf(!keyset.isActive, "", {
       keyset: keyset.id,
     });
killedBy: custom outputs on a keyset other than the wallet default rejects a custom plan on an inactive keyset before calling the mint
statusReason: expected [Function] to throw error matching /Inactive keyset/ but got ''

[Killed] BlockStatement
src/wallet/Wallet.ts:639:69
    * Chosen from the outputs, not the wallet keyset: custom data may name another. NUT-04 requires
    * every output of a v3 mint request to share one keyset.
    */
-  private mintsOntoV3(outputs: SerializedBlindedMessage[]): boolean {
-    const v3 = outputs.some((o) => isBlsKeyset(o.id));
-    this.failIf(
-      v3 && new Set(outputs.map((o) => o.id)).size > 1,
-      'Outputs on a v3 keyset must all share that keyset (NUT-04)',
-    );
-    return v3;
-  }
+  private mintsOntoV3(outputs: SerializedBlindedMessage[]): boolean {}
 
   /**
killedBy: requestTokens prepareMint signs a locked quote through a sign callback a v3 quote hands the signer the tagged message and its container
statusReason: expected undefined to be defined

[Killed] MethodExpression
src/wallet/Wallet.ts:640:16
    * every output of a v3 mint request to share one keyset.
    */
   private mintsOntoV3(outputs: SerializedBlindedMessage[]): boolean {
-    const v3 = outputs.some((o) => isBlsKeyset(o.id));
+    const v3 = outputs.every(o => isBlsKeyset(o.id));
     this.failIf(
       v3 && new Set(outputs.map((o) => o.id)).size > 1,
killedBy: requestTokens prepareMint signs a locked quote through a sign callback a mint plan mixing a v3 output with another keyset is rejected before the request is built
statusReason: promise resolved "{ method: 'bolt11', …(4) }" instead of rejecting

[Killed] ArrowFunction
src/wallet/Wallet.ts:640:29
    * every output of a v3 mint request to share one keyset.
    */
   private mintsOntoV3(outputs: SerializedBlindedMessage[]): boolean {
-    const v3 = outputs.some((o) => isBlsKeyset(o.id));
+    const v3 = outputs.some(() => undefined);
     this.failIf(
       v3 && new Set(outputs.map((o) => o.id)).size > 1,
killedBy: requestTokens prepareMint signs a locked quote through a sign callback a v3 quote hands the signer the tagged message and its container
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/wallet/Wallet.ts:642:13
   private mintsOntoV3(outputs: SerializedBlindedMessage[]): boolean {
     const v3 = outputs.some((o) => isBlsKeyset(o.id));
     this.failIf(
-      v3 && new Set(outputs.map((o) => o.id)).size > 1,
+      v3 && true,
       'Outputs on a v3 keyset must all share that keyset (NUT-04)',
     );
killedBy: requestTokens prepareMint signs a locked quote through a sign callback a v3 quote hands the signer the tagged message and its container
statusReason: Outputs on a v3 keyset must all share that keyset (NUT-04)

[Killed] ArrowFunction
src/wallet/Wallet.ts:642:33
   private mintsOntoV3(outputs: SerializedBlindedMessage[]): boolean {
     const v3 = outputs.some((o) => isBlsKeyset(o.id));
     this.failIf(
-      v3 && new Set(outputs.map((o) => o.id)).size > 1,
+      v3 && new Set(outputs.map(() => undefined)).size > 1,
       'Outputs on a v3 keyset must all share that keyset (NUT-04)',
     );
killedBy: requestTokens prepareMint signs a locked quote through a sign callback a mint plan mixing a v3 output with another keyset is rejected before the request is built
statusReason: promise resolved "{ method: 'bolt11', …(4) }" instead of rejecting

[Killed] StringLiteral
src/wallet/Wallet.ts:643:7
     const v3 = outputs.some((o) => isBlsKeyset(o.id));
     this.failIf(
       v3 && new Set(outputs.map((o) => o.id)).size > 1,
-      'Outputs on a v3 keyset must all share that keyset (NUT-04)',
+      "",
     );
     return v3;
killedBy: requestTokens prepareMint signs a locked quote through a sign callback a mint plan mixing a v3 output with another keyset is rejected before the request is built
statusReason: expected [Function] to throw error matching /share that keyset/ but got ''

[Killed] BlockStatement
src/wallet/Wallet.ts:662:85
    * @throws {@link CTSError} If the wallet has never loaded mint info, or if several key fetches
    *   fail, with the individual failures as `cause`. A lone failure is rethrown as-is.
    */
-  public async ensureOperableKeysets(ids: Array<string | undefined>): Promise<void> {
-    this.failIf(!Array.isArray(ids), 'ensureOperableKeysets: ids must be an array');
-    this.failIf(
-      !this._mintInfo,
-      'Mint info not initialized; call loadMint or loadMintFromCache first',
-    );
-    return this._ensureOperableKeysets(ids, { implicit: false });
-  }
+  public async ensureOperableKeysets(ids: Array<string | undefined>): Promise<void> {}
 
   /**
killedBy: receive across a rotation a never-loaded wallet rejects honestly, without a hidden repair
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
src/wallet/Wallet.ts:663:17
    *   fail, with the individual failures as `cause`. A lone failure is rethrown as-is.
    */
   public async ensureOperableKeysets(ids: Array<string | undefined>): Promise<void> {
-    this.failIf(!Array.isArray(ids), 'ensureOperableKeysets: ids must be an array');
+    this.failIf(Array.isArray(ids), 'ensureOperableKeysets: ids must be an array');
     this.failIf(
       !this._mintInfo,
killedBy: receive across a rotation a never-loaded wallet rejects honestly, without a hidden repair
statusReason: expected [Function] to throw error matching /Mint info not initialized; call loadM…/ but got 'ensureOperableKeysets: ids must be an…'

[Killed] StringLiteral
src/wallet/Wallet.ts:663:38
    *   fail, with the individual failures as `cause`. A lone failure is rethrown as-is.
    */
   public async ensureOperableKeysets(ids: Array<string | undefined>): Promise<void> {
-    this.failIf(!Array.isArray(ids), 'ensureOperableKeysets: ids must be an array');
+    this.failIf(!Array.isArray(ids), "");
     this.failIf(
       !this._mintInfo,
killedBy: public ensureOperableKeysets rejects a non-array argument
statusReason: expected [Function] to throw error matching /must be an array/ but got ''

[Killed] BooleanLiteral
src/wallet/Wallet.ts:665:7
   public async ensureOperableKeysets(ids: Array<string | undefined>): Promise<void> {
     this.failIf(!Array.isArray(ids), 'ensureOperableKeysets: ids must be an array');
     this.failIf(
-      !this._mintInfo,
+      this._mintInfo,
       'Mint info not initialized; call loadMint or loadMintFromCache first',
     );
killedBy: receive across a rotation a never-loaded wallet rejects honestly, without a hidden repair
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
src/wallet/Wallet.ts:666:7
     this.failIf(!Array.isArray(ids), 'ensureOperableKeysets: ids must be an array');
     this.failIf(
       !this._mintInfo,
-      'Mint info not initialized; call loadMint or loadMintFromCache first',
+      "",
     );
     return this._ensureOperableKeysets(ids, { implicit: false });
killedBy: receive across a rotation a never-loaded wallet rejects honestly, without a hidden repair
statusReason: expected [Function] to throw error matching /Mint info not initialized; call loadM…/ but got ''

[Killed] BooleanLiteral
src/wallet/Wallet.ts:668:57
       !this._mintInfo,
       'Mint info not initialized; call loadMint or loadMintFromCache first',
     );
-    return this._ensureOperableKeysets(ids, { implicit: false });
+    return this._ensureOperableKeysets(ids, { implicit: true });
   }
 
killedBy: public ensureOperableKeysets backfills keys for a strict wallet on request
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/wallet/Wallet.ts:680:64
    * ops still share one refresh. The window covers implicit repairs only: an explicit one neither
    * waits for it nor starts it, so a consumer's call never suppresses the wallet's own repair.
    */
-  private startRepair(implicit: boolean): Promise<void> | null {
-    if (this._pendingRepair) {
-      return this._pendingRepair;
-    }
-    if (implicit) {
-      if (Date.now() - this._lastRepairAt < REPAIR_COOLDOWN_MS) {
-        return null;
-      }
-      this._lastRepairAt = Date.now();
-    }
-    this._pendingRepair = this.loadMint(true).finally(() => {
-      this._pendingRepair = null;
-    });
-    return this._pendingRepair;
-  }
+  private startRepair(implicit: boolean): Promise<void> | null {}
 
   /**
killedBy: receive across a rotation repairs a stale snapshot once when a proof names an unknown keyset
statusReason: Keyset '009a1f293253e41e' is not in the wallet snapshot and no refresh was attempted; call loadMint(true), or retry once the repair cooldown clears

[Killed] BlockStatement
src/wallet/Wallet.ts:681:30
    * waits for it nor starts it, so a consumer's call never suppresses the wallet's own repair.
    */
   private startRepair(implicit: boolean): Promise<void> | null {
-    if (this._pendingRepair) {
-      return this._pendingRepair;
-    }
+    if (this._pendingRepair) {}
     if (implicit) {
       if (Date.now() - this._lastRepairAt < REPAIR_COOLDOWN_MS) {
killedBy: receive across a rotation concurrent ops share one repair refresh
statusReason: Keyset '009a1f293253e41e' is not in the wallet snapshot and no refresh was attempted; call loadMint(true), or retry once the repair cooldown clears

[Killed] ConditionalExpression
src/wallet/Wallet.ts:681:9
    * waits for it nor starts it, so a consumer's call never suppresses the wallet's own repair.
    */
   private startRepair(implicit: boolean): Promise<void> | null {
-    if (this._pendingRepair) {
+    if (false) {
       return this._pendingRepair;
     }
killedBy: receive across a rotation concurrent ops share one repair refresh
statusReason: Keyset '009a1f293253e41e' is not in the wallet snapshot and no refresh was attempted; call loadMint(true), or retry once the repair cooldown clears

[Killed] BlockStatement
src/wallet/Wallet.ts:684:19
     if (this._pendingRepair) {
       return this._pendingRepair;
     }
-    if (implicit) {
-      if (Date.now() - this._lastRepairAt < REPAIR_COOLDOWN_MS) {
-        return null;
-      }
-      this._lastRepairAt = Date.now();
-    }
+    if (implicit) {}
     this._pendingRepair = this.loadMint(true).finally(() => {
       this._pendingRepair = null;
killedBy: mint rejection as rotation evidence a retry that meets the same rejection reports an unrepaired snapshot
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/wallet/Wallet.ts:684:9
     if (this._pendingRepair) {
       return this._pendingRepair;
     }
-    if (implicit) {
+    if (false) {
       if (Date.now() - this._lastRepairAt < REPAIR_COOLDOWN_MS) {
         return null;
killedBy: mint rejection as rotation evidence a retry that meets the same rejection reports an unrepaired snapshot
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/wallet/Wallet.ts:685:11
       return this._pendingRepair;
     }
     if (implicit) {
-      if (Date.now() - this._lastRepairAt < REPAIR_COOLDOWN_MS) {
+      if (Date.now() + this._lastRepairAt < REPAIR_COOLDOWN_MS) {
         return null;
       }
killedBy: mint rejection as rotation evidence a retry that meets the same rejection reports an unrepaired snapshot
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/wallet/Wallet.ts:685:65
       return this._pendingRepair;
     }
     if (implicit) {
-      if (Date.now() - this._lastRepairAt < REPAIR_COOLDOWN_MS) {
-        return null;
-      }
+      if (Date.now() - this._lastRepairAt < REPAIR_COOLDOWN_MS) {}
       this._lastRepairAt = Date.now();
     }
killedBy: mint rejection as rotation evidence a retry that meets the same rejection reports an unrepaired snapshot
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/wallet/Wallet.ts:690:61
       }
       this._lastRepairAt = Date.now();
     }
-    this._pendingRepair = this.loadMint(true).finally(() => {
-      this._pendingRepair = null;
-    });
+    this._pendingRepair = this.loadMint(true).finally(() => {});
     return this._pendingRepair;
   }
killedBy: mint rejection as rotation evidence a retry that meets the same rejection reports an unrepaired snapshot
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/wallet/Wallet.ts:690:41
       }
       this._lastRepairAt = Date.now();
     }
-    this._pendingRepair = this.loadMint(true).finally(() => {
+    this._pendingRepair = this.loadMint(false).finally(() => {
       this._pendingRepair = null;
     });
killedBy: receive across a rotation repairs a stale snapshot once when a proof names an unknown keyset
statusReason: Keyset '009a1f293253e41e' is not a keyset of this mint

[Killed] ConditionalExpression
src/wallet/Wallet.ts:715:9
   ): Promise<void> {
     // Never-loaded wallet: an empty keychain is not rotation evidence. Let the op's own
     // assertions report initialization instead of a hidden loadMint(true) here.
-    if (!this._mintInfo) {
+    if (false) {
       return;
     }
killedBy: receive across a rotation a never-loaded wallet rejects honestly, without a hidden repair
statusReason: expected [Function] to throw error matching /unrecognised keyset/i but got '[MSW] Cannot bypass a request when us…'

[Killed] BooleanLiteral
src/wallet/Wallet.ts:715:9
   ): Promise<void> {
     // Never-loaded wallet: an empty keychain is not rotation evidence. Let the op's own
     // assertions report initialization instead of a hidden loadMint(true) here.
-    if (!this._mintInfo) {
+    if (this._mintInfo) {
       return;
     }
killedBy: restore unblinds restore signatures with the keyset they name and skips zero-value ones
statusReason: Cannot reconstruct proof: keyset 009a1f293253e41e is not loaded in this wallet (may be inactive after rotation). If the wallet is seeded, try restoring (NUT-09) to recover.

[Killed] MethodExpression
src/wallet/Wallet.ts:719:32
       return;
     }
 
-    const wanted = [...new Set(ids.filter((id): id is string => !!id))];
+    const wanted = [...new Set(ids)];
 
     if (opts.implicit && this._strictCachedKeysets) {
killedBy: Restoring deterministic proofs a range signed only at zero value counts as used but yields no proofs
statusReason: Keyset 'undefined' is not a keyset of this mint

[Killed] ArrowFunction
src/wallet/Wallet.ts:719:43
       return;
     }
 
-    const wanted = [...new Set(ids.filter((id): id is string => !!id))];
+    const wanted = [...new Set(ids.filter(() => undefined))];
 
     if (opts.implicit && this._strictCachedKeysets) {
killedBy: receive across a rotation receives a pre-rotation token by loading the old keys once
statusReason: No keys loaded for keyset 00bd033559de27d0

[Killed] ConditionalExpression
src/wallet/Wallet.ts:721:9
 
     const wanted = [...new Set(ids.filter((id): id is string => !!id))];
 
-    if (opts.implicit && this._strictCachedKeysets) {
+    if (true) {
       const strictUnknown = wanted.filter((id) => !this._keyChain.hasKeyset(id));
       if (strictUnknown.length > 0) {
killedBy: receive across a rotation receives a pre-rotation token by loading the old keys once
statusReason: No keys loaded for keyset 00bd033559de27d0

[Killed] LogicalOperator
src/wallet/Wallet.ts:721:9
 
     const wanted = [...new Set(ids.filter((id): id is string => !!id))];
 
-    if (opts.implicit && this._strictCachedKeysets) {
+    if (opts.implicit || this._strictCachedKeysets) {
       const strictUnknown = wanted.filter((id) => !this._keyChain.hasKeyset(id));
       if (strictUnknown.length > 0) {
killedBy: receive across a rotation receives a pre-rotation token by loading the old keys once
statusReason: No keys loaded for keyset 00bd033559de27d0

[Killed] ArrowFunction
src/wallet/Wallet.ts:722:43
     const wanted = [...new Set(ids.filter((id): id is string => !!id))];
 
     if (opts.implicit && this._strictCachedKeysets) {
-      const strictUnknown = wanted.filter((id) => !this._keyChain.hasKeyset(id));
+      const strictUnknown = wanted.filter(() => undefined);
       if (strictUnknown.length > 0) {
         throw new UnknownKeysetError(strictUnknown[0]); // not refreshed: strict never asks the mint
killedBy: strictCachedKeysets unknown id throws typed, zero fetches
statusReason: expected CTSError: Proof has unrecognised keyset. … to be an instance of UnknownKeysetError

[Killed] BooleanLiteral
src/wallet/Wallet.ts:722:51
     const wanted = [...new Set(ids.filter((id): id is string => !!id))];
 
     if (opts.implicit && this._strictCachedKeysets) {
-      const strictUnknown = wanted.filter((id) => !this._keyChain.hasKeyset(id));
+      const strictUnknown = wanted.filter((id) => this._keyChain.hasKeyset(id));
       if (strictUnknown.length > 0) {
         throw new UnknownKeysetError(strictUnknown[0]); // not refreshed: strict never asks the mint
killedBy: mint rejection as rotation evidence strict wallets report the rejection without repairing
statusReason: expected UnknownKeysetError: Keyset '00bd033559de2… { …(2) } to be an instance of StaleKeysetError

[Killed] ConditionalExpression
src/wallet/Wallet.ts:723:11
 
     if (opts.implicit && this._strictCachedKeysets) {
       const strictUnknown = wanted.filter((id) => !this._keyChain.hasKeyset(id));
-      if (strictUnknown.length > 0) {
+      if (false) {
         throw new UnknownKeysetError(strictUnknown[0]); // not refreshed: strict never asks the mint
       }
killedBy: strictCachedKeysets unknown id throws typed, zero fetches
statusReason: expected CTSError: Proof has unrecognised keyset. … to be an instance of UnknownKeysetError

[Killed] EqualityOperator
src/wallet/Wallet.ts:723:11
 
     if (opts.implicit && this._strictCachedKeysets) {
       const strictUnknown = wanted.filter((id) => !this._keyChain.hasKeyset(id));
-      if (strictUnknown.length > 0) {
+      if (strictUnknown.length >= 0) {
         throw new UnknownKeysetError(strictUnknown[0]); // not refreshed: strict never asks the mint
       }
killedBy: mint rejection as rotation evidence strict wallets report the rejection without repairing
statusReason: expected UnknownKeysetError: Keyset 'undefined' is… { …(2) } to be an instance of StaleKeysetError

[Killed] CallExpression
src/wallet/Wallet.ts:724:9
     if (opts.implicit && this._strictCachedKeysets) {
       const strictUnknown = wanted.filter((id) => !this._keyChain.hasKeyset(id));
       if (strictUnknown.length > 0) {
-        throw new UnknownKeysetError(strictUnknown[0]); // not refreshed: strict never asks the mint
+        ; // not refreshed: strict never asks the mint
       }
       return; // no backfill: downstream key checks report keyless keysets
killedBy: strictCachedKeysets unknown id throws typed, zero fetches
statusReason: expected CTSError: Proof has unrecognised keyset. … to be an instance of UnknownKeysetError

[Killed] MethodExpression
src/wallet/Wallet.ts:729:21
       return; // no backfill: downstream key checks report keyless keysets
     }
 
-    const unknown = wanted.filter((id) => !this._keyChain.hasKeyset(id));
+    const unknown = wanted;
     let changed = false;
 
killedBy: receive across a rotation receives a pre-rotation token by loading the old keys once
statusReason: Keyset '00bd033559de27d0' is not in the wallet snapshot and no refresh was attempted; call loadMint(true), or retry once the repair cooldown clears

[Killed] BooleanLiteral
src/wallet/Wallet.ts:729:43
       return; // no backfill: downstream key checks report keyless keysets
     }
 
-    const unknown = wanted.filter((id) => !this._keyChain.hasKeyset(id));
+    const unknown = wanted.filter((id) => this._keyChain.hasKeyset(id));
     let changed = false;
 
killedBy: receive across a rotation receives a pre-rotation token by loading the old keys once
statusReason: Keyset '00bd033559de27d0' is not in the wallet snapshot and no refresh was attempted; call loadMint(true), or retry once the repair cooldown clears

[Killed] BooleanLiteral
src/wallet/Wallet.ts:730:19
     }
 
     const unknown = wanted.filter((id) => !this._keyChain.hasKeyset(id));
-    let changed = false;
+    let changed = true;
 
     if (unknown.length > 0) {
killedBy: receive across a rotation a keyless fetch failure without a prior repair emits nothing
statusReason: expected [ { keysets: [ { …(5) } ], …(2) } ] to have a length of +0 but got 1

[Killed] EqualityOperator
src/wallet/Wallet.ts:732:9
     const unknown = wanted.filter((id) => !this._keyChain.hasKeyset(id));
     let changed = false;
 
-    if (unknown.length > 0) {
+    if (unknown.length >= 0) {
       const repair = this.startRepair(opts.implicit);
       if (!repair) {
killedBy: receive across a rotation receives a pre-rotation token by loading the old keys once
statusReason: Keyset 'undefined' is not in the wallet snapshot and no refresh was attempted; call loadMint(true), or retry once the repair cooldown clears

[Killed] ConditionalExpression
src/wallet/Wallet.ts:732:9
     const unknown = wanted.filter((id) => !this._keyChain.hasKeyset(id));
     let changed = false;
 
-    if (unknown.length > 0) {
+    if (true) {
       const repair = this.startRepair(opts.implicit);
       if (!repair) {
killedBy: receive across a rotation receives a pre-rotation token by loading the old keys once
statusReason: Keyset 'undefined' is not in the wallet snapshot and no refresh was attempted; call loadMint(true), or retry once the repair cooldown clears

[Killed] ConditionalExpression
src/wallet/Wallet.ts:734:11
 
     if (unknown.length > 0) {
       const repair = this.startRepair(opts.implicit);
-      if (!repair) {
+      if (false) {
         // Rate limited: terminal for this op, and not refreshed, so the id may well be genuine.
         throw new UnknownKeysetError(unknown[0]);
killedBy: repair rate limit a second implicit repair inside the cooldown window is skipped
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/wallet/Wallet.ts:734:11
 
     if (unknown.length > 0) {
       const repair = this.startRepair(opts.implicit);
-      if (!repair) {
+      if (repair) {
         // Rate limited: terminal for this op, and not refreshed, so the id may well be genuine.
         throw new UnknownKeysetError(unknown[0]);
killedBy: receive across a rotation repairs a stale snapshot once when a proof names an unknown keyset
statusReason: Keyset '009a1f293253e41e' is not in the wallet snapshot and no refresh was attempted; call loadMint(true), or retry once the repair cooldown clears

[Killed] CallExpression
src/wallet/Wallet.ts:736:9
       const repair = this.startRepair(opts.implicit);
       if (!repair) {
         // Rate limited: terminal for this op, and not refreshed, so the id may well be genuine.
-        throw new UnknownKeysetError(unknown[0]);
+        ;
       }
       try {
killedBy: repair rate limit a second implicit repair inside the cooldown window is skipped
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/wallet/Wallet.ts:738:11
         // Rate limited: terminal for this op, and not refreshed, so the id may well be genuine.
         throw new UnknownKeysetError(unknown[0]);
       }
-      try {
-        await repair;
-      } catch (e) {
+      try {} catch (e) {
         throw new UnknownKeysetError(unknown[0], { cause: e });
       }
killedBy: receive across a rotation repairs a stale snapshot once when a proof names an unknown keyset
statusReason: Keyset '009a1f293253e41e' is not a keyset of this mint
