[Killed] BlockStatement
src/wallet/Wallet.ts:740:19
       }
       try {
         await repair;
-      } catch (e) {
-        throw new UnknownKeysetError(unknown[0], { cause: e });
-      }
+      } catch (e) {}
       changed = true;
       const still = unknown.filter((id) => !this._keyChain.hasKeyset(id));
killedBy: receive across a rotation a failed repair surfaces UnknownKeysetError with the transport failure as cause
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
src/wallet/Wallet.ts:743:17
       } catch (e) {
         throw new UnknownKeysetError(unknown[0], { cause: e });
       }
-      changed = true;
+      changed = false;
       const still = unknown.filter((id) => !this._keyChain.hasKeyset(id));
       if (still.length > 0) {
killedBy: receive across a rotation repairs a stale snapshot once when a proof names an unknown keyset
statusReason: expected [] to have a length of 1 but got +0

[Killed] MethodExpression
src/wallet/Wallet.ts:744:21
         throw new UnknownKeysetError(unknown[0], { cause: e });
       }
       changed = true;
-      const still = unknown.filter((id) => !this._keyChain.hasKeyset(id));
+      const still = unknown;
       if (still.length > 0) {
         // The refresh itself succeeded and is worth persisting before we fail the op.
killedBy: receive across a rotation repairs a stale snapshot once when a proof names an unknown keyset
statusReason: Keyset '009a1f293253e41e' is not a keyset of this mint

[Killed] BooleanLiteral
src/wallet/Wallet.ts:744:44
         throw new UnknownKeysetError(unknown[0], { cause: e });
       }
       changed = true;
-      const still = unknown.filter((id) => !this._keyChain.hasKeyset(id));
+      const still = unknown.filter((id) => this._keyChain.hasKeyset(id));
       if (still.length > 0) {
         // The refresh itself succeeded and is worth persisting before we fail the op.
killedBy: receive across a rotation repairs a stale snapshot once when a proof names an unknown keyset
statusReason: Keyset '009a1f293253e41e' is not a keyset of this mint

[Killed] BlockStatement
src/wallet/Wallet.ts:745:29
       }
       changed = true;
       const still = unknown.filter((id) => !this._keyChain.hasKeyset(id));
-      if (still.length > 0) {
-        // The refresh itself succeeded and is worth persisting before we fail the op.
-        if (opts.implicit) {
-          this.on._emitKeychainUpdated();
-        }
-        throw new UnknownKeysetError(still[0], { refreshed: true });
-      }
+      if (still.length > 0) {}
     }
 
killedBy: receive across a rotation a genuinely alien keyset id throws UnknownKeysetError after the repair
statusReason: expected CTSError: Proof has unrecognised keyset. … to be an instance of UnknownKeysetError

[Killed] ConditionalExpression
src/wallet/Wallet.ts:745:11
       }
       changed = true;
       const still = unknown.filter((id) => !this._keyChain.hasKeyset(id));
-      if (still.length > 0) {
+      if (true) {
         // The refresh itself succeeded and is worth persisting before we fail the op.
         if (opts.implicit) {
killedBy: receive across a rotation repairs a stale snapshot once when a proof names an unknown keyset
statusReason: Keyset 'undefined' is not a keyset of this mint

[Survived] BlockStatement
src/wallet/Wallet.ts:747:28
       const still = unknown.filter((id) => !this._keyChain.hasKeyset(id));
       if (still.length > 0) {
         // The refresh itself succeeded and is worth persisting before we fail the op.
-        if (opts.implicit) {
-          this.on._emitKeychainUpdated();
-        }
+        if (opts.implicit) {}
         throw new UnknownKeysetError(still[0], { refreshed: true });
       }

[Survived] ConditionalExpression
src/wallet/Wallet.ts:747:13
       const still = unknown.filter((id) => !this._keyChain.hasKeyset(id));
       if (still.length > 0) {
         // The refresh itself succeeded and is worth persisting before we fail the op.
-        if (opts.implicit) {
+        if (false) {
           this.on._emitKeychainUpdated();
         }

[Survived] CallExpression
src/wallet/Wallet.ts:748:11
       if (still.length > 0) {
         // The refresh itself succeeded and is worth persisting before we fail the op.
         if (opts.implicit) {
-          this.on._emitKeychainUpdated();
+          ;
         }
         throw new UnknownKeysetError(still[0], { refreshed: true });

[Killed] BooleanLiteral
src/wallet/Wallet.ts:750:61
         if (opts.implicit) {
           this.on._emitKeychainUpdated();
         }
-        throw new UnknownKeysetError(still[0], { refreshed: true });
+        throw new UnknownKeysetError(still[0], { refreshed: false });
       }
     }
killedBy: receive across a rotation a genuinely alien keyset id throws UnknownKeysetError after the repair
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/wallet/Wallet.ts:755:7
     }
 
     const keyless =
-      opts.fetchKeys === false
+      opts.fetchKeys !== false
         ? []
         : wanted.filter(
killedBy: receive across a rotation receives a pre-rotation token by loading the old keys once
statusReason: No keys loaded for keyset 00bd033559de27d0

[Killed] ConditionalExpression
src/wallet/Wallet.ts:755:7
     }
 
     const keyless =
-      opts.fetchKeys === false
+      false
         ? []
         : wanted.filter(
killedBy: send and melt inputs across a rotation a failing key fetch does not block send or melt inputs
statusReason: Failed to fetch

[Killed] ArrayDeclaration
src/wallet/Wallet.ts:756:11
 
     const keyless =
       opts.fetchKeys === false
-        ? []
+        ? ["Stryker was here"]
         : wanted.filter(
             (id) => this._keyChain.isUnitKeyset(id) && !this._keyChain.getKeyset(id).hasKeys,
killedBy: melt change across a rotation completeMelt reconstructs change on a keyset it holds keyless
statusReason: Keyset 'Stryker was here' not found

[Killed] MethodExpression
src/wallet/Wallet.ts:757:11
     const keyless =
       opts.fetchKeys === false
         ? []
-        : wanted.filter(
-            (id) => this._keyChain.isUnitKeyset(id) && !this._keyChain.getKeyset(id).hasKeys,
-          );
+        : wanted;
     if (keyless.length > 0) {
       // allSettled, not all: a sibling failure must not hide the keys that did land, or the
killedBy: mint rejection as rotation evidence completeSwap hands the split flow a repaired snapshot to re-prepare against
statusReason: expected [ …(2) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/wallet/Wallet.ts:758:21
       opts.fetchKeys === false
         ? []
         : wanted.filter(
-            (id) => this._keyChain.isUnitKeyset(id) && !this._keyChain.getKeyset(id).hasKeys,
+            (id) => false,
           );
     if (keyless.length > 0) {
killedBy: receive across a rotation receives a pre-rotation token by loading the old keys once
statusReason: No keys loaded for keyset 00bd033559de27d0

[Killed] BooleanLiteral
src/wallet/Wallet.ts:758:56
       opts.fetchKeys === false
         ? []
         : wanted.filter(
-            (id) => this._keyChain.isUnitKeyset(id) && !this._keyChain.getKeyset(id).hasKeys,
+            (id) => this._keyChain.isUnitKeyset(id) && this._keyChain.getKeyset(id).hasKeys,
           );
     if (keyless.length > 0) {
killedBy: receive across a rotation receives a pre-rotation token by loading the old keys once
statusReason: No keys loaded for keyset 00bd033559de27d0

[Killed] ConditionalExpression
src/wallet/Wallet.ts:760:9
         : wanted.filter(
             (id) => this._keyChain.isUnitKeyset(id) && !this._keyChain.getKeyset(id).hasKeys,
           );
-    if (keyless.length > 0) {
+    if (false) {
       // allSettled, not all: a sibling failure must not hide the keys that did land, or the
       // consumer never learns to persist them and refetches on every op.
killedBy: receive across a rotation receives a pre-rotation token by loading the old keys once
statusReason: No keys loaded for keyset 00bd033559de27d0

[Killed] BlockStatement
src/wallet/Wallet.ts:760:29
         : wanted.filter(
             (id) => this._keyChain.isUnitKeyset(id) && !this._keyChain.getKeyset(id).hasKeys,
           );
-    if (keyless.length > 0) {
-      // allSettled, not all: a sibling failure must not hide the keys that did land, or the
-      // consumer never learns to persist them and refetches on every op.
-      const fetches = await Promise.allSettled(
-        keyless.map((id) => this._keyChain.ensureKeysetKeys(id)),
-      );
-      const failed = fetches.filter((f): f is PromiseRejectedResult => f.status === 'rejected');
-      if (failed.length < fetches.length) {
-        changed = true;
-      }
-      if (failed.length > 0) {
-        if (changed && opts.implicit) {
-          // Whatever landed (a repair above, or a sibling fetch) is worth persisting first.
-          this.on._emitKeychainUpdated();
-        }
-        if (failed.length === 1) {
-          throw failed[0].reason;
-        }
-        throw new CTSError(`Could not load keys for ${failed.length} keysets`, {
-          cause: failed.map((f): unknown => f.reason),
-        });
-      }
-    }
+    if (keyless.length > 0) {}
 
     // Explicit callers get no event: they asked for the change, so they persist the cache.
killedBy: receive across a rotation receives a pre-rotation token by loading the old keys once
statusReason: No keys loaded for keyset 00bd033559de27d0

[Killed] ArrowFunction
src/wallet/Wallet.ts:764:21
       // allSettled, not all: a sibling failure must not hide the keys that did land, or the
       // consumer never learns to persist them and refetches on every op.
       const fetches = await Promise.allSettled(
-        keyless.map((id) => this._keyChain.ensureKeysetKeys(id)),
+        keyless.map(() => undefined),
       );
       const failed = fetches.filter((f): f is PromiseRejectedResult => f.status === 'rejected');
killedBy: receive across a rotation receives a pre-rotation token by loading the old keys once
statusReason: No keys loaded for keyset 00bd033559de27d0

[Killed] ArrowFunction
src/wallet/Wallet.ts:766:37
       const fetches = await Promise.allSettled(
         keyless.map((id) => this._keyChain.ensureKeysetKeys(id)),
       );
-      const failed = fetches.filter((f): f is PromiseRejectedResult => f.status === 'rejected');
+      const failed = fetches.filter(() => undefined);
       if (failed.length < fetches.length) {
         changed = true;
killedBy: receive across a rotation a keyless fetch failure without a prior repair emits nothing
statusReason: expected [ { keysets: [ { …(5) } ], …(2) } ] to have a length of +0 but got 1

[Killed] MethodExpression
src/wallet/Wallet.ts:766:22
       const fetches = await Promise.allSettled(
         keyless.map((id) => this._keyChain.ensureKeysetKeys(id)),
       );
-      const failed = fetches.filter((f): f is PromiseRejectedResult => f.status === 'rejected');
+      const failed = fetches;
       if (failed.length < fetches.length) {
         changed = true;
killedBy: receive across a rotation receives a pre-rotation token by loading the old keys once
statusReason: undefined

[Killed] ConditionalExpression
src/wallet/Wallet.ts:767:11
         keyless.map((id) => this._keyChain.ensureKeysetKeys(id)),
       );
       const failed = fetches.filter((f): f is PromiseRejectedResult => f.status === 'rejected');
-      if (failed.length < fetches.length) {
+      if (false) {
         changed = true;
       }
killedBy: partial keyless fetches emits for the keys that landed before failing the op
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/wallet/Wallet.ts:767:11
         keyless.map((id) => this._keyChain.ensureKeysetKeys(id)),
       );
       const failed = fetches.filter((f): f is PromiseRejectedResult => f.status === 'rejected');
-      if (failed.length < fetches.length) {
+      if (true) {
         changed = true;
       }
killedBy: receive across a rotation a keyless fetch failure without a prior repair emits nothing
statusReason: expected [ { keysets: [ { …(5) } ], …(2) } ] to have a length of +0 but got 1

[Killed] BooleanLiteral
src/wallet/Wallet.ts:768:19
       );
       const failed = fetches.filter((f): f is PromiseRejectedResult => f.status === 'rejected');
       if (failed.length < fetches.length) {
-        changed = true;
+        changed = false;
       }
       if (failed.length > 0) {
killedBy: partial keyless fetches emits for the keys that landed before failing the op
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/wallet/Wallet.ts:770:11
       if (failed.length < fetches.length) {
         changed = true;
       }
-      if (failed.length > 0) {
+      if (failed.length <= 0) {
         if (changed && opts.implicit) {
           // Whatever landed (a repair above, or a sibling fetch) is worth persisting first.
killedBy: receive across a rotation receives a pre-rotation token by loading the old keys once
statusReason: Could not load keys for 0 keysets

[Killed] EqualityOperator
src/wallet/Wallet.ts:770:11
       if (failed.length < fetches.length) {
         changed = true;
       }
-      if (failed.length > 0) {
+      if (failed.length >= 0) {
         if (changed && opts.implicit) {
           // Whatever landed (a repair above, or a sibling fetch) is worth persisting first.
killedBy: receive across a rotation receives a pre-rotation token by loading the old keys once
statusReason: Could not load keys for 0 keysets

[Killed] ConditionalExpression
src/wallet/Wallet.ts:771:13
         changed = true;
       }
       if (failed.length > 0) {
-        if (changed && opts.implicit) {
+        if (true) {
           // Whatever landed (a repair above, or a sibling fetch) is worth persisting first.
           this.on._emitKeychainUpdated();
killedBy: receive across a rotation a keyless fetch failure without a prior repair emits nothing
statusReason: expected [ { keysets: [ { …(5) } ], …(2) } ] to have a length of +0 but got 1

[Killed] BlockStatement
src/wallet/Wallet.ts:771:39
         changed = true;
       }
       if (failed.length > 0) {
-        if (changed && opts.implicit) {
-          // Whatever landed (a repair above, or a sibling fetch) is worth persisting first.
-          this.on._emitKeychainUpdated();
-        }
+        if (changed && opts.implicit) {}
         if (failed.length === 1) {
           throw failed[0].reason;
killedBy: receive across a rotation a completed repair still emits when the trailing keyless fetch fails
statusReason: expected [] to have a length of 1 but got +0

[Killed] CallExpression
src/wallet/Wallet.ts:773:11
       if (failed.length > 0) {
         if (changed && opts.implicit) {
           // Whatever landed (a repair above, or a sibling fetch) is worth persisting first.
-          this.on._emitKeychainUpdated();
+          ;
         }
         if (failed.length === 1) {
killedBy: receive across a rotation a completed repair still emits when the trailing keyless fetch fails
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/wallet/Wallet.ts:775:13
           // Whatever landed (a repair above, or a sibling fetch) is worth persisting first.
           this.on._emitKeychainUpdated();
         }
-        if (failed.length === 1) {
+        if (failed.length !== 1) {
           throw failed[0].reason;
         }
killedBy: partial keyless fetches reports both failures when no keys land at all
statusReason: expected [Function] to throw error matching /Could not load keys for 2 keysets/ but got 'Failed to fetch'

[Killed] ConditionalExpression
src/wallet/Wallet.ts:775:13
           // Whatever landed (a repair above, or a sibling fetch) is worth persisting first.
           this.on._emitKeychainUpdated();
         }
-        if (failed.length === 1) {
+        if (true) {
           throw failed[0].reason;
         }
killedBy: partial keyless fetches reports both failures when no keys land at all
statusReason: expected [Function] to throw error matching /Could not load keys for 2 keysets/ but got 'Failed to fetch'

[Killed] CallExpression
src/wallet/Wallet.ts:778:9
         if (failed.length === 1) {
           throw failed[0].reason;
         }
-        throw new CTSError(`Could not load keys for ${failed.length} keysets`, {
-          cause: failed.map((f): unknown => f.reason),
-        });
+        ;
       }
     }
killedBy: partial keyless fetches reports both failures when no keys land at all
statusReason: expected [Function] to throw error matching /Could not load keys for 2 keysets/ but got 'No keys loaded for keyset 00bd033559d…'

[Survived] ArrowFunction
src/wallet/Wallet.ts:779:29
           throw failed[0].reason;
         }
         throw new CTSError(`Could not load keys for ${failed.length} keysets`, {
-          cause: failed.map((f): unknown => f.reason),
+          cause: failed.map(() => undefined),
         });
       }

[Killed] ConditionalExpression
src/wallet/Wallet.ts:785:9
     }
 
     // Explicit callers get no event: they asked for the change, so they persist the cache.
-    if (changed && opts.implicit) {
+    if (true) {
       this.on._emitKeychainUpdated();
     }
killedBy: mint rejection as rotation evidence completeSwap hands the split flow a repaired snapshot to re-prepare against
statusReason: expected [ …(2) ] to have a length of 1 but got 2

[Killed] BlockStatement
src/wallet/Wallet.ts:785:35
     }
 
     // Explicit callers get no event: they asked for the change, so they persist the cache.
-    if (changed && opts.implicit) {
-      this.on._emitKeychainUpdated();
-    }
+    if (changed && opts.implicit) {}
   }
 
killedBy: receive across a rotation repairs a stale snapshot once when a proof names an unknown keyset
statusReason: expected [] to have a length of 1 but got +0

[Killed] CallExpression
src/wallet/Wallet.ts:786:7
 
     // Explicit callers get no event: they asked for the change, so they persist the cache.
     if (changed && opts.implicit) {
-      this.on._emitKeychainUpdated();
+      ;
     }
   }
killedBy: receive across a rotation repairs a stale snapshot once when a proof names an unknown keyset
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/wallet/Wallet.ts:795:57
    *
    * @returns True when the refresh ran, so the caller's operation is worth running again.
    */
-  private async repairStaleSnapshot(): Promise<boolean> {
-    if (this._strictCachedKeysets) {
-      return false; // the snapshot is the consumer's to manage
-    }
-    const repair = this.startRepair(true);
-    if (!repair) {
-      return false; // rate limited
-    }
-    try {
-      await repair;
-    } catch (e) {
-      this._logger.warn('Snapshot refresh after a mint keyset rejection failed', {
-        err: (e as Error).message,
-      });
-      return false;
-    }
-    this.on._emitKeychainUpdated();
-    return true;
-  }
+  private async repairStaleSnapshot(): Promise<boolean> {}
 
   /**
killedBy: mint rejection as rotation evidence receive heals the snapshot and succeeds when the caller runs it again
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/wallet/Wallet.ts:796:9
    * @returns True when the refresh ran, so the caller's operation is worth running again.
    */
   private async repairStaleSnapshot(): Promise<boolean> {
-    if (this._strictCachedKeysets) {
+    if (false) {
       return false; // the snapshot is the consumer's to manage
     }
killedBy: mint rejection as rotation evidence strict wallets report the rejection without repairing
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/wallet/Wallet.ts:796:9
    * @returns True when the refresh ran, so the caller's operation is worth running again.
    */
   private async repairStaleSnapshot(): Promise<boolean> {
-    if (this._strictCachedKeysets) {
+    if (true) {
       return false; // the snapshot is the consumer's to manage
     }
killedBy: mint rejection as rotation evidence receive heals the snapshot and succeeds when the caller runs it again
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/wallet/Wallet.ts:797:14
    */
   private async repairStaleSnapshot(): Promise<boolean> {
     if (this._strictCachedKeysets) {
-      return false; // the snapshot is the consumer's to manage
+      return true; // the snapshot is the consumer's to manage
     }
     const repair = this.startRepair(true);
killedBy: mint rejection as rotation evidence strict wallets report the rejection without repairing
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/wallet/Wallet.ts:799:37
     if (this._strictCachedKeysets) {
       return false; // the snapshot is the consumer's to manage
     }
-    const repair = this.startRepair(true);
+    const repair = this.startRepair(false);
     if (!repair) {
       return false; // rate limited
killedBy: mint rejection as rotation evidence a retry that meets the same rejection reports an unrepaired snapshot
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/wallet/Wallet.ts:800:9
       return false; // the snapshot is the consumer's to manage
     }
     const repair = this.startRepair(true);
-    if (!repair) {
+    if (false) {
       return false; // rate limited
     }
killedBy: mint rejection as rotation evidence a retry that meets the same rejection reports an unrepaired snapshot
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/wallet/Wallet.ts:800:9
       return false; // the snapshot is the consumer's to manage
     }
     const repair = this.startRepair(true);
-    if (!repair) {
+    if (true) {
       return false; // rate limited
     }
killedBy: mint rejection as rotation evidence receive heals the snapshot and succeeds when the caller runs it again
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/wallet/Wallet.ts:801:14
     }
     const repair = this.startRepair(true);
     if (!repair) {
-      return false; // rate limited
+      return true; // rate limited
     }
     try {
killedBy: mint rejection as rotation evidence a retry that meets the same rejection reports an unrepaired snapshot
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/wallet/Wallet.ts:805:17
     }
     try {
       await repair;
-    } catch (e) {
-      this._logger.warn('Snapshot refresh after a mint keyset rejection failed', {
-        err: (e as Error).message,
-      });
-      return false;
-    }
+    } catch (e) {}
     this.on._emitKeychainUpdated();
     return true;
killedBy: mint rejection as rotation evidence a failed refresh reports the rejection as unrepaired
statusReason: expected true to be false // Object.is equality

[Survived] CallExpression
src/wallet/Wallet.ts:806:7
     try {
       await repair;
     } catch (e) {
-      this._logger.warn('Snapshot refresh after a mint keyset rejection failed', {
-        err: (e as Error).message,
-      });
+      ;
       return false;
     }

[Survived] StringLiteral
src/wallet/Wallet.ts:806:25
     try {
       await repair;
     } catch (e) {
-      this._logger.warn('Snapshot refresh after a mint keyset rejection failed', {
+      this._logger.warn("", {
         err: (e as Error).message,
       });

[Killed] BooleanLiteral
src/wallet/Wallet.ts:809:14
       this._logger.warn('Snapshot refresh after a mint keyset rejection failed', {
         err: (e as Error).message,
       });
-      return false;
+      return true;
     }
     this.on._emitKeychainUpdated();
killedBy: mint rejection as rotation evidence a failed refresh reports the rejection as unrepaired
statusReason: expected true to be false // Object.is equality

[Killed] CallExpression
src/wallet/Wallet.ts:811:5
       });
       return false;
     }
-    this.on._emitKeychainUpdated();
+    ;
     return true;
   }
killedBy: mint rejection as rotation evidence completeSwap hands the split flow a repaired snapshot to re-prepare against
statusReason: expected [] to have a length of 1 but got +0

[Killed] BooleanLiteral
src/wallet/Wallet.ts:812:12
       return false;
     }
     this.on._emitKeychainUpdated();
-    return true;
+    return false;
   }
 
killedBy: mint rejection as rotation evidence receive heals the snapshot and succeeds when the caller runs it again
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/wallet/Wallet.ts:822:81
    * Repairs the snapshot once and rethrows as {@link StaleKeysetError}. Nothing retries: the outputs
    * were built on the rejected keyset, so the caller runs the operation again.
    */
-  private async withStaleKeysetRepair<T>(request: () => Promise<T>): Promise<T> {
-    try {
-      return await request();
-    } catch (e) {
-      // NUT-00 reserves 12xxx for keyset errors (12001 unknown, 12002 inactive, 12003 expired).
-      // Mints that answer without a structured code are unaffected, as are look-alike errors from
-      // a custom request layer whose `code` is not a finite number (`Number(undefined)` is NaN):
-      // every range comparison against those is false, so check before comparing.
-      if (
-        !isMintOperationError(e) ||
-        !Number.isFinite(e.code) ||
-        e.code < 12000 ||
-        e.code >= 13000
-      ) {
-        throw e;
-      }
-      throw new StaleKeysetError(await this.repairStaleSnapshot(), { cause: e });
-    }
-  }
+  private async withStaleKeysetRepair<T>(request: () => Promise<T>): Promise<T> {}
 
   /**
killedBy: mint rejection as rotation evidence receive heals the snapshot and succeeds when the caller runs it again
statusReason: expected TypeError: Cannot destructure property 's… to be an instance of StaleKeysetError

[Killed] BlockStatement
src/wallet/Wallet.ts:823:9
    * were built on the rejected keyset, so the caller runs the operation again.
    */
   private async withStaleKeysetRepair<T>(request: () => Promise<T>): Promise<T> {
-    try {
-      return await request();
-    } catch (e) {
+    try {} catch (e) {
       // NUT-00 reserves 12xxx for keyset errors (12001 unknown, 12002 inactive, 12003 expired).
       // Mints that answer without a structured code are unaffected, as are look-alike errors from
killedBy: mint rejection as rotation evidence receive heals the snapshot and succeeds when the caller runs it again
statusReason: expected TypeError: Cannot destructure property 's… to be an instance of StaleKeysetError

[Killed] BlockStatement
src/wallet/Wallet.ts:825:17
   private async withStaleKeysetRepair<T>(request: () => Promise<T>): Promise<T> {
     try {
       return await request();
-    } catch (e) {
-      // NUT-00 reserves 12xxx for keyset errors (12001 unknown, 12002 inactive, 12003 expired).
-      // Mints that answer without a structured code are unaffected, as are look-alike errors from
-      // a custom request layer whose `code` is not a finite number (`Number(undefined)` is NaN):
-      // every range comparison against those is false, so check before comparing.
-      if (
-        !isMintOperationError(e) ||
-        !Number.isFinite(e.code) ||
-        e.code < 12000 ||
-        e.code >= 13000
-      ) {
-        throw e;
-      }
-      throw new StaleKeysetError(await this.repairStaleSnapshot(), { cause: e });
-    }
+    } catch (e) {}
   }
 
killedBy: mint rejection as rotation evidence receive heals the snapshot and succeeds when the caller runs it again
statusReason: expected TypeError: Cannot destructure property 's… to be an instance of StaleKeysetError

[Killed] LogicalOperator
src/wallet/Wallet.ts:831:9
       // a custom request layer whose `code` is not a finite number (`Number(undefined)` is NaN):
       // every range comparison against those is false, so check before comparing.
       if (
-        !isMintOperationError(e) ||
-        !Number.isFinite(e.code) ||
-        e.code < 12000 ||
+        (!isMintOperationError(e) || !Number.isFinite(e.code)) && e.code < 12000 ||
         e.code >= 13000
       ) {
killedBy: mint rejection as rotation evidence a rejection outside the keyset error class propagates untouched
statusReason: expected StaleKeysetError: Mint rejected a stale k… { repaired: true } to be an instance of MintOperationError

[Killed] ConditionalExpression
src/wallet/Wallet.ts:831:9
       // a custom request layer whose `code` is not a finite number (`Number(undefined)` is NaN):
       // every range comparison against those is false, so check before comparing.
       if (
-        !isMintOperationError(e) ||
-        !Number.isFinite(e.code) ||
-        e.code < 12000 ||
-        e.code >= 13000
+        true
       ) {
         throw e;
killedBy: mint rejection as rotation evidence receive heals the snapshot and succeeds when the caller runs it again
statusReason: expected MintOperationError: Keyset is inactive, c… { …(2) } to be an instance of StaleKeysetError

[Killed] BooleanLiteral
src/wallet/Wallet.ts:832:9
       // every range comparison against those is false, so check before comparing.
       if (
         !isMintOperationError(e) ||
-        !Number.isFinite(e.code) ||
+        Number.isFinite(e.code) ||
         e.code < 12000 ||
         e.code >= 13000
killedBy: mint rejection as rotation evidence receive heals the snapshot and succeeds when the caller runs it again
statusReason: expected MintOperationError: Keyset is inactive, c… { …(2) } to be an instance of StaleKeysetError
