[Killed] ConditionalExpression
src/wallet/Wallet.ts:2038:12
       mf = listed ? Amount.zero() : pr.feesFor(this.mint.mintUrl, meltMethods);
     }
     const needed = expected.add(mf).add(this.getFeesForProofs(proofs));
-    return sumProofs(proofs).compareTo(needed) >= 0;
+    return true;
   }
 
killedBy: wallet.isPaymentRequestSatisfied enforces the net-of-input-fees formula (NUT-18)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/wallet/Wallet.ts:2038:12
       mf = listed ? Amount.zero() : pr.feesFor(this.mint.mintUrl, meltMethods);
     }
     const needed = expected.add(mf).add(this.getFeesForProofs(proofs));
-    return sumProofs(proofs).compareTo(needed) >= 0;
+    return sumProofs(proofs).compareTo(needed) < 0;
   }
 
killedBy: wallet.isPaymentRequestSatisfied enforces the net-of-input-fees formula (NUT-18)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/wallet/Wallet.ts:2053:15
   private receiverKeysFor(
     option: ParsedNutrootOption | undefined,
     privkeys: string | string[] | undefined,
-  ): string[] {
-    if (!option) return [];
-    const keyed = option.receiverKey.toLowerCase() !== NUTROOT_NUMS_KEY;
-    if (!keyed && !option.blindKeys?.length) return [];
-    const statics = privkeys === undefined ? [] : [privkeys].flat();
-    this.failIf(
-      statics.length === 0,
-      `${keyed ? 'receiver-keyed' : 'blind-me'} nutroot request: pass the requested key(s) as opts.privkeys, the proofs cannot be checked without them`,
-    );
-    const bad = statics.find((k) => !/^[0-9a-f]{64}$/i.test(k));
-    this.failIf(bad !== undefined, 'opts.privkeys must be 32-byte hex private keys');
-    return statics;
-  }
+  ): string[] {}
 
   /**
killedBy: wallet.isPaymentRequestSatisfied a receiver-keyed nutroot request settles only proofs keyed to the payee
statusReason: expected [Function] to throw error matching /pass the requested key\(s\)/ but got 'Cannot read properties of undefined (…'

[Killed] BooleanLiteral
src/wallet/Wallet.ts:2054:9
     option: ParsedNutrootOption | undefined,
     privkeys: string | string[] | undefined,
   ): string[] {
-    if (!option) return [];
+    if (option) return [];
     const keyed = option.receiverKey.toLowerCase() !== NUTROOT_NUMS_KEY;
     if (!keyed && !option.blindKeys?.length) return [];
killedBy: wallet.isPaymentRequestSatisfied a receiver-keyed nutroot request settles only proofs keyed to the payee
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/wallet/Wallet.ts:2054:9
     option: ParsedNutrootOption | undefined,
     privkeys: string | string[] | undefined,
   ): string[] {
-    if (!option) return [];
+    if (true) return [];
     const keyed = option.receiverKey.toLowerCase() !== NUTROOT_NUMS_KEY;
     if (!keyed && !option.blindKeys?.length) return [];
killedBy: wallet.isPaymentRequestSatisfied a receiver-keyed nutroot request settles only proofs keyed to the payee
statusReason: expected [Function] to throw an error

[Killed] MethodExpression
src/wallet/Wallet.ts:2055:19
     privkeys: string | string[] | undefined,
   ): string[] {
     if (!option) return [];
-    const keyed = option.receiverKey.toLowerCase() !== NUTROOT_NUMS_KEY;
+    const keyed = option.receiverKey.toUpperCase() !== NUTROOT_NUMS_KEY;
     if (!keyed && !option.blindKeys?.length) return [];
     const statics = privkeys === undefined ? [] : [privkeys].flat();
killedBy: wallet.isPaymentRequestSatisfied a blind-me leaf key must carry the payee's own blinding
statusReason: expected [Function] to throw error matching /blind-me nutroot request/ but got 'receiver-keyed nutroot request: pass …'

[Killed] EqualityOperator
src/wallet/Wallet.ts:2055:19
     privkeys: string | string[] | undefined,
   ): string[] {
     if (!option) return [];
-    const keyed = option.receiverKey.toLowerCase() !== NUTROOT_NUMS_KEY;
+    const keyed = option.receiverKey.toLowerCase() === NUTROOT_NUMS_KEY;
     if (!keyed && !option.blindKeys?.length) return [];
     const statics = privkeys === undefined ? [] : [privkeys].flat();
killedBy: wallet.isPaymentRequestSatisfied a receiver-keyed nutroot request settles only proofs keyed to the payee
statusReason: expected [Function] to throw an error

[Killed] OptionalChaining
src/wallet/Wallet.ts:2056:20
   ): string[] {
     if (!option) return [];
     const keyed = option.receiverKey.toLowerCase() !== NUTROOT_NUMS_KEY;
-    if (!keyed && !option.blindKeys?.length) return [];
+    if (!keyed && !option.blindKeys.length) return [];
     const statics = privkeys === undefined ? [] : [privkeys].flat();
     this.failIf(
killedBy: nutroot edge cases rejects NUMS metadata that does not reconstruct the proof secret
statusReason: expected [Function] to throw error matching /reconstruct/ but got 'Cannot read properties of undefined (…'

[Killed] ConditionalExpression
src/wallet/Wallet.ts:2056:9
   ): string[] {
     if (!option) return [];
     const keyed = option.receiverKey.toLowerCase() !== NUTROOT_NUMS_KEY;
-    if (!keyed && !option.blindKeys?.length) return [];
+    if (false) return [];
     const statics = privkeys === undefined ? [] : [privkeys].flat();
     this.failIf(
killedBy: nutroot edge cases rejects NUMS metadata that does not reconstruct the proof secret
statusReason: expected [Function] to throw error matching /reconstruct/ but got 'blind-me nutroot request: pass the re…'

[Killed] EqualityOperator
src/wallet/Wallet.ts:2057:21
     if (!option) return [];
     const keyed = option.receiverKey.toLowerCase() !== NUTROOT_NUMS_KEY;
     if (!keyed && !option.blindKeys?.length) return [];
-    const statics = privkeys === undefined ? [] : [privkeys].flat();
+    const statics = privkeys !== undefined ? [] : [privkeys].flat();
     this.failIf(
       statics.length === 0,
killedBy: nutroot edge cases binds blinded owners to their requested conditions with internal key 0250929b74c1a04954b78b4b6035e97a5e078a5a0f28ec96d547bfee9ace803ac0
statusReason: blind-me nutroot request: pass the requested key(s) as opts.privkeys, the proofs cannot be checked without them

[Killed] ConditionalExpression
src/wallet/Wallet.ts:2057:21
     if (!option) return [];
     const keyed = option.receiverKey.toLowerCase() !== NUTROOT_NUMS_KEY;
     if (!keyed && !option.blindKeys?.length) return [];
-    const statics = privkeys === undefined ? [] : [privkeys].flat();
+    const statics = true ? [] : [privkeys].flat();
     this.failIf(
       statics.length === 0,
killedBy: nutroot edge cases binds blinded owners to their requested conditions with internal key 0250929b74c1a04954b78b4b6035e97a5e078a5a0f28ec96d547bfee9ace803ac0
statusReason: blind-me nutroot request: pass the requested key(s) as opts.privkeys, the proofs cannot be checked without them

[Killed] ConditionalExpression
src/wallet/Wallet.ts:2059:7
     if (!keyed && !option.blindKeys?.length) return [];
     const statics = privkeys === undefined ? [] : [privkeys].flat();
     this.failIf(
-      statics.length === 0,
+      false,
       `${keyed ? 'receiver-keyed' : 'blind-me'} nutroot request: pass the requested key(s) as opts.privkeys, the proofs cannot be checked without them`,
     );
killedBy: wallet.isPaymentRequestSatisfied a receiver-keyed nutroot request settles only proofs keyed to the payee
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/wallet/Wallet.ts:2059:7
     if (!keyed && !option.blindKeys?.length) return [];
     const statics = privkeys === undefined ? [] : [privkeys].flat();
     this.failIf(
-      statics.length === 0,
+      true,
       `${keyed ? 'receiver-keyed' : 'blind-me'} nutroot request: pass the requested key(s) as opts.privkeys, the proofs cannot be checked without them`,
     );
killedBy: nutroot edge cases binds blinded owners to their requested conditions with internal key 0250929b74c1a04954b78b4b6035e97a5e078a5a0f28ec96d547bfee9ace803ac0
statusReason: blind-me nutroot request: pass the requested key(s) as opts.privkeys, the proofs cannot be checked without them

[Killed] BooleanLiteral
src/wallet/Wallet.ts:2062:37
       statics.length === 0,
       `${keyed ? 'receiver-keyed' : 'blind-me'} nutroot request: pass the requested key(s) as opts.privkeys, the proofs cannot be checked without them`,
     );
-    const bad = statics.find((k) => !/^[0-9a-f]{64}$/i.test(k));
+    const bad = statics.find((k) => /^[0-9a-f]{64}$/i.test(k));
     this.failIf(bad !== undefined, 'opts.privkeys must be 32-byte hex private keys');
     return statics;
killedBy: wallet.isPaymentRequestSatisfied a both-encoded request settles only legacy proofs carrying the requested lock
statusReason: opts.privkeys must be 32-byte hex private keys

[Killed] ArrowFunction
src/wallet/Wallet.ts:2062:30
       statics.length === 0,
       `${keyed ? 'receiver-keyed' : 'blind-me'} nutroot request: pass the requested key(s) as opts.privkeys, the proofs cannot be checked without them`,
     );
-    const bad = statics.find((k) => !/^[0-9a-f]{64}$/i.test(k));
+    const bad = statics.find(() => undefined);
     this.failIf(bad !== undefined, 'opts.privkeys must be 32-byte hex private keys');
     return statics;
killedBy: wallet.isPaymentRequestSatisfied a receiver-keyed nutroot request settles only proofs keyed to the payee
statusReason: expected [Function] to throw error matching /32-byte hex/ but got 'Nutroot request: proof is not keyed t…'

[Killed] ConditionalExpression
src/wallet/Wallet.ts:2063:17
       `${keyed ? 'receiver-keyed' : 'blind-me'} nutroot request: pass the requested key(s) as opts.privkeys, the proofs cannot be checked without them`,
     );
     const bad = statics.find((k) => !/^[0-9a-f]{64}$/i.test(k));
-    this.failIf(bad !== undefined, 'opts.privkeys must be 32-byte hex private keys');
+    this.failIf(true, 'opts.privkeys must be 32-byte hex private keys');
     return statics;
   }
killedBy: wallet.isPaymentRequestSatisfied a both-encoded request settles only legacy proofs carrying the requested lock
statusReason: opts.privkeys must be 32-byte hex private keys

[Killed] EqualityOperator
src/wallet/Wallet.ts:2063:17
       `${keyed ? 'receiver-keyed' : 'blind-me'} nutroot request: pass the requested key(s) as opts.privkeys, the proofs cannot be checked without them`,
     );
     const bad = statics.find((k) => !/^[0-9a-f]{64}$/i.test(k));
-    this.failIf(bad !== undefined, 'opts.privkeys must be 32-byte hex private keys');
+    this.failIf(bad === undefined, 'opts.privkeys must be 32-byte hex private keys');
     return statics;
   }
killedBy: wallet.isPaymentRequestSatisfied a both-encoded request settles only legacy proofs carrying the requested lock
statusReason: opts.privkeys must be 32-byte hex private keys

[Killed] BlockStatement
src/wallet/Wallet.ts:2080:11
     option: ParsedNutrootOption,
     proof: Pick<Proof, 'secret' | 'spend_info'>,
     statics: string[],
-  ): void {
-    if (statics.length === 0 || option.receiverKey.toLowerCase() === NUTROOT_NUMS_KEY) return;
-    // `E` is present: verifyNutrootRequestTree rejects a receiver-keyed proof without one.
-    const E = proof.spend_info?.E as string;
-    const tree = proof.spend_info?.tree;
-    this.failIf(
-      !statics.some((priv) => recoverReceiverKeyedSecretKey(proof.secret, E, priv, tree)),
-      'Nutroot request: proof is not keyed to the requested receiver key',
-    );
-  }
+  ): void {}
 
   /**
killedBy: wallet.isPaymentRequestSatisfied a receiver-keyed nutroot request settles only proofs keyed to the payee
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/wallet/Wallet.ts:2081:33
     proof: Pick<Proof, 'secret' | 'spend_info'>,
     statics: string[],
   ): void {
-    if (statics.length === 0 || option.receiverKey.toLowerCase() === NUTROOT_NUMS_KEY) return;
+    if (statics.length === 0 || false) return;
     // `E` is present: verifyNutrootRequestTree rejects a receiver-keyed proof without one.
     const E = proof.spend_info?.E as string;
killedBy: wallet.isPaymentRequestSatisfied a blind-me leaf key must carry the payee's own blinding
statusReason: Nutroot request: proof is not keyed to the requested receiver key

[Killed] MethodExpression
src/wallet/Wallet.ts:2081:33
     proof: Pick<Proof, 'secret' | 'spend_info'>,
     statics: string[],
   ): void {
-    if (statics.length === 0 || option.receiverKey.toLowerCase() === NUTROOT_NUMS_KEY) return;
+    if (statics.length === 0 || option.receiverKey.toUpperCase() === NUTROOT_NUMS_KEY) return;
     // `E` is present: verifyNutrootRequestTree rejects a receiver-keyed proof without one.
     const E = proof.spend_info?.E as string;
killedBy: wallet.isPaymentRequestSatisfied a blind-me leaf key must carry the payee's own blinding
statusReason: Nutroot request: proof is not keyed to the requested receiver key

[Survived] OptionalChaining
src/wallet/Wallet.ts:2084:18
     if (statics.length === 0 || option.receiverKey.toLowerCase() === NUTROOT_NUMS_KEY) return;
     // `E` is present: verifyNutrootRequestTree rejects a receiver-keyed proof without one.
     const E = proof.spend_info?.E as string;
-    const tree = proof.spend_info?.tree;
+    const tree = proof.spend_info.tree;
     this.failIf(
       !statics.some((priv) => recoverReceiverKeyedSecretKey(proof.secret, E, priv, tree)),

[Killed] BooleanLiteral
src/wallet/Wallet.ts:2086:7
     const E = proof.spend_info?.E as string;
     const tree = proof.spend_info?.tree;
     this.failIf(
-      !statics.some((priv) => recoverReceiverKeyedSecretKey(proof.secret, E, priv, tree)),
+      statics.some(priv => recoverReceiverKeyedSecretKey(proof.secret, E, priv, tree)),
       'Nutroot request: proof is not keyed to the requested receiver key',
     );
killedBy: nutroot edge cases binds blinded owners to their requested conditions with internal key 0279be667ef9dcbbac55a06295ce870b07029bfcdb2dce28d959f2815b16f81798
statusReason: Nutroot request: proof is not keyed to the requested receiver key

[Killed] ArrowFunction
src/wallet/Wallet.ts:2086:21
     const E = proof.spend_info?.E as string;
     const tree = proof.spend_info?.tree;
     this.failIf(
-      !statics.some((priv) => recoverReceiverKeyedSecretKey(proof.secret, E, priv, tree)),
+      !statics.some(() => undefined),
       'Nutroot request: proof is not keyed to the requested receiver key',
     );
killedBy: wallet.isPaymentRequestSatisfied a receiver-keyed nutroot request settles only proofs keyed to the payee
statusReason: Nutroot request: proof is not keyed to the requested receiver key

[Killed] BlockStatement
src/wallet/Wallet.ts:2100:73
    * unlocked bearer secret is no lock at all.
    * @throws If the proof is unlocked, or carries a condition other than the requested one.
    */
-  private assertNut10Lock(requested: P2PKOptions, secret: string): void {
-    let held: P2PKOptions | undefined;
-    try {
-      const [kind, data] = parseSecret(secret);
-      held = nut10ToP2PKOptions({ kind, data: data.data, tags: data.tags });
-    } catch {
-      held = undefined;
-    }
-    this.failIfNullish(
-      held,
-      'nut10 request: proof does not carry a NUT-10 lock of the requested kind',
-    );
-    this.failIf(
-      JSON.stringify(p2pkOptionsToPRNut10(held)) !==
-        JSON.stringify(p2pkOptionsToPRNut10(requested)),
-      'nut10 request: proof lock is not the requested spending condition',
-    );
-  }
+  private assertNut10Lock(requested: P2PKOptions, secret: string): void {}
 
   /**
killedBy: wallet.isPaymentRequestSatisfied a both-encoded request settles only legacy proofs carrying the requested lock
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/wallet/Wallet.ts:2102:9
    */
   private assertNut10Lock(requested: P2PKOptions, secret: string): void {
     let held: P2PKOptions | undefined;
-    try {
-      const [kind, data] = parseSecret(secret);
-      held = nut10ToP2PKOptions({ kind, data: data.data, tags: data.tags });
-    } catch {
+    try {} catch {
       held = undefined;
     }
killedBy: wallet.isPaymentRequestSatisfied a both-encoded request settles only legacy proofs carrying the requested lock
statusReason: nut10 request: proof does not carry a NUT-10 lock of the requested kind

[Survived] BlockStatement
src/wallet/Wallet.ts:2105:13
     try {
       const [kind, data] = parseSecret(secret);
       held = nut10ToP2PKOptions({ kind, data: data.data, tags: data.tags });
-    } catch {
-      held = undefined;
-    }
+    } catch {}
     this.failIfNullish(
       held,

[Killed] ConditionalExpression
src/wallet/Wallet.ts:2113:7
       'nut10 request: proof does not carry a NUT-10 lock of the requested kind',
     );
     this.failIf(
-      JSON.stringify(p2pkOptionsToPRNut10(held)) !==
-        JSON.stringify(p2pkOptionsToPRNut10(requested)),
+      false,
       'nut10 request: proof lock is not the requested spending condition',
     );
killedBy: wallet.isPaymentRequestSatisfied a both-encoded request settles only legacy proofs carrying the requested lock
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/wallet/Wallet.ts:2113:7
       'nut10 request: proof does not carry a NUT-10 lock of the requested kind',
     );
     this.failIf(
-      JSON.stringify(p2pkOptionsToPRNut10(held)) !==
-        JSON.stringify(p2pkOptionsToPRNut10(requested)),
+      JSON.stringify(p2pkOptionsToPRNut10(held)) === JSON.stringify(p2pkOptionsToPRNut10(requested)),
       'nut10 request: proof lock is not the requested spending condition',
     );
killedBy: wallet.isPaymentRequestSatisfied a both-encoded request settles only legacy proofs carrying the requested lock
statusReason: nut10 request: proof lock is not the requested spending condition

[Killed] BlockStatement
src/wallet/Wallet.ts:2126:76
    * Amounts are unit-less numbers, so a foreign-unit proof would otherwise count toward a total.
    * @throws If any proof's keyset is unknown or belongs to another unit of this mint.
    */
-  private assertProofsInWalletUnit(proofs: Array<Pick<Proof, 'id'>>): void {
-    const badProof = proofs.find((p) => !this._keyChain.isUnitKeyset(p.id));
-    this.failIf(
-      !!badProof,
-      `Proof has unrecognised keyset. '${badProof?.id}' is not a ${this._unit} keyset from this mint`,
-      { id: badProof?.id },
-    );
-  }
+  private assertProofsInWalletUnit(proofs: Array<Pick<Proof, 'id'>>): void {}
 
   /**
killedBy: wallet.isPaymentRequestSatisfied rejects proofs from another unit on the same mint
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/wallet/Wallet.ts:2127:41
    * @throws If any proof's keyset is unknown or belongs to another unit of this mint.
    */
   private assertProofsInWalletUnit(proofs: Array<Pick<Proof, 'id'>>): void {
-    const badProof = proofs.find((p) => !this._keyChain.isUnitKeyset(p.id));
+    const badProof = proofs.find((p) => this._keyChain.isUnitKeyset(p.id));
     this.failIf(
       !!badProof,
killedBy: receive receive Proof[] - happy path
statusReason: Proof has unrecognised keyset. '00bd033559de27d0' is not a sat keyset from this mint

[Killed] ArrowFunction
src/wallet/Wallet.ts:2127:34
    * @throws If any proof's keyset is unknown or belongs to another unit of this mint.
    */
   private assertProofsInWalletUnit(proofs: Array<Pick<Proof, 'id'>>): void {
-    const badProof = proofs.find((p) => !this._keyChain.isUnitKeyset(p.id));
+    const badProof = proofs.find(() => undefined);
     this.failIf(
       !!badProof,
killedBy: wallet.isPaymentRequestSatisfied rejects proofs from another unit on the same mint
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
src/wallet/Wallet.ts:2129:7
   private assertProofsInWalletUnit(proofs: Array<Pick<Proof, 'id'>>): void {
     const badProof = proofs.find((p) => !this._keyChain.isUnitKeyset(p.id));
     this.failIf(
-      !!badProof,
+      !badProof,
       `Proof has unrecognised keyset. '${badProof?.id}' is not a ${this._unit} keyset from this mint`,
       { id: badProof?.id },
killedBy: receive receive Proof[] - happy path
statusReason: Proof has unrecognised keyset. 'undefined' is not a sat keyset from this mint

[Killed] OptionalChaining
src/wallet/Wallet.ts:2130:42
     const badProof = proofs.find((p) => !this._keyChain.isUnitKeyset(p.id));
     this.failIf(
       !!badProof,
-      `Proof has unrecognised keyset. '${badProof?.id}' is not a ${this._unit} keyset from this mint`,
+      `Proof has unrecognised keyset. '${badProof.id}' is not a ${this._unit} keyset from this mint`,
       { id: badProof?.id },
     );
killedBy: wallet.isPaymentRequestSatisfied enforces the net-of-input-fees formula (NUT-18)
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] OptionalChaining
src/wallet/Wallet.ts:2131:13
     this.failIf(
       !!badProof,
       `Proof has unrecognised keyset. '${badProof?.id}' is not a ${this._unit} keyset from this mint`,
-      { id: badProof?.id },
+      { id: badProof.id },
     );
   }
killedBy: wallet.isPaymentRequestSatisfied enforces the net-of-input-fees formula (NUT-18)
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
src/wallet/Wallet.ts:2143:79
    * hash_to_curve(secret)` (NUT-07), so copies sharing a secret are one proof, not two.
    * @throws If two proofs share a secret.
    */
-  private assertNoDuplicateProofs(proofs: Array<Pick<Proof, 'secret'>>): void {
-    const seen = new Set<string>();
-    for (const [i, p] of proofs.entries()) {
-      // Report the position, never the secret: it is the spending material.
-      this.failIf(
-        seen.has(p.secret),
-        `Duplicate proof at index ${i}: each proof may appear only once`,
-        { index: i },
-      );
-      seen.add(p.secret);
-    }
-  }
+  private assertNoDuplicateProofs(proofs: Array<Pick<Proof, 'secret'>>): void {}
 
   /**
killedBy: wallet.isPaymentRequestSatisfied does not count repeated copies of one proof as distinct value
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/wallet/Wallet.ts:2145:44
    */
   private assertNoDuplicateProofs(proofs: Array<Pick<Proof, 'secret'>>): void {
     const seen = new Set<string>();
-    for (const [i, p] of proofs.entries()) {
-      // Report the position, never the secret: it is the spending material.
-      this.failIf(
-        seen.has(p.secret),
-        `Duplicate proof at index ${i}: each proof may appear only once`,
-        { index: i },
-      );
-      seen.add(p.secret);
-    }
+    for (const [i, p] of proofs.entries()) {}
   }
 
killedBy: wallet.isPaymentRequestSatisfied does not count repeated copies of one proof as distinct value
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/wallet/Wallet.ts:2163:60
    * @returns FeePPK {number} The feePPK for the selected proof.
    * @throws Throws an error if the proofs keyset is unknown.
    */
-  private getProofFeePPK(proof: Pick<Proof, 'id'>): number {
-    try {
-      // We need the proof's keyset so use keyChain here
-      // We must NOT fallback to wallet's keyset
-      return this._keyChain.getKeyset(proof.id).fee;
-    } catch (e) {
-      const message = `Could not get fee. No keyset found for keyset id: ${proof.id}`;
-      this._logger.error(message, {
-        e,
-        keychain: this._keyChain.getKeysets(),
-      });
-      throw new CTSError(message, { cause: e });
-    }
-  }
+  private getProofFeePPK(proof: Pick<Proof, 'id'>): number {}
 
   /**
killedBy: wallet.maxSpendableAfterFees returns total minus feeReserve when input fees are zero
statusReason: Unsupported amount input type

[Killed] BlockStatement
src/wallet/Wallet.ts:2164:9
    * @throws Throws an error if the proofs keyset is unknown.
    */
   private getProofFeePPK(proof: Pick<Proof, 'id'>): number {
-    try {
-      // We need the proof's keyset so use keyChain here
-      // We must NOT fallback to wallet's keyset
-      return this._keyChain.getKeyset(proof.id).fee;
-    } catch (e) {
+    try {} catch (e) {
       const message = `Could not get fee. No keyset found for keyset id: ${proof.id}`;
       this._logger.error(message, {
killedBy: wallet.maxSpendableAfterFees returns total minus feeReserve when input fees are zero
statusReason: Unsupported amount input type

[Killed] BlockStatement
src/wallet/Wallet.ts:2168:17
       // We need the proof's keyset so use keyChain here
       // We must NOT fallback to wallet's keyset
       return this._keyChain.getKeyset(proof.id).fee;
-    } catch (e) {
-      const message = `Could not get fee. No keyset found for keyset id: ${proof.id}`;
-      this._logger.error(message, {
-        e,
-        keychain: this._keyChain.getKeysets(),
-      });
-      throw new CTSError(message, { cause: e });
-    }
+    } catch (e) {}
   }
 
killedBy: wallet.maxSpendableAfterFees throws with cause when a proof keyset fee lookup fails
statusReason: expected [Function call] to throw error matching /Could not get fee\. No keyset found f…/ but got 'Unsupported amount input type'

[Killed] StringLiteral
src/wallet/Wallet.ts:2169:23
       // We must NOT fallback to wallet's keyset
       return this._keyChain.getKeyset(proof.id).fee;
     } catch (e) {
-      const message = `Could not get fee. No keyset found for keyset id: ${proof.id}`;
+      const message = ``;
       this._logger.error(message, {
         e,
killedBy: wallet.maxSpendableAfterFees throws with cause when a proof keyset fee lookup fails
statusReason: expected [Function call] to throw error matching /Could not get fee\. No keyset found f…/ but got ''

[Survived] ObjectLiteral
src/wallet/Wallet.ts:2170:35
       return this._keyChain.getKeyset(proof.id).fee;
     } catch (e) {
       const message = `Could not get fee. No keyset found for keyset id: ${proof.id}`;
-      this._logger.error(message, {
-        e,
-        keychain: this._keyChain.getKeysets(),
-      });
+      this._logger.error(message, {});
       throw new CTSError(message, { cause: e });
     }

[Killed] BlockStatement
src/wallet/Wallet.ts:2185:63
    * @param keysetId KeysetId used to lookup `input_fee_ppk`
    * @returns Fee amount.
    */
-  getFeesForKeyset(nInputs: number, keysetId: string): Amount {
-    let feePPK: number;
-    try {
-      // We must NOT fallback to wallet's keyset
-      feePPK = this._keyChain.getKeyset(keysetId).fee;
-    } catch (e) {
-      const message = `No keyset found with ID ${keysetId}`;
-      this._logger.error(message, { e });
-      throw new CTSError(message, { cause: e });
-    }
-    // fee = ceil(nInputs * feePPK / 1000). ceilPercent keeps the product in bigint, so a large
-    // (ingest-bounded) fee cannot lose integer precision the way number math would.
-    return Amount.from(nInputs).ceilPercent(feePPK, 1000);
-  }
+  getFeesForKeyset(nInputs: number, keysetId: string): Amount {}
 
   /**
killedBy: send test send with proofsWeHave
statusReason: Unsupported amount input type

[Killed] BlockStatement
src/wallet/Wallet.ts:2187:9
    */
   getFeesForKeyset(nInputs: number, keysetId: string): Amount {
     let feePPK: number;
-    try {
-      // We must NOT fallback to wallet's keyset
-      feePPK = this._keyChain.getKeyset(keysetId).fee;
-    } catch (e) {
+    try {} catch (e) {
       const message = `No keyset found with ID ${keysetId}`;
       this._logger.error(message, { e });
killedBy: send test send with proofsWeHave
statusReason: ceilPercent: numerator must be a non-negative integer, got undefined

[Killed] BlockStatement
src/wallet/Wallet.ts:2190:17
     try {
       // We must NOT fallback to wallet's keyset
       feePPK = this._keyChain.getKeyset(keysetId).fee;
-    } catch (e) {
-      const message = `No keyset found with ID ${keysetId}`;
-      this._logger.error(message, { e });
-      throw new CTSError(message, { cause: e });
-    }
+    } catch (e) {}
     // fee = ceil(nInputs * feePPK / 1000). ceilPercent keeps the product in bigint, so a large
     // (ingest-bounded) fee cannot lose integer precision the way number math would.
killedBy: wallet.maxSpendableAfterFees throws with cause when a keyset fee lookup fails
statusReason: expected [Function call] to throw error matching /No keyset found with ID 00missingkeys…/ but got 'ceilPercent: numerator must be a non-…'

[Killed] StringLiteral
src/wallet/Wallet.ts:2191:23
       // We must NOT fallback to wallet's keyset
       feePPK = this._keyChain.getKeyset(keysetId).fee;
     } catch (e) {
-      const message = `No keyset found with ID ${keysetId}`;
+      const message = ``;
       this._logger.error(message, { e });
       throw new CTSError(message, { cause: e });
killedBy: wallet.maxSpendableAfterFees throws with cause when a keyset fee lookup fails
statusReason: expected [Function call] to throw error matching /No keyset found with ID 00missingkeys…/ but got ''

[Killed] BlockStatement
src/wallet/Wallet.ts:2213:97
    *   split).
    * @returns The fee, zero when the keyset charges no input fees.
    */
-  getFeesToInclude(amount: AmountLike, opts?: { keysetId?: string; nOutputs?: number }): Amount {
-    const keyset = this.getKeyset(opts?.keysetId);
-    const parsed = this.parseAmount(amount, 'getFeesToInclude', true);
-    const nOutputs = opts?.nOutputs ?? splitAmount(parsed, keyset.keys).length;
-    return Amount.sum(this.receiveFeeAmounts(nOutputs, keyset));
-  }
+  getFeesToInclude(amount: AmountLike, opts?: { keysetId?: string; nOutputs?: number }): Amount {}
 
   /**
killedBy: wallet.getFeesToInclude returns zero when the keyset charges no input fees
statusReason: Cannot read properties of undefined (reading 'isZero')
