[Killed] BlockStatement
src/wallet/Wallet.ts:4094:9
     // bolt11/bolt12 melts never consult the input keyset (no keys, no fee metadata), so an
     // id the mint delisted but still honors must not block the withdrawal: proceed and let
     // the mint judge. Strict mode still refuses; so do non-keyset errors.
-    try {
-      await this._ensureOperableKeysets(
-        proofsToSend.map((p) => p.id),
-        { implicit: true, fetchKeys: false },
-      );
-    } catch (e) {
+    try {} catch (e) {
       if (this._strictCachedKeysets || !(e instanceof UnknownKeysetError)) {
         throw e;
killedBy: send and melt inputs across a rotation prepareMelt repairs a stale snapshot for its input proofs
statusReason: expected '00bd033559de27d0' to be '009a1f293253e41e' // Object.is equality

[Killed] ArrowFunction
src/wallet/Wallet.ts:4096:26
     // the mint judge. Strict mode still refuses; so do non-keyset errors.
     try {
       await this._ensureOperableKeysets(
-        proofsToSend.map((p) => p.id),
+        proofsToSend.map(() => undefined),
         { implicit: true, fetchKeys: false },
       );
killedBy: send and melt inputs across a rotation prepareMelt repairs a stale snapshot for its input proofs
statusReason: expected '00bd033559de27d0' to be '009a1f293253e41e' // Object.is equality

[Killed] BooleanLiteral
src/wallet/Wallet.ts:4097:38
     try {
       await this._ensureOperableKeysets(
         proofsToSend.map((p) => p.id),
-        { implicit: true, fetchKeys: false },
+        { implicit: true, fetchKeys: true },
       );
     } catch (e) {
killedBy: send and melt inputs across a rotation a failing key fetch does not block send or melt inputs
statusReason: Failed to fetch

[Killed] BooleanLiteral
src/wallet/Wallet.ts:4097:21
     try {
       await this._ensureOperableKeysets(
         proofsToSend.map((p) => p.id),
-        { implicit: true, fetchKeys: false },
+        { implicit: false, fetchKeys: false },
       );
     } catch (e) {
killedBy: send and melt inputs across a rotation prepareMelt still refuses a delisted input keyset in strict mode
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/wallet/Wallet.ts:4099:17
         proofsToSend.map((p) => p.id),
         { implicit: true, fetchKeys: false },
       );
-    } catch (e) {
-      if (this._strictCachedKeysets || !(e instanceof UnknownKeysetError)) {
-        throw e;
-      }
-      this._logger.warn('Melt input keyset is not listed by the mint; proceeding anyway', {
-        keyset: e.keysetId,
-      });
-    }
+    } catch (e) {}
 
     // Plain getKeyset: melting needs no new outputs, so an inactive/legacy keyset must not
killedBy: send and melt inputs across a rotation prepareMelt proceeds past a delisted input keyset with a warning
statusReason: expected "warn" to be called with arguments: [ …(2) ]

Number of calls: 0

[Killed] ConditionalExpression
src/wallet/Wallet.ts:4100:11
         { implicit: true, fetchKeys: false },
       );
     } catch (e) {
-      if (this._strictCachedKeysets || !(e instanceof UnknownKeysetError)) {
+      if (true) {
         throw e;
       }
killedBy: send and melt inputs across a rotation prepareMelt proceeds past a delisted input keyset with a warning
statusReason: Keyset '00bd033559de27d0' is not a keyset of this mint

[Killed] BlockStatement
src/wallet/Wallet.ts:4100:76
         { implicit: true, fetchKeys: false },
       );
     } catch (e) {
-      if (this._strictCachedKeysets || !(e instanceof UnknownKeysetError)) {
-        throw e;
-      }
+      if (this._strictCachedKeysets || !(e instanceof UnknownKeysetError)) {}
       this._logger.warn('Melt input keyset is not listed by the mint; proceeding anyway', {
         keyset: e.keysetId,
killedBy: send and melt inputs across a rotation prepareMelt still refuses a delisted input keyset in strict mode
statusReason: expected { method: 'bolt11', …(3) } to be an instance of UnknownKeysetError

[Killed] ObjectLiteral
src/wallet/Wallet.ts:4103:91
       if (this._strictCachedKeysets || !(e instanceof UnknownKeysetError)) {
         throw e;
       }
-      this._logger.warn('Melt input keyset is not listed by the mint; proceeding anyway', {
-        keyset: e.keysetId,
-      });
+      this._logger.warn('Melt input keyset is not listed by the mint; proceeding anyway', {});
     }
 
killedBy: send and melt inputs across a rotation prepareMelt proceeds past a delisted input keyset with a warning
statusReason: expected "warn" to be called with arguments: [ …(2) ]

Received:

  1st warn call:

  [
    "Melt input keyset is not listed by the mint; proceeding anyway",

[Killed] StringLiteral
src/wallet/Wallet.ts:4122:7
     // the extra also becomes NUT-08 change, if melt method allows.
     this.failIf(
       sendAmount.lessThan(meltQuote.amount),
-      'Not enough proofs to cover amount + fee reserve',
+      "",
       {
         sendAmount: sendAmount.toString(),
killedBy: prepareMelt mutants rejects proofs that do not cover the quote amount
statusReason: expected [Function] to throw error including 'Not enough proofs to cover amount + f…' but got ''

[Killed] EqualityOperator
src/wallet/Wallet.ts:4131:9
     const feeReserve = sendAmount.subtract(meltQuote.amount);
 
     // Custom OT is definitive (no extra NUT-08 blanks)
-    if (outputType.type === 'custom') {
+    if (outputType.type !== 'custom') {
       outputData = outputType.data;
     }
killedBy: melt proofs test melt proofs base case
statusReason: Cannot read properties of undefined (reading 'entries')

[Killed] BlockStatement
src/wallet/Wallet.ts:4131:39
     const feeReserve = sendAmount.subtract(meltQuote.amount);
 
     // Custom OT is definitive (no extra NUT-08 blanks)
-    if (outputType.type === 'custom') {
-      outputData = outputType.data;
-    }
+    if (outputType.type === 'custom') {}
 
     // Create NUT-08 blanks for return of melt change (if supported)
killedBy: prepareMelt mutants a custom OutputType is used verbatim, ignoring NUT-08 blank generation
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/wallet/Wallet.ts:4137:14
 
     // Create NUT-08 blanks for return of melt change (if supported)
     // Note: zero amount + zero denomination passes splitAmount validation
-    else if (nut08Change && feeReserve.greaterThan(0)) {
+    else if (false) {
       // Now we actually create outputs the mint must sign: enforce the output policy.
       this.failIf(
killedBy: prepareMelt mutants fires the onCountersReserved callback for deterministic NUT-08 blanks
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] ConditionalExpression
src/wallet/Wallet.ts:4137:14
 
     // Create NUT-08 blanks for return of melt change (if supported)
     // Note: zero amount + zero denomination passes splitAmount validation
-    else if (nut08Change && feeReserve.greaterThan(0)) {
+    else if (true) {
       // Now we actually create outputs the mint must sign: enforce the output policy.
       this.failIf(
killedBy: melt proofs prepareMelt can skip automatic NUT-08 change outputs
statusReason: expected [ OutputData{ …(6) }, …(1) ] to have a length of +0 but got 2

[Killed] BooleanLiteral
src/wallet/Wallet.ts:4140:9
     else if (nut08Change && feeReserve.greaterThan(0)) {
       // Now we actually create outputs the mint must sign: enforce the output policy.
       this.failIf(
-        !keyset.isActive,
+        keyset.isActive,
         'Melt change keyset is inactive. Use an active keyset or set nut08Change: false to forfeit it',
         { keyset: keyset.id },
killedBy: prepareMelt mutants fires the onCountersReserved callback for deterministic NUT-08 blanks
statusReason: Melt change keyset is inactive. Use an active keyset or set nut08Change: false to forfeit it

[Killed] StringLiteral
src/wallet/Wallet.ts:4141:9
       // Now we actually create outputs the mint must sign: enforce the output policy.
       this.failIf(
         !keyset.isActive,
-        'Melt change keyset is inactive. Use an active keyset or set nut08Change: false to forfeit it',
+        "",
         { keyset: keyset.id },
       );
killedBy: melt proofs prepareMelt works on an inactive keyset when no change is created
statusReason: expected [Function] to throw error including 'Melt change keyset is inactive' but got ''

[Survived] ObjectLiteral
src/wallet/Wallet.ts:4142:9
       this.failIf(
         !keyset.isActive,
         'Melt change keyset is inactive. Use an active keyset or set nut08Change: false to forfeit it',
-        { keyset: keyset.id },
+        {},
       );
       keyset = this.getOutputKeyset(keysetId);

[Killed] MethodExpression
src/wallet/Wallet.ts:4147:21
       keyset = this.getOutputKeyset(keysetId);
       // NUT-08 blank outputs: ceil(log2(feeReserve)) blinded messages, at least one.
       // Computed on bigint so a u64-scale reserve cannot lose precision to a float.
-      const count = Math.max(ceilLog2(feeReserve.toBigInt()), 1);
+      const count = Math.min(ceilLog2(feeReserve.toBigInt()), 1);
       const denominations: number[] = new Array<number>(count).fill(0);
       this._logger.debug('Creating NUT-08 blanks for fee reserve', {
killedBy: melt proofs test melt proofs base case
statusReason: Melt completed but its change could not be reconstructed; see cause: a keyset that will load rebuilds via createMeltChangeProofs(), anything else needs a NUT-09 restore

[Survived] StringLiteral
src/wallet/Wallet.ts:4149:26
       // Computed on bigint so a u64-scale reserve cannot lose precision to a float.
       const count = Math.max(ceilLog2(feeReserve.toBigInt()), 1);
       const denominations: number[] = new Array<number>(count).fill(0);
-      this._logger.debug('Creating NUT-08 blanks for fee reserve', {
+      this._logger.debug("", {
         feeReserve: feeReserve,
         denominations,

[Killed] ConditionalExpression
src/wallet/Wallet.ts:4159:11
       // and the counter is zero (auto-assign)
       const autoCounters = await this.addCountersToOutputTypes(keyset.id, meltOT);
       [meltOT] = autoCounters.outputTypes;
-      if (autoCounters.used) {
+      if (false) {
         this.safeCallback(onCountersReserved, autoCounters.used, { op: 'meltProofs' });
       }
killedBy: prepareMelt mutants fires the onCountersReserved callback for deterministic NUT-08 blanks
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Number of calls: 0

[Killed] ConditionalExpression
src/wallet/Wallet.ts:4159:11
       // and the counter is zero (auto-assign)
       const autoCounters = await this.addCountersToOutputTypes(keyset.id, meltOT);
       [meltOT] = autoCounters.outputTypes;
-      if (autoCounters.used) {
+      if (true) {
         this.safeCallback(onCountersReserved, autoCounters.used, { op: 'meltProofs' });
       }
killedBy: prepareMelt mutants random-policy wallet does not reserve counters (no onCountersReserved)
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received:

  1st vi.fn() call:

    Array [
      undefined,

[Killed] ConditionalExpression
src/wallet/Wallet.ts:4175:9
     const meltPreview: MeltPreview<TQuote> = {
       method,
       inputs:
-        preimage === undefined ? normalizedProofs : attachHTLCPreimage(normalizedProofs, preimage),
+        true ? normalizedProofs : attachHTLCPreimage(normalizedProofs, preimage),
       outputData,
       quote: meltQuote,
killedBy: melt proofs melt with a preimage stamps the HTLC inputs
statusReason: "undefined" is not valid JSON

[Killed] EqualityOperator
src/wallet/Wallet.ts:4175:9
     const meltPreview: MeltPreview<TQuote> = {
       method,
       inputs:
-        preimage === undefined ? normalizedProofs : attachHTLCPreimage(normalizedProofs, preimage),
+        preimage !== undefined ? normalizedProofs : attachHTLCPreimage(normalizedProofs, preimage),
       outputData,
       quote: meltQuote,
killedBy: nutroot edge cases rejects independently blinded duplicate custom melt secrets on v3
statusReason: Preimage must be a 64 character hexadecimal string (32 bytes).

[Killed] LogicalOperator
src/wallet/Wallet.ts:4203:50
     privkey?: string | string[],
     options?: CompleteMeltOptions,
   ): Promise<MeltProofsResponse<TQuote>> {
-    const completeOptions: CompleteMeltOptions = options ?? {};
+    const completeOptions: CompleteMeltOptions = options && {};
 
     this.assertUniqueOutputSecrets(meltPreview.outputData);
killedBy: melt change across a rotation completeMelt reconstructs change on a keyset it holds keyless
statusReason: Cannot read properties of undefined (reading 'extraPayload')

[Killed] CallExpression
src/wallet/Wallet.ts:4205:5
   ): Promise<MeltProofsResponse<TQuote>> {
     const completeOptions: CompleteMeltOptions = options ?? {};
 
-    this.assertUniqueOutputSecrets(meltPreview.outputData);
+    ;
 
     // Extract vars from MeltPreview
killedBy: nutroot edge cases rejects independently blinded duplicate custom melt secrets on v3
statusReason: expected [Function] to throw error matching /Duplicate output secret/ but got 'fetch failed'

[Killed] ArrowFunction
src/wallet/Wallet.ts:4209:48
 
     // Extract vars from MeltPreview
     let inputs = meltPreview.inputs;
-    const outputs = meltPreview.outputData.map((d) => d.blindedMessage);
+    const outputs = meltPreview.outputData.map(() => undefined);
     const quote = meltPreview.quote.quote;
 
killedBy: melt proofs melt, NUT-08 blanks includes zero-amount blanks covering fee reserve (bolt11)
statusReason: Cannot read properties of null (reading 'amount')

[Killed] ConditionalExpression
src/wallet/Wallet.ts:4213:9
     const quote = meltPreview.quote.quote;
 
     // Sign proofs if needed
-    if (privkey) {
+    if (false) {
       inputs = this.signP2PKProofs(inputs, privkey, meltPreview.outputData, quote);
     }
killedBy: generic mint/melt methods wallet.meltProofs meltProofsOnchain signs SIG_ALL proofs with outputs and quote id
statusReason: expected "signP2PKProofs" to be called with arguments: [ Any<Array>, 'privkey', …(2) ]

Number of calls: 0

[Killed] BlockStatement
src/wallet/Wallet.ts:4213:18
     const quote = meltPreview.quote.quote;
 
     // Sign proofs if needed
-    if (privkey) {
-      inputs = this.signP2PKProofs(inputs, privkey, meltPreview.outputData, quote);
-    }
+    if (privkey) {}
 
     // Prepare proofs for mint
killedBy: generic mint/melt methods wallet.meltProofs meltProofsOnchain signs SIG_ALL proofs with outputs and quote id
statusReason: expected "signP2PKProofs" to be called with arguments: [ Any<Array>, 'privkey', …(2) ]

Number of calls: 0

[Killed] ConditionalExpression
src/wallet/Wallet.ts:4222:9
 
     // Construct melt payload. Extension fields must not clobber the prepared request.
     const extra = completeOptions.extraPayload;
-    if (extra) {
+    if (true) {
       // Object.keys mirrors what the spread below copies (own enumerable keys).
       const owned = ['quote', 'inputs', 'outputs', 'prefer_async'];
killedBy: melt proofs test melt proofs base case
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
src/wallet/Wallet.ts:4222:16
 
     // Construct melt payload. Extension fields must not clobber the prepared request.
     const extra = completeOptions.extraPayload;
-    if (extra) {
-      // Object.keys mirrors what the spread below copies (own enumerable keys).
-      const owned = ['quote', 'inputs', 'outputs', 'prefer_async'];
-      const reserved = Object.keys(extra).filter((k) => owned.includes(k));
-      this.failIf(reserved.length > 0, 'extraPayload cannot override reserved melt fields', {
-        reserved,
-      });
-    }
+    if (extra) {}
     const meltPayload: MeltRequest = {
       quote,
killedBy: async melt preference body completeMelt rejects extraPayload keys that collide with the prepared request
statusReason: expected [Function] to throw error matching /reserved melt fields/ but got '[MSW] Cannot bypass a request when us…'

[Killed] StringLiteral
src/wallet/Wallet.ts:4224:52
     const extra = completeOptions.extraPayload;
     if (extra) {
       // Object.keys mirrors what the spread below copies (own enumerable keys).
-      const owned = ['quote', 'inputs', 'outputs', 'prefer_async'];
+      const owned = ['quote', 'inputs', 'outputs', ""];
       const reserved = Object.keys(extra).filter((k) => owned.includes(k));
       this.failIf(reserved.length > 0, 'extraPayload cannot override reserved melt fields', {
killedBy: async melt preference body completeMelt rejects extraPayload keys that collide with the prepared request
statusReason: expected [Function] to throw error matching /reserved melt fields/ but got '[MSW] Cannot bypass a request when us…'

[Killed] StringLiteral
src/wallet/Wallet.ts:4224:41
     const extra = completeOptions.extraPayload;
     if (extra) {
       // Object.keys mirrors what the spread below copies (own enumerable keys).
-      const owned = ['quote', 'inputs', 'outputs', 'prefer_async'];
+      const owned = ['quote', 'inputs', "", 'prefer_async'];
       const reserved = Object.keys(extra).filter((k) => owned.includes(k));
       this.failIf(reserved.length > 0, 'extraPayload cannot override reserved melt fields', {
killedBy: async melt preference body completeMelt rejects extraPayload keys that collide with the prepared request
statusReason: expected [Function] to throw error matching /reserved melt fields/ but got '[MSW] Cannot bypass a request when us…'

[Killed] MethodExpression
src/wallet/Wallet.ts:4225:24
     if (extra) {
       // Object.keys mirrors what the spread below copies (own enumerable keys).
       const owned = ['quote', 'inputs', 'outputs', 'prefer_async'];
-      const reserved = Object.keys(extra).filter((k) => owned.includes(k));
+      const reserved = Object.keys(extra);
       this.failIf(reserved.length > 0, 'extraPayload cannot override reserved melt fields', {
         reserved,
killedBy: async melt preference body completeMelt forwards non-reserved extraPayload fields
statusReason: extraPayload cannot override reserved melt fields

[Killed] ArrowFunction
src/wallet/Wallet.ts:4225:50
     if (extra) {
       // Object.keys mirrors what the spread below copies (own enumerable keys).
       const owned = ['quote', 'inputs', 'outputs', 'prefer_async'];
-      const reserved = Object.keys(extra).filter((k) => owned.includes(k));
+      const reserved = Object.keys(extra).filter(() => undefined);
       this.failIf(reserved.length > 0, 'extraPayload cannot override reserved melt fields', {
         reserved,
killedBy: async melt preference body completeMelt rejects extraPayload keys that collide with the prepared request
statusReason: expected [Function] to throw error matching /reserved melt fields/ but got '[MSW] Cannot bypass a request when us…'

[Killed] ConditionalExpression
src/wallet/Wallet.ts:4226:19
       // Object.keys mirrors what the spread below copies (own enumerable keys).
       const owned = ['quote', 'inputs', 'outputs', 'prefer_async'];
       const reserved = Object.keys(extra).filter((k) => owned.includes(k));
-      this.failIf(reserved.length > 0, 'extraPayload cannot override reserved melt fields', {
+      this.failIf(true, 'extraPayload cannot override reserved melt fields', {
         reserved,
       });
killedBy: async melt preference body completeMelt forwards non-reserved extraPayload fields
statusReason: extraPayload cannot override reserved melt fields

[Killed] EqualityOperator
src/wallet/Wallet.ts:4226:19
       // Object.keys mirrors what the spread below copies (own enumerable keys).
       const owned = ['quote', 'inputs', 'outputs', 'prefer_async'];
       const reserved = Object.keys(extra).filter((k) => owned.includes(k));
-      this.failIf(reserved.length > 0, 'extraPayload cannot override reserved melt fields', {
+      this.failIf(reserved.length <= 0, 'extraPayload cannot override reserved melt fields', {
         reserved,
       });
killedBy: async melt preference body completeMelt rejects extraPayload keys that collide with the prepared request
statusReason: expected [Function] to throw error matching /reserved melt fields/ but got '[MSW] Cannot bypass a request when us…'

[Killed] ObjectLiteral
src/wallet/Wallet.ts:4230:38
         reserved,
       });
     }
-    const meltPayload: MeltRequest = {
-      quote,
-      inputs,
-      outputs,
-      ...(completeOptions.preferAsync ? { prefer_async: true } : {}),
-      ...extra,
-    };
+    const meltPayload: MeltRequest = {};
 
     // Attach nutroot transaction witnesses (v3 keysets). The digest binds the quote amount,
killedBy: melt proofs test melt proofs base case
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] BooleanLiteral
src/wallet/Wallet.ts:4234:57
       quote,
       inputs,
       outputs,
-      ...(completeOptions.preferAsync ? { prefer_async: true } : {}),
+      ...(completeOptions.preferAsync ? { prefer_async: false } : {}),
       ...extra,
     };
killedBy: async melt preference body completeMelt sends prefer_async when { preferAsync: true } is passed
statusReason: HTTP request failed

[Killed] EqualityOperator
src/wallet/Wallet.ts:4243:7
     const quoteAmount =
       'amount' in meltPreview.quote ? (meltPreview.quote.amount as AmountLike) : undefined;
     this.failIf(
-      quoteAmount === undefined &&
+      quoteAmount !== undefined &&
         inputs.some((p) => isBlsKeyset(p.id) && isV3PointSecret(p.secret)),
       'melting v3 inputs needs the melt quote amount; pass the full quote object',
killedBy: async melt preference body completeMelt refuses v3 inputs when the quote amount is unknown
statusReason: expected [Function] to throw error matching /quote amount/ but got '[MSW] Cannot bypass a request when us…'

[Killed] ConditionalExpression
src/wallet/Wallet.ts:4243:7
     const quoteAmount =
       'amount' in meltPreview.quote ? (meltPreview.quote.amount as AmountLike) : undefined;
     this.failIf(
-      quoteAmount === undefined &&
-        inputs.some((p) => isBlsKeyset(p.id) && isV3PointSecret(p.secret)),
+      false,
       'melting v3 inputs needs the melt quote amount; pass the full quote object',
     );
killedBy: async melt preference body completeMelt refuses v3 inputs when the quote amount is unknown
statusReason: expected [Function] to throw error matching /quote amount/ but got '[MSW] Cannot bypass a request when us…'

[Killed] ArrowFunction
src/wallet/Wallet.ts:4244:21
       'amount' in meltPreview.quote ? (meltPreview.quote.amount as AmountLike) : undefined;
     this.failIf(
       quoteAmount === undefined &&
-        inputs.some((p) => isBlsKeyset(p.id) && isV3PointSecret(p.secret)),
+        inputs.some(() => undefined),
       'melting v3 inputs needs the melt quote amount; pass the full quote object',
     );
killedBy: async melt preference body completeMelt refuses v3 inputs when the quote amount is unknown
statusReason: expected [Function] to throw error matching /quote amount/ but got '[MSW] Cannot bypass a request when us…'

[Killed] ConditionalExpression
src/wallet/Wallet.ts:4244:28
       'amount' in meltPreview.quote ? (meltPreview.quote.amount as AmountLike) : undefined;
     this.failIf(
       quoteAmount === undefined &&
-        inputs.some((p) => isBlsKeyset(p.id) && isV3PointSecret(p.secret)),
+        inputs.some((p) => false),
       'melting v3 inputs needs the melt quote amount; pass the full quote object',
     );
killedBy: async melt preference body completeMelt refuses v3 inputs when the quote amount is unknown
statusReason: expected [Function] to throw error matching /quote amount/ but got '[MSW] Cannot bypass a request when us…'

[Survived] EqualityOperator
src/wallet/Wallet.ts:4248:9
       'melting v3 inputs needs the melt quote amount; pass the full quote object',
     );
     let receipts: SpendReceipt[] = [];
-    if (quoteAmount !== undefined) {
+    if (quoteAmount === undefined) {
       receipts = await attachTransactionWitnesses(
         meltPayload,

[Survived] ConditionalExpression
src/wallet/Wallet.ts:4248:9
       'melting v3 inputs needs the melt quote amount; pass the full quote object',
     );
     let receipts: SpendReceipt[] = [];
-    if (quoteAmount !== undefined) {
+    if (false) {
       receipts = await attachTransactionWitnesses(
         meltPayload,

[Killed] OptionalChaining
src/wallet/Wallet.ts:4253:9
         meltPayload,
         { quoteId: quote, amount: Amount.from(quoteAmount) },
         collectSpendInfoKeys(meltPreview.inputs, privkey, this._logger),
-        completeOptions.scriptPath?.length
+        completeOptions.scriptPath.length
           ? prepareScriptPathSpends(
               meltPreview.inputs,
killedBy: melt proofs test melt proofs base case
statusReason: Cannot read properties of undefined (reading 'length')

[NoCoverage] EqualityOperator
src/wallet/Wallet.ts:4257:15
           ? prepareScriptPathSpends(
               meltPreview.inputs,
               completeOptions.scriptPath,
-              privkey === undefined ? [] : [privkey].flat(),
+              privkey !== undefined ? [] : [privkey].flat(),
             )
           : undefined,

[NoCoverage] ConditionalExpression
src/wallet/Wallet.ts:4257:15
           ? prepareScriptPathSpends(
               meltPreview.inputs,
               completeOptions.scriptPath,
-              privkey === undefined ? [] : [privkey].flat(),
+              false ? [] : [privkey].flat(),
             )
           : undefined,

[Killed] ArrowFunction
src/wallet/Wallet.ts:4265:82
     }
 
     // Execute melt and validate result
-    const meltResponse: MeltQuoteBaseResponse = await this.withStaleKeysetRepair(() =>
-      this.mint.melt<TQuote>(meltPreview.method, meltPayload),
+    const meltResponse: MeltQuoteBaseResponse = await this.withStaleKeysetRepair(() => undefined,
     );
 
killedBy: melt proofs test melt proofs base case
statusReason: Cannot read properties of undefined (reading 'change')

[Killed] ObjectLiteral
src/wallet/Wallet.ts:4270:25
     );
 
     // Merge preview quote with response to protect against incomplete response.
-    const mergedQuote = { ...meltPreview.quote, ...meltResponse };
+    const mergedQuote = {};
 
     // Create any change Proofs. The spec is silent on which keyset settles change after a
killedBy: melt proofs test melt proofs base case
statusReason: expected undefined to be 'PAID' // Object.is equality

[Killed] LogicalOperator
src/wallet/Wallet.ts:4275:24
     // Create any change Proofs. The spec is silent on which keyset settles change after a
     // rotation, so take the keyset each signature names. The inputs are spent by now, so a
     // failure here must hand back what recovery needs.
-    const changeSigs = meltResponse.change ?? [];
+    const changeSigs = meltResponse.change && [];
     let change: Proof[];
     try {
killedBy: melt proofs test melt proofs base case
statusReason: expected [] to have a length of 2 but got +0

[Killed] BlockStatement
src/wallet/Wallet.ts:4277:9
     // failure here must hand back what recovery needs.
     const changeSigs = meltResponse.change ?? [];
     let change: Proof[];
-    try {
-      if (changeSigs.length > 0) {
-        await this._ensureOperableKeysets(
-          changeSigs.filter((s) => !s.amount.isZero()).map((s) => s.id),
-          { implicit: true },
-        );
-      }
-      change = this.createMeltChangeProofs(meltPreview.outputData, changeSigs);
-    } catch (e) {
+    try {} catch (e) {
       throw new MeltChangeError(meltPreview.outputData, mergedQuote, { cause: e });
     }
killedBy: melt proofs test melt proofs base case
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/wallet/Wallet.ts:4278:34
     const changeSigs = meltResponse.change ?? [];
     let change: Proof[];
     try {
-      if (changeSigs.length > 0) {
-        await this._ensureOperableKeysets(
-          changeSigs.filter((s) => !s.amount.isZero()).map((s) => s.id),
-          { implicit: true },
-        );
-      }
+      if (changeSigs.length > 0) {}
       change = this.createMeltChangeProofs(meltPreview.outputData, changeSigs);
     } catch (e) {
killedBy: melt change across a rotation completeMelt reconstructs change on a keyset it holds keyless
statusReason: Melt completed but its change could not be reconstructed; see cause: a keyset that will load rebuilds via createMeltChangeProofs(), anything else needs a NUT-09 restore

[Killed] ConditionalExpression
src/wallet/Wallet.ts:4278:11
     const changeSigs = meltResponse.change ?? [];
     let change: Proof[];
     try {
-      if (changeSigs.length > 0) {
+      if (false) {
         await this._ensureOperableKeysets(
           changeSigs.filter((s) => !s.amount.isZero()).map((s) => s.id),
killedBy: melt change across a rotation completeMelt reconstructs change on a keyset it holds keyless
statusReason: Melt completed but its change could not be reconstructed; see cause: a keyset that will load rebuilds via createMeltChangeProofs(), anything else needs a NUT-09 restore

[Killed] ArrowFunction
src/wallet/Wallet.ts:4280:29
     try {
       if (changeSigs.length > 0) {
         await this._ensureOperableKeysets(
-          changeSigs.filter((s) => !s.amount.isZero()).map((s) => s.id),
+          changeSigs.filter(() => undefined).map((s) => s.id),
           { implicit: true },
         );
killedBy: melt change across a rotation completeMelt reconstructs change on a keyset it holds keyless
statusReason: Melt completed but its change could not be reconstructed; see cause: a keyset that will load rebuilds via createMeltChangeProofs(), anything else needs a NUT-09 restore
