[Killed] ConditionalExpression
src/wallet/nutroot.ts:83:49
   scriptSpends: Map<string, ScriptPathSpend> | undefined,
   state: NutrootWalletState,
 ): Promise<SpendReceipt[]> {
-  const v3Inputs = payload.inputs.filter((p) => isBlsKeyset(p.id) && isV3PointSecret(p.secret));
+  const v3Inputs = payload.inputs.filter((p) => false);
   if (v3Inputs.length === 0) return [];
   // Each input signs its own input digest over the shared transcript (NUT-10).
killedBy: attachTransactionWitnesses falls back to extraKeys, which carry the keys proofs hold in spend info
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/wallet/nutroot.ts:83:49
   scriptSpends: Map<string, ScriptPathSpend> | undefined,
   state: NutrootWalletState,
 ): Promise<SpendReceipt[]> {
-  const v3Inputs = payload.inputs.filter((p) => isBlsKeyset(p.id) && isV3PointSecret(p.secret));
+  const v3Inputs = payload.inputs.filter((p) => true);
   if (v3Inputs.length === 0) return [];
   // Each input signs its own input digest over the shared transcript (NUT-10).
killedBy: mint rejection as rotation evidence receive heals the snapshot and succeeds when the caller runs it again
statusReason: expected CTSError: No key to sign a v3 input: its … to be an instance of StaleKeysetError

[Killed] EqualityOperator
src/wallet/nutroot.ts:84:7
   state: NutrootWalletState,
 ): Promise<SpendReceipt[]> {
   const v3Inputs = payload.inputs.filter((p) => isBlsKeyset(p.id) && isV3PointSecret(p.secret));
-  if (v3Inputs.length === 0) return [];
+  if (v3Inputs.length !== 0) return [];
   // Each input signs its own input digest over the shared transcript (NUT-10).
   const { transactionMessage, proofs: inputContexts } = inputsForPayload({
killedBy: attachTransactionWitnesses falls back to extraKeys, which carry the keys proofs hold in spend info
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/wallet/nutroot.ts:84:7
   state: NutrootWalletState,
 ): Promise<SpendReceipt[]> {
   const v3Inputs = payload.inputs.filter((p) => isBlsKeyset(p.id) && isV3PointSecret(p.secret));
-  if (v3Inputs.length === 0) return [];
+  if (true) return [];
   // Each input signs its own input digest over the shared transcript (NUT-10).
   const { transactionMessage, proofs: inputContexts } = inputsForPayload({
killedBy: attachTransactionWitnesses falls back to extraKeys, which carry the keys proofs hold in spend info
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/wallet/nutroot.ts:86:74
   const v3Inputs = payload.inputs.filter((p) => isBlsKeyset(p.id) && isV3PointSecret(p.secret));
   if (v3Inputs.length === 0) return [];
   // Each input signs its own input digest over the shared transcript (NUT-10).
-  const { transactionMessage, proofs: inputContexts } = inputsForPayload({
-    inputs: payload.inputs,
-    outputs: payload.outputs ?? [],
-    ...(meltQuote && { meltQuote }),
-  });
+  const { transactionMessage, proofs: inputContexts } = inputsForPayload({});
   // Script path spends first: they name their own leaf, so they take precedence over the key
   // path even where both are available. Everything but the signature was settled before the
killedBy: attachTransactionWitnesses falls back to extraKeys, which carry the keys proofs hold in spend info
statusReason: Transaction requires at least one input

[Killed] LogicalOperator
src/wallet/nutroot.ts:88:14
   // Each input signs its own input digest over the shared transcript (NUT-10).
   const { transactionMessage, proofs: inputContexts } = inputsForPayload({
     inputs: payload.inputs,
-    outputs: payload.outputs ?? [],
+    outputs: payload.outputs && [],
     ...(meltQuote && { meltQuote }),
   });
killedBy: attachTransactionWitnesses falls back to extraKeys, which carry the keys proofs hold in spend info
statusReason: Transaction requires at least one output

[NoCoverage] ArrayDeclaration
src/wallet/nutroot.ts:88:33
   // Each input signs its own input digest over the shared transcript (NUT-10).
   const { transactionMessage, proofs: inputContexts } = inputsForPayload({
     inputs: payload.inputs,
-    outputs: payload.outputs ?? [],
+    outputs: payload.outputs ?? ["Stryker was here"],
     ...(meltQuote && { meltQuote }),
   });

[Killed] LogicalOperator
src/wallet/nutroot.ts:89:9
   const { transactionMessage, proofs: inputContexts } = inputsForPayload({
     inputs: payload.inputs,
     outputs: payload.outputs ?? [],
-    ...(meltQuote && { meltQuote }),
+    ...(meltQuote || {
+  meltQuote
+}),
   });
   // Script path spends first: they name their own leaf, so they take precedence over the key
killedBy: attachTransactionWitnesses a melt quote is part of the signed transcript
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/wallet/nutroot.ts:89:9
   const { transactionMessage, proofs: inputContexts } = inputsForPayload({
     inputs: payload.inputs,
     outputs: payload.outputs ?? [],
-    ...(meltQuote && { meltQuote }),
+    ...(false),
   });
   // Script path spends first: they name their own leaf, so they take precedence over the key
killedBy: attachTransactionWitnesses a melt quote is part of the signed transcript
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/wallet/nutroot.ts:94:33
   // Script path spends first: they name their own leaf, so they take precedence over the key
   // path even where both are available. Everything but the signature was settled before the
   // request was built; only the digest was missing, and now it is not.
-  for (const [secret, spend] of scriptSpends ?? []) {
+  for (const [secret, spend] of scriptSpends && []) {
     const input = payload.inputs.find((p) => p.secret === secret && isBlsKeyset(p.id));
     if (!input) {
killedBy: attachTransactionWitnesses falls back to extraKeys, which carry the keys proofs hold in spend info
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] LogicalOperator
src/wallet/nutroot.ts:95:46
   // path even where both are available. Everything but the signature was settled before the
   // request was built; only the digest was missing, and now it is not.
   for (const [secret, spend] of scriptSpends ?? []) {
-    const input = payload.inputs.find((p) => p.secret === secret && isBlsKeyset(p.id));
+    const input = payload.inputs.find((p) => p.secret === secret || isBlsKeyset(p.id));
     if (!input) {
       fail('Script path plan names a secret not in this transaction', state.logger);
killedBy: attachTransactionWitnesses verifySpendReceipt checks a receipt against the proof, key path and script path
statusReason: No key to sign a v3 input: its spend info holds neither a bearer key nor an ephemeral this wallet can derive from; a proof that lost its spend info is recovered with a NUT-09 restore

[Killed] ConditionalExpression
src/wallet/nutroot.ts:95:46
   // path even where both are available. Everything but the signature was settled before the
   // request was built; only the digest was missing, and now it is not.
   for (const [secret, spend] of scriptSpends ?? []) {
-    const input = payload.inputs.find((p) => p.secret === secret && isBlsKeyset(p.id));
+    const input = payload.inputs.find((p) => false);
     if (!input) {
       fail('Script path plan names a secret not in this transaction', state.logger);
killedBy: attachTransactionWitnesses verifySpendReceipt checks a receipt against the proof, key path and script path
statusReason: Script path plan names a secret not in this transaction

[Killed] ConditionalExpression
src/wallet/nutroot.ts:96:9
   // request was built; only the digest was missing, and now it is not.
   for (const [secret, spend] of scriptSpends ?? []) {
     const input = payload.inputs.find((p) => p.secret === secret && isBlsKeyset(p.id));
-    if (!input) {
+    if (true) {
       fail('Script path plan names a secret not in this transaction', state.logger);
     }
killedBy: attachTransactionWitnesses verifySpendReceipt checks a receipt against the proof, key path and script path
statusReason: Script path plan names a secret not in this transaction

[Killed] BooleanLiteral
src/wallet/nutroot.ts:96:9
   // request was built; only the digest was missing, and now it is not.
   for (const [secret, spend] of scriptSpends ?? []) {
     const input = payload.inputs.find((p) => p.secret === secret && isBlsKeyset(p.id));
-    if (!input) {
+    if (input) {
       fail('Script path plan names a secret not in this transaction', state.logger);
     }
killedBy: attachTransactionWitnesses verifySpendReceipt checks a receipt against the proof, key path and script path
statusReason: Script path plan names a secret not in this transaction

[Killed] StringLiteral
src/wallet/nutroot.ts:97:12
   for (const [secret, spend] of scriptSpends ?? []) {
     const input = payload.inputs.find((p) => p.secret === secret && isBlsKeyset(p.id));
     if (!input) {
-      fail('Script path plan names a secret not in this transaction', state.logger);
+      fail("", state.logger);
     }
     const { digest, inputContainer } = inputContexts.get(
killedBy: attachTransactionWitnesses a script spend naming a secret outside the transaction fails
statusReason: expected [Function] to throw error matching /not in this transaction/ but got ''

[Killed] ArrowFunction
src/wallet/nutroot.ts:102:33
     const { digest, inputContainer } = inputContexts.get(
       proofInputContextKey({ keysetId: input.id, secret: input.secret }),
     )!;
-    const mine = spend.keys.map((k: string) => schnorrSignDigest(digest, k));
+    const mine = spend.keys.map(() => undefined);
     // The co-signer sees the digest only now, which is why it is a hook and not a signature the
     // caller could have supplied up front: the digest covers the outputs, and those are only
killedBy: attachTransactionWitnesses verifySpendReceipt checks a receipt against the proof, key path and script path
statusReason: Script path leaf needs 1 valid signatures, 0 produced

[Killed] ObjectLiteral
src/wallet/nutroot.ts:107:28
     // caller could have supplied up front: the digest covers the outputs, and those are only
     // fixed (and ordered) once the transaction is built.
     const theirs = spend.cosign
-      ? await spend.cosign({
-          digest,
-          transactionMessage,
-          inputContainer,
-          leaf: spend.leaf,
-        })
+      ? await spend.cosign({})
       : [];
     const signatures = selectRequiredLeafSignatures(spend.leaf, digest, [
killedBy: attachTransactionWitnesses the cosigner is handed the transcript the digest was hashed from
statusReason: "message" expected Uint8Array, got type=undefined

[Killed] ArrowFunction
src/wallet/nutroot.ts:116:21
       : [];
     const signatures = selectRequiredLeafSignatures(spend.leaf, digest, [
       ...mine,
-      ...theirs.map((sig: string) => sig.toLowerCase()),
+      ...theirs.map(() => undefined),
     ]);
     input.witness = buildScriptPathWitness(
killedBy: attachTransactionWitnesses the cosigner is handed the transcript the digest was hashed from
statusReason: Script path leaf needs 2 valid signatures, 1 produced

[Survived] MethodExpression
src/wallet/nutroot.ts:116:38
       : [];
     const signatures = selectRequiredLeafSignatures(spend.leaf, digest, [
       ...mine,
-      ...theirs.map((sig: string) => sig.toLowerCase()),
+      ...theirs.map((sig: string) => sig.toUpperCase()),
     ]);
     input.witness = buildScriptPathWitness(

[Killed] BlockStatement
src/wallet/nutroot.ts:126:33
       spend.preimage,
     );
   }
-  for (const input of v3Inputs) {
-    if (input.witness) continue; // pre-built witness (e.g. script path): leave it alone
-    const secretKey = extraKeys?.get(input.secret);
-    const context = inputContexts.get(
-      proofInputContextKey({ keysetId: input.id, secret: input.secret }),
-    );
-    if (secretKey && context) input.witness = signTransactionInput(context.digest, secretKey);
-  }
+  for (const input of v3Inputs) {}
   // Every v3 input signs (NUT-10), so an unsigned one is a request the mint will refuse.
   // Say which proof and why here, rather than letting it come back as a witness error naming
killedBy: attachTransactionWitnesses falls back to extraKeys, which carry the keys proofs hold in spend info
statusReason: No key to sign a v3 input: its spend info holds neither a bearer key nor an ephemeral this wallet can derive from; a proof that lost its spend info is recovered with a NUT-09 restore

[Killed] ConditionalExpression
src/wallet/nutroot.ts:127:9
     );
   }
   for (const input of v3Inputs) {
-    if (input.witness) continue; // pre-built witness (e.g. script path): leave it alone
+    if (true) continue; // pre-built witness (e.g. script path): leave it alone
     const secretKey = extraKeys?.get(input.secret);
     const context = inputContexts.get(
killedBy: attachTransactionWitnesses falls back to extraKeys, which carry the keys proofs hold in spend info
statusReason: No key to sign a v3 input: its spend info holds neither a bearer key nor an ephemeral this wallet can derive from; a proof that lost its spend info is recovered with a NUT-09 restore

[Killed] ConditionalExpression
src/wallet/nutroot.ts:127:9
     );
   }
   for (const input of v3Inputs) {
-    if (input.witness) continue; // pre-built witness (e.g. script path): leave it alone
+    if (false) continue; // pre-built witness (e.g. script path): leave it alone
     const secretKey = extraKeys?.get(input.secret);
     const context = inputContexts.get(
killedBy: attachTransactionWitnesses a pre-built witness is left alone
statusReason: expected '{"signatures":["dd16d33ea0611fa73b6be…' to be 'pre-built' // Object.is equality

[Killed] OptionalChaining
src/wallet/nutroot.ts:128:23
   }
   for (const input of v3Inputs) {
     if (input.witness) continue; // pre-built witness (e.g. script path): leave it alone
-    const secretKey = extraKeys?.get(input.secret);
+    const secretKey = extraKeys.get(input.secret);
     const context = inputContexts.get(
       proofInputContextKey({ keysetId: input.id, secret: input.secret }),
killedBy: attachTransactionWitnesses an unsignable v3 input fails loudly instead of reaching the mint
statusReason: expected [Function] to throw error matching /No key to sign a v3 input/ but got 'Cannot read properties of undefined (…'

[Killed] LogicalOperator
src/wallet/nutroot.ts:132:9
     const context = inputContexts.get(
       proofInputContextKey({ keysetId: input.id, secret: input.secret }),
     );
-    if (secretKey && context) input.witness = signTransactionInput(context.digest, secretKey);
+    if (secretKey || context) input.witness = signTransactionInput(context.digest, secretKey);
   }
   // Every v3 input signs (NUT-10), so an unsigned one is a request the mint will refuse.
killedBy: attachTransactionWitnesses an unsignable v3 input fails loudly instead of reaching the mint
statusReason: expected [Function] to throw error matching /No key to sign a v3 input/ but got '"secretKey" expected Uint8Array of le…'

[Killed] ConditionalExpression
src/wallet/nutroot.ts:132:9
     const context = inputContexts.get(
       proofInputContextKey({ keysetId: input.id, secret: input.secret }),
     );
-    if (secretKey && context) input.witness = signTransactionInput(context.digest, secretKey);
+    if (false) input.witness = signTransactionInput(context.digest, secretKey);
   }
   // Every v3 input signs (NUT-10), so an unsigned one is a request the mint will refuse.
killedBy: attachTransactionWitnesses falls back to extraKeys, which carry the keys proofs hold in spend info
statusReason: No key to sign a v3 input: its spend info holds neither a bearer key nor an ephemeral this wallet can derive from; a proof that lost its spend info is recovered with a NUT-09 restore

[Killed] ArrowFunction
src/wallet/nutroot.ts:137:34
   // Every v3 input signs (NUT-10), so an unsigned one is a request the mint will refuse.
   // Say which proof and why here, rather than letting it come back as a witness error naming
   // nothing: the cause is always a key this wallet does not hold.
-  const unsigned = v3Inputs.find((p) => !p.witness);
+  const unsigned = v3Inputs.find(() => undefined);
   if (unsigned) {
     fail(
killedBy: attachTransactionWitnesses an unsignable v3 input fails loudly instead of reaching the mint
statusReason: expected [Function] to throw error matching /No key to sign a v3 input/ but got 'string expected'

[Killed] BooleanLiteral
src/wallet/nutroot.ts:137:41
   // Every v3 input signs (NUT-10), so an unsigned one is a request the mint will refuse.
   // Say which proof and why here, rather than letting it come back as a witness error naming
   // nothing: the cause is always a key this wallet does not hold.
-  const unsigned = v3Inputs.find((p) => !p.witness);
+  const unsigned = v3Inputs.find((p) => p.witness);
   if (unsigned) {
     fail(
killedBy: attachTransactionWitnesses falls back to extraKeys, which carry the keys proofs hold in spend info
statusReason: No key to sign a v3 input: its spend info holds neither a bearer key nor an ephemeral this wallet can derive from; a proof that lost its spend info is recovered with a NUT-09 restore

[Killed] ConditionalExpression
src/wallet/nutroot.ts:138:7
   // Say which proof and why here, rather than letting it come back as a witness error naming
   // nothing: the cause is always a key this wallet does not hold.
   const unsigned = v3Inputs.find((p) => !p.witness);
-  if (unsigned) {
+  if (true) {
     fail(
       'No key to sign a v3 input: its spend info holds neither a bearer key nor an ephemeral this wallet can derive from; a proof that lost its spend info is recovered with a NUT-09 restore',
killedBy: attachTransactionWitnesses falls back to extraKeys, which carry the keys proofs hold in spend info
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
src/wallet/nutroot.ts:138:7
   // Say which proof and why here, rather than letting it come back as a witness error naming
   // nothing: the cause is always a key this wallet does not hold.
   const unsigned = v3Inputs.find((p) => !p.witness);
-  if (unsigned) {
+  if (false) {
     fail(
       'No key to sign a v3 input: its spend info holds neither a bearer key nor an ephemeral this wallet can derive from; a proof that lost its spend info is recovered with a NUT-09 restore',
killedBy: attachTransactionWitnesses an unsignable v3 input fails loudly instead of reaching the mint
statusReason: expected [Function] to throw error matching /No key to sign a v3 input/ but got 'string expected'

[Survived] ObjectLiteral
src/wallet/nutroot.ts:142:7
     fail(
       'No key to sign a v3 input: its spend info holds neither a bearer key nor an ephemeral this wallet can derive from; a proof that lost its spend info is recovered with a NUT-09 restore',
       state.logger,
-      { id: unsigned.id, amount: unsigned.amount.toString() },
+      {},
     );
   }

[Killed] BlockStatement
src/wallet/nutroot.ts:149:34
   // wallet, and nothing but the wallet ever holds all of it together.
   const transcript = bytesToHex(transactionMessage);
   const enc = new TextEncoder();
-  return v3Inputs.map((input) => {
-    const { digest } = inputContexts.get(
-      proofInputContextKey({ keysetId: input.id, secret: input.secret }),
-    )!;
-    const Y = hashToCurveBls(enc.encode(input.secret)).toHex(true);
-    const witness = input.witness as string;
-    return {
-      Y,
-      keysetId: input.id,
-      inputDigest: bytesToHex(digest),
-      witness,
-      commitment: spendCommitment(Y, digest, witness),
-      transcript,
-    };
-  });
+  return v3Inputs.map((input) => {});
 }
 
killedBy: attachTransactionWitnesses returns a receipt per v3 input that opens the NUT-07 commitment
statusReason: Cannot read properties of undefined (reading 'Y')

[Killed] BooleanLiteral
src/wallet/nutroot.ts:153:62
     const { digest } = inputContexts.get(
       proofInputContextKey({ keysetId: input.id, secret: input.secret }),
     )!;
-    const Y = hashToCurveBls(enc.encode(input.secret)).toHex(true);
+    const Y = hashToCurveBls(enc.encode(input.secret)).toHex(false);
     const witness = input.witness as string;
     return {
killedBy: attachTransactionWitnesses returns a receipt per v3 input that opens the NUT-07 commitment
statusReason: expected '188a55de7a6f4000a8347cddbf8792467de9d…' to be 'b88a55de7a6f4000a8347cddbf8792467de9d…' // Object.is equality

[Killed] BlockStatement
src/wallet/nutroot.ts:173:17
   proof: Proof,
   opts: { privkeys?: string | string[]; now?: number } | undefined,
   state: NutrootWalletState,
-): SpendOptions {
-  const privkeys = opts?.privkeys === undefined ? [] : [opts.privkeys].flat();
-  const now = opts?.now ?? Math.floor(Date.now() / 1000);
-  if (!isBlsKeyset(proof.id)) return legacySpendOptions(proof, privkeys, now);
-  assertV3PointSecret(proof.secret);
-
-  // Key path: the spend-info key, bearer or receiver-keyed. Nothing scans the seed: every v3
-  // output this wallet makes keeps its key in spend info, and a lost one is a NUT-09 restore.
-  const keyPath = collectSpendInfoKeys([proof], privkeys, state.logger).has(proof.secret);
-
-  const tree = proof.spend_info?.tree;
-  if (!tree || tree.length === 0) return withVerdict(keyPath, []);
-
-  const K = proof.spend_info?.K ?? internalKeyOf(proof, privkeys);
-  if (!K) throw new CTSError('Disclosed tree needs an internal key to verify the proof secret');
-  verifyNutrootSpendInfo(proof.secret, { ...proof.spend_info, K });
-
-  // Parses every leaf, so an unknown one throws here rather than being reported as spendable.
-  const leaves = tree.map((leaf) => parseNutrootLeaf(hexToBytes(leaf)));
-  const hits = recoverLeafKeySecretKeys(tree, proof.spend_info?.E, privkeys);
-  return withVerdict(keyPath, scriptOptions(leaves, hits, now));
-}
+): SpendOptions {}
 
 /**
killedBy: wallet.spendOptions: the key path rejects anything that is not a v3 point secret
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/wallet/nutroot.ts:174:20
   opts: { privkeys?: string | string[]; now?: number } | undefined,
   state: NutrootWalletState,
 ): SpendOptions {
-  const privkeys = opts?.privkeys === undefined ? [] : [opts.privkeys].flat();
+  const privkeys = true ? [] : [opts.privkeys].flat();
   const now = opts?.now ?? Math.floor(Date.now() / 1000);
   if (!isBlsKeyset(proof.id)) return legacySpendOptions(proof, privkeys, now);
killedBy: wallet.spendOptions: the key path trial-matches a receiver-keyed proof against the keys supplied
statusReason: expected false to be true // Object.is equality

[Killed] OptionalChaining
src/wallet/nutroot.ts:174:20
   opts: { privkeys?: string | string[]; now?: number } | undefined,
   state: NutrootWalletState,
 ): SpendOptions {
-  const privkeys = opts?.privkeys === undefined ? [] : [opts.privkeys].flat();
+  const privkeys = opts.privkeys === undefined ? [] : [opts.privkeys].flat();
   const now = opts?.now ?? Math.floor(Date.now() / 1000);
   if (!isBlsKeyset(proof.id)) return legacySpendOptions(proof, privkeys, now);
killedBy: wallet.spendOptions: the key path rejects anything that is not a v3 point secret
statusReason: expected [Function] to throw error matching /point secrets/ but got 'Cannot read properties of undefined (…'

[Killed] OptionalChaining
src/wallet/nutroot.ts:175:15
   state: NutrootWalletState,
 ): SpendOptions {
   const privkeys = opts?.privkeys === undefined ? [] : [opts.privkeys].flat();
-  const now = opts?.now ?? Math.floor(Date.now() / 1000);
+  const now = opts.now ?? Math.floor(Date.now() / 1000);
   if (!isBlsKeyset(proof.id)) return legacySpendOptions(proof, privkeys, now);
   assertV3PointSecret(proof.secret);
killedBy: wallet.spendOptions: the key path rejects anything that is not a v3 point secret
statusReason: expected [Function] to throw error matching /point secrets/ but got 'Cannot read properties of undefined (…'

[Killed] LogicalOperator
src/wallet/nutroot.ts:175:15
   state: NutrootWalletState,
 ): SpendOptions {
   const privkeys = opts?.privkeys === undefined ? [] : [opts.privkeys].flat();
-  const now = opts?.now ?? Math.floor(Date.now() / 1000);
+  const now = opts?.now && Math.floor(Date.now() / 1000);
   if (!isBlsKeyset(proof.id)) return legacySpendOptions(proof, privkeys, now);
   assertV3PointSecret(proof.secret);
killedBy: wallet.spendOptions: the script path a locktime blocks until it passes, and reports when that is
statusReason: expected { leafIndex: +0, leaf: { …(4) }, …(4) } to match object { satisfiable: true, …(1) }
(8 matching properties omitted from actual)

[Killed] ConditionalExpression
src/wallet/nutroot.ts:176:7
 ): SpendOptions {
   const privkeys = opts?.privkeys === undefined ? [] : [opts.privkeys].flat();
   const now = opts?.now ?? Math.floor(Date.now() / 1000);
-  if (!isBlsKeyset(proof.id)) return legacySpendOptions(proof, privkeys, now);
+  if (true) return legacySpendOptions(proof, privkeys, now);
   assertV3PointSecret(proof.secret);
 
killedBy: wallet.spendOptions: the key path rejects anything that is not a v3 point secret
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/wallet/nutroot.ts:176:7
 ): SpendOptions {
   const privkeys = opts?.privkeys === undefined ? [] : [opts.privkeys].flat();
   const now = opts?.now ?? Math.floor(Date.now() / 1000);
-  if (!isBlsKeyset(proof.id)) return legacySpendOptions(proof, privkeys, now);
+  if (false) return legacySpendOptions(proof, privkeys, now);
   assertV3PointSecret(proof.secret);
 
killedBy: wallet.spendOptions: legacy and bearer proofs an unlocked bearer proof spends as it stands
statusReason: v3 keysets take point secrets only

[Killed] CallExpression
src/wallet/nutroot.ts:177:3
   const privkeys = opts?.privkeys === undefined ? [] : [opts.privkeys].flat();
   const now = opts?.now ?? Math.floor(Date.now() / 1000);
   if (!isBlsKeyset(proof.id)) return legacySpendOptions(proof, privkeys, now);
-  assertV3PointSecret(proof.secret);
+  ;
 
   // Key path: the spend-info key, bearer or receiver-keyed. Nothing scans the seed: every v3
killedBy: wallet.spendOptions: the key path rejects anything that is not a v3 point secret
statusReason: expected [Function] to throw an error

[Killed] OptionalChaining
src/wallet/nutroot.ts:183:16
   // output this wallet makes keeps its key in spend info, and a lost one is a NUT-09 restore.
   const keyPath = collectSpendInfoKeys([proof], privkeys, state.logger).has(proof.secret);
 
-  const tree = proof.spend_info?.tree;
+  const tree = proof.spend_info.tree;
   if (!tree || tree.length === 0) return withVerdict(keyPath, []);
 
killedBy: wallet.spendOptions: the key path finds a bearer key, and reports none when the spend info is empty
statusReason: Cannot read properties of undefined (reading 'tree')

[Killed] ConditionalExpression
src/wallet/nutroot.ts:184:7
   const keyPath = collectSpendInfoKeys([proof], privkeys, state.logger).has(proof.secret);
 
   const tree = proof.spend_info?.tree;
-  if (!tree || tree.length === 0) return withVerdict(keyPath, []);
+  if (false) return withVerdict(keyPath, []);
 
   const K = proof.spend_info?.K ?? internalKeyOf(proof, privkeys);
killedBy: wallet.spendOptions: the key path finds a bearer key, and reports none when the spend info is empty
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
src/wallet/nutroot.ts:184:7
   const keyPath = collectSpendInfoKeys([proof], privkeys, state.logger).has(proof.secret);
 
   const tree = proof.spend_info?.tree;
-  if (!tree || tree.length === 0) return withVerdict(keyPath, []);
+  if (true) return withVerdict(keyPath, []);
 
   const K = proof.spend_info?.K ?? internalKeyOf(proof, privkeys);
killedBy: wallet.spendOptions: the script path a leaf whose key the wallet holds is satisfiable
statusReason: expected [] to have a length of 1 but got +0

[Killed] LogicalOperator
src/wallet/nutroot.ts:186:13
   const tree = proof.spend_info?.tree;
   if (!tree || tree.length === 0) return withVerdict(keyPath, []);
 
-  const K = proof.spend_info?.K ?? internalKeyOf(proof, privkeys);
+  const K = proof.spend_info?.K && internalKeyOf(proof, privkeys);
   if (!K) throw new CTSError('Disclosed tree needs an internal key to verify the proof secret');
   verifyNutrootSpendInfo(proof.secret, { ...proof.spend_info, K });
killedBy: wallet.spendOptions: the script path a blinded leaf key is found at its slot and reported as blinded
statusReason: Disclosed tree needs an internal key to verify the proof secret

[Survived] OptionalChaining
src/wallet/nutroot.ts:186:13
   const tree = proof.spend_info?.tree;
   if (!tree || tree.length === 0) return withVerdict(keyPath, []);
 
-  const K = proof.spend_info?.K ?? internalKeyOf(proof, privkeys);
+  const K = proof.spend_info.K ?? internalKeyOf(proof, privkeys);
   if (!K) throw new CTSError('Disclosed tree needs an internal key to verify the proof secret');
   verifyNutrootSpendInfo(proof.secret, { ...proof.spend_info, K });

[Killed] ConditionalExpression
src/wallet/nutroot.ts:187:7
   if (!tree || tree.length === 0) return withVerdict(keyPath, []);
 
   const K = proof.spend_info?.K ?? internalKeyOf(proof, privkeys);
-  if (!K) throw new CTSError('Disclosed tree needs an internal key to verify the proof secret');
+  if (true) throw new CTSError('Disclosed tree needs an internal key to verify the proof secret');
   verifyNutrootSpendInfo(proof.secret, { ...proof.spend_info, K });
 
killedBy: wallet.spendOptions: the script path a leaf whose key the wallet holds is satisfiable
statusReason: Disclosed tree needs an internal key to verify the proof secret
