[Killed] ArrowFunction
src/wallet/nutroot.ts:266:49
   // not "unlocks later".
   const waiting = script.filter((o) => o.blockedBy === 'locktime' && o.keys.length >= o.leaf.n);
   if (waiting.length) {
-    const availableAt = Math.min(...waiting.map((o) => o.availableAt as number));
+    const availableAt = Math.min(...waiting.map(() => undefined));
     return { ...stuck, blockedBy: 'locktime', availableAt };
   }
killedBy: wallet.spendOptions: the verdict a covered leaf waiting on its locktime reports when
statusReason: expected { keyPath: false, …(4) } to match object { spendable: false, …(2) }
(2 matching properties omitted from actual)

[Survived] MethodExpression
src/wallet/nutroot.ts:266:25
   // not "unlocks later".
   const waiting = script.filter((o) => o.blockedBy === 'locktime' && o.keys.length >= o.leaf.n);
   if (waiting.length) {
-    const availableAt = Math.min(...waiting.map((o) => o.availableAt as number));
+    const availableAt = Math.max(...waiting.map(o => o.availableAt as number));
     return { ...stuck, blockedBy: 'locktime', availableAt };
   }

[Killed] MethodExpression
src/wallet/nutroot.ts:269:7
     const availableAt = Math.min(...waiting.map((o) => o.availableAt as number));
     return { ...stuck, blockedBy: 'locktime', availableAt };
   }
-  if (script.some((o) => o.blockedBy === 'preimage')) return { ...stuck, blockedBy: 'preimage' };
+  if (script.every(o => o.blockedBy === 'preimage')) return { ...stuck, blockedBy: 'preimage' };
   if (script.some((o) => o.keys.length > 0)) return { ...stuck, blockedBy: 'threshold' };
   return { ...stuck, blockedBy: 'not-keyed-to-you' };
killedBy: wallet.spendOptions: the key path finds a bearer key, and reports none when the spend info is empty
statusReason: expected { keyPath: false, script: [], …(2) } to deeply equal { keyPath: false, script: [], …(2) }

[Killed] ArrowFunction
src/wallet/nutroot.ts:269:19
     const availableAt = Math.min(...waiting.map((o) => o.availableAt as number));
     return { ...stuck, blockedBy: 'locktime', availableAt };
   }
-  if (script.some((o) => o.blockedBy === 'preimage')) return { ...stuck, blockedBy: 'preimage' };
+  if (script.some(() => undefined)) return { ...stuck, blockedBy: 'preimage' };
   if (script.some((o) => o.keys.length > 0)) return { ...stuck, blockedBy: 'threshold' };
   return { ...stuck, blockedBy: 'not-keyed-to-you' };
killedBy: wallet.spendOptions: the verdict a key shortfall is threshold, a covered hashlock is preimage
statusReason: expected { keyPath: false, …(3) } to match object { spendable: false, …(1) }
(2 matching properties omitted from actual)

[Killed] ConditionalExpression
src/wallet/nutroot.ts:270:26
     return { ...stuck, blockedBy: 'locktime', availableAt };
   }
   if (script.some((o) => o.blockedBy === 'preimage')) return { ...stuck, blockedBy: 'preimage' };
-  if (script.some((o) => o.keys.length > 0)) return { ...stuck, blockedBy: 'threshold' };
+  if (script.some((o) => false)) return { ...stuck, blockedBy: 'threshold' };
   return { ...stuck, blockedBy: 'not-keyed-to-you' };
 }
killedBy: wallet.spendOptions: the verdict a key shortfall is threshold, a covered hashlock is preimage
statusReason: expected { keyPath: false, …(3) } to match object { spendable: false, …(1) }
(2 matching properties omitted from actual)

[Killed] ArrowFunction
src/wallet/nutroot.ts:270:19
     return { ...stuck, blockedBy: 'locktime', availableAt };
   }
   if (script.some((o) => o.blockedBy === 'preimage')) return { ...stuck, blockedBy: 'preimage' };
-  if (script.some((o) => o.keys.length > 0)) return { ...stuck, blockedBy: 'threshold' };
+  if (script.some(() => undefined)) return { ...stuck, blockedBy: 'threshold' };
   return { ...stuck, blockedBy: 'not-keyed-to-you' };
 }
killedBy: wallet.spendOptions: the verdict a key shortfall is threshold, a covered hashlock is preimage
statusReason: expected { keyPath: false, …(3) } to match object { spendable: false, …(1) }
(2 matching properties omitted from actual)

[Killed] ObjectLiteral
src/wallet/nutroot.ts:271:10
   }
   if (script.some((o) => o.blockedBy === 'preimage')) return { ...stuck, blockedBy: 'preimage' };
   if (script.some((o) => o.keys.length > 0)) return { ...stuck, blockedBy: 'threshold' };
-  return { ...stuck, blockedBy: 'not-keyed-to-you' };
+  return {};
 }
 
killedBy: wallet.spendOptions: the key path finds a bearer key, and reports none when the spend info is empty
statusReason: expected {} to deeply equal { keyPath: false, script: [], …(2) }

[Killed] EqualityOperator
src/wallet/nutroot.ts:291:38
   for (const plan of plans) {
     // Same-text legacy and v3 secrets are different proofs (NUT-10): only a v3 input can carry
     // the plan's tree.
-    const proof = inputs.find((p) => p.secret === plan.secret && isBlsKeyset(p.id));
+    const proof = inputs.find((p) => p.secret !== plan.secret && isBlsKeyset(p.id));
     if (!proof) {
       throw new CTSError(`Script path plan names a secret not in this transaction`);
killedBy: prepareScriptPathSpends resolves a plan: internal key from the bearer scalar, keys deduped lowercase
statusReason: Script path plan names a secret not in this transaction

[Killed] LogicalOperator
src/wallet/nutroot.ts:291:38
   for (const plan of plans) {
     // Same-text legacy and v3 secrets are different proofs (NUT-10): only a v3 input can carry
     // the plan's tree.
-    const proof = inputs.find((p) => p.secret === plan.secret && isBlsKeyset(p.id));
+    const proof = inputs.find((p) => p.secret === plan.secret || isBlsKeyset(p.id));
     if (!proof) {
       throw new CTSError(`Script path plan names a secret not in this transaction`);
killedBy: prepareScriptPathSpends rejects unresolvable plans before any request is built
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/wallet/nutroot.ts:292:17
     // Same-text legacy and v3 secrets are different proofs (NUT-10): only a v3 input can carry
     // the plan's tree.
     const proof = inputs.find((p) => p.secret === plan.secret && isBlsKeyset(p.id));
-    if (!proof) {
-      throw new CTSError(`Script path plan names a secret not in this transaction`);
-    }
+    if (!proof) {}
     if (out.has(plan.secret)) {
       throw new CTSError('Script path plan names the same input twice');
killedBy: prepareScriptPathSpends rejects unresolvable plans before any request is built
statusReason: expected [Function] to throw error matching /not in this transaction/ but got 'Cannot read properties of undefined (…'

[Killed] StringLiteral
src/wallet/nutroot.ts:293:26
     // the plan's tree.
     const proof = inputs.find((p) => p.secret === plan.secret && isBlsKeyset(p.id));
     if (!proof) {
-      throw new CTSError(`Script path plan names a secret not in this transaction`);
+      throw new CTSError(``);
     }
     if (out.has(plan.secret)) {
killedBy: prepareScriptPathSpends rejects unresolvable plans before any request is built
statusReason: expected [Function] to throw error matching /not in this transaction/ but got ''

[Killed] ConditionalExpression
src/wallet/nutroot.ts:295:9
     if (!proof) {
       throw new CTSError(`Script path plan names a secret not in this transaction`);
     }
-    if (out.has(plan.secret)) {
+    if (false) {
       throw new CTSError('Script path plan names the same input twice');
     }
killedBy: prepareScriptPathSpends rejects unresolvable plans before any request is built
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/wallet/nutroot.ts:295:9
     if (!proof) {
       throw new CTSError(`Script path plan names a secret not in this transaction`);
     }
-    if (out.has(plan.secret)) {
+    if (true) {
       throw new CTSError('Script path plan names the same input twice');
     }
killedBy: prepareScriptPathSpends resolves a plan: internal key from the bearer scalar, keys deduped lowercase
statusReason: Script path plan names the same input twice

[Killed] StringLiteral
src/wallet/nutroot.ts:296:26
       throw new CTSError(`Script path plan names a secret not in this transaction`);
     }
     if (out.has(plan.secret)) {
-      throw new CTSError('Script path plan names the same input twice');
+      throw new CTSError("");
     }
     const tree = proof.spend_info?.tree;
killedBy: prepareScriptPathSpends rejects unresolvable plans before any request is built
statusReason: expected [Function] to throw error matching /twice/ but got ''

[Killed] EqualityOperator
src/wallet/nutroot.ts:299:18
       throw new CTSError('Script path plan names the same input twice');
     }
     const tree = proof.spend_info?.tree;
-    if (!tree || plan.leafIndex < 0 || plan.leafIndex >= tree.length) {
+    if (!tree || plan.leafIndex <= 0 || plan.leafIndex >= tree.length) {
       throw new CTSError(`Script path plan names leaf ${plan.leafIndex}, which is not disclosed`);
     }
killedBy: prepareScriptPathSpends resolves a plan: internal key from the bearer scalar, keys deduped lowercase
statusReason: Script path plan names leaf 0, which is not disclosed

[Killed] ConditionalExpression
src/wallet/nutroot.ts:299:9
       throw new CTSError('Script path plan names the same input twice');
     }
     const tree = proof.spend_info?.tree;
-    if (!tree || plan.leafIndex < 0 || plan.leafIndex >= tree.length) {
+    if (true) {
       throw new CTSError(`Script path plan names leaf ${plan.leafIndex}, which is not disclosed`);
     }
killedBy: prepareScriptPathSpends resolves a plan: internal key from the bearer scalar, keys deduped lowercase
statusReason: Script path plan names leaf 0, which is not disclosed

[Killed] EqualityOperator
src/wallet/nutroot.ts:303:9
       throw new CTSError(`Script path plan names leaf ${plan.leafIndex}, which is not disclosed`);
     }
     const leaf = parseNutrootLeaf(hexToBytes(tree[plan.leafIndex]));
-    if (leaf.type === 'hashlock' && plan.preimage === undefined) {
+    if (leaf.type !== 'hashlock' && plan.preimage === undefined) {
       throw new CTSError('Script path plan for a hashlock leaf needs a preimage');
     }
killedBy: prepareScriptPathSpends resolves a plan: internal key from the bearer scalar, keys deduped lowercase
statusReason: Script path plan for a hashlock leaf needs a preimage

[Killed] LogicalOperator
src/wallet/nutroot.ts:303:9
       throw new CTSError(`Script path plan names leaf ${plan.leafIndex}, which is not disclosed`);
     }
     const leaf = parseNutrootLeaf(hexToBytes(tree[plan.leafIndex]));
-    if (leaf.type === 'hashlock' && plan.preimage === undefined) {
+    if (leaf.type === 'hashlock' || plan.preimage === undefined) {
       throw new CTSError('Script path plan for a hashlock leaf needs a preimage');
     }
killedBy: prepareScriptPathSpends resolves a plan: internal key from the bearer scalar, keys deduped lowercase
statusReason: Script path plan for a hashlock leaf needs a preimage

[Killed] StringLiteral
src/wallet/nutroot.ts:304:26
     }
     const leaf = parseNutrootLeaf(hexToBytes(tree[plan.leafIndex]));
     if (leaf.type === 'hashlock' && plan.preimage === undefined) {
-      throw new CTSError('Script path plan for a hashlock leaf needs a preimage');
+      throw new CTSError("");
     }
     // The control block's internal key, from whichever source the spend info offers (NUT-10).
killedBy: prepareScriptPathSpends a hashlock plan requires its preimage and carries it through
statusReason: expected [Function] to throw error matching /preimage/ but got ''

[Killed] BooleanLiteral
src/wallet/nutroot.ts:308:9
     }
     // The control block's internal key, from whichever source the spend info offers (NUT-10).
     const K = internalKeyOf(proof, privkeys);
-    if (!K) {
+    if (K) {
       throw new CTSError('Script path spend needs the internal key, which the spend info lacks');
     }
killedBy: prepareScriptPathSpends resolves a plan: internal key from the bearer scalar, keys deduped lowercase
statusReason: Script path spend needs the internal key, which the spend info lacks

[Killed] ConditionalExpression
src/wallet/nutroot.ts:308:9
     }
     // The control block's internal key, from whichever source the spend info offers (NUT-10).
     const K = internalKeyOf(proof, privkeys);
-    if (!K) {
+    if (false) {
       throw new CTSError('Script path spend needs the internal key, which the spend info lacks');
     }
killedBy: prepareScriptPathSpends rejects unresolvable plans before any request is built
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/wallet/nutroot.ts:309:26
     // The control block's internal key, from whichever source the spend info offers (NUT-10).
     const K = internalKeyOf(proof, privkeys);
     if (!K) {
-      throw new CTSError('Script path spend needs the internal key, which the spend info lacks');
+      throw new CTSError("");
     }
     const recovered = recoverLeafKeySecretKeys(tree, proof.spend_info?.E, privkeys)
killedBy: prepareScriptPathSpends rejects unresolvable plans before any request is built
statusReason: expected [Function] to throw error matching /internal key/ but got ''

[Survived] OptionalChaining
src/wallet/nutroot.ts:311:54
     if (!K) {
       throw new CTSError('Script path spend needs the internal key, which the spend info lacks');
     }
-    const recovered = recoverLeafKeySecretKeys(tree, proof.spend_info?.E, privkeys)
+    const recovered = recoverLeafKeySecretKeys(tree, proof.spend_info.E, privkeys)
       .filter((h) => h.leafIndex === plan.leafIndex)
       .map((h) => h.secretKey);

[Survived] MethodExpression
src/wallet/nutroot.ts:311:23
     if (!K) {
       throw new CTSError('Script path spend needs the internal key, which the spend info lacks');
     }
-    const recovered = recoverLeafKeySecretKeys(tree, proof.spend_info?.E, privkeys)
-      .filter((h) => h.leafIndex === plan.leafIndex)
+    const recovered = recoverLeafKeySecretKeys(tree, proof.spend_info?.E, privkeys)
       .map((h) => h.secretKey);
     const keys = [

[Killed] EqualityOperator
src/wallet/nutroot.ts:312:22
       throw new CTSError('Script path spend needs the internal key, which the spend info lacks');
     }
     const recovered = recoverLeafKeySecretKeys(tree, proof.spend_info?.E, privkeys)
-      .filter((h) => h.leafIndex === plan.leafIndex)
+      .filter((h) => h.leafIndex !== plan.leafIndex)
       .map((h) => h.secretKey);
     const keys = [
killedBy: prepareScriptPathSpends recovers a verbatim leaf key from the privkeys held, no extraKeys needed
statusReason: Script path leaf needs 1 signatures, 0 keys available

[Killed] ArrowFunction
src/wallet/nutroot.ts:312:15
       throw new CTSError('Script path spend needs the internal key, which the spend info lacks');
     }
     const recovered = recoverLeafKeySecretKeys(tree, proof.spend_info?.E, privkeys)
-      .filter((h) => h.leafIndex === plan.leafIndex)
+      .filter(() => undefined)
       .map((h) => h.secretKey);
     const keys = [
killedBy: prepareScriptPathSpends recovers a verbatim leaf key from the privkeys held, no extraKeys needed
statusReason: Script path leaf needs 1 signatures, 0 keys available

[Killed] ArrowFunction
src/wallet/nutroot.ts:313:12
     }
     const recovered = recoverLeafKeySecretKeys(tree, proof.spend_info?.E, privkeys)
       .filter((h) => h.leafIndex === plan.leafIndex)
-      .map((h) => h.secretKey);
+      .map(() => undefined);
     const keys = [
       ...new Set([...recovered, ...(plan.extraKeys ?? []).map((k: string) => k.toLowerCase())]),
killedBy: prepareScriptPathSpends recovers a verbatim leaf key from the privkeys held, no extraKeys needed
statusReason: expected [ undefined ] to deeply equal [ Array(1) ]

[Killed] ArrayDeclaration
src/wallet/nutroot.ts:314:18
     const recovered = recoverLeafKeySecretKeys(tree, proof.spend_info?.E, privkeys)
       .filter((h) => h.leafIndex === plan.leafIndex)
       .map((h) => h.secretKey);
-    const keys = [
-      ...new Set([...recovered, ...(plan.extraKeys ?? []).map((k: string) => k.toLowerCase())]),
-    ];
+    const keys = [];
     // A co-signer contributes signatures, not keys, so its share cannot be counted until the
     // digest exists. Everything else about the plan is checkable now.
killedBy: prepareScriptPathSpends resolves a plan: internal key from the bearer scalar, keys deduped lowercase
statusReason: Script path leaf needs 1 signatures, 0 keys available

[Killed] LogicalOperator
src/wallet/nutroot.ts:315:37
       .filter((h) => h.leafIndex === plan.leafIndex)
       .map((h) => h.secretKey);
     const keys = [
-      ...new Set([...recovered, ...(plan.extraKeys ?? []).map((k: string) => k.toLowerCase())]),
+      ...new Set([...recovered, ...(plan.extraKeys && []).map((k: string) => k.toLowerCase())]),
     ];
     // A co-signer contributes signatures, not keys, so its share cannot be counted until the
killedBy: prepareScriptPathSpends resolves a plan: internal key from the bearer scalar, keys deduped lowercase
statusReason: Script path leaf needs 1 signatures, 0 keys available

[Killed] ArrowFunction
src/wallet/nutroot.ts:315:63
       .filter((h) => h.leafIndex === plan.leafIndex)
       .map((h) => h.secretKey);
     const keys = [
-      ...new Set([...recovered, ...(plan.extraKeys ?? []).map((k: string) => k.toLowerCase())]),
+      ...new Set([...recovered, ...(plan.extraKeys ?? []).map(() => undefined)]),
     ];
     // A co-signer contributes signatures, not keys, so its share cannot be counted until the
killedBy: prepareScriptPathSpends resolves a plan: internal key from the bearer scalar, keys deduped lowercase
statusReason: expected [ undefined ] to deeply equal [ Array(1) ]

[Killed] ConditionalExpression
src/wallet/nutroot.ts:319:25
     ];
     // A co-signer contributes signatures, not keys, so its share cannot be counted until the
     // digest exists. Everything else about the plan is checkable now.
-    if (!plan.cosign && keys.length < leaf.n) {
+    if (!plan.cosign && true) {
       throw new CTSError(
         `Script path leaf needs ${leaf.n} signatures, ${keys.length} keys available`,
killedBy: prepareScriptPathSpends resolves a plan: internal key from the bearer scalar, keys deduped lowercase
statusReason: Script path leaf needs 1 signatures, 1 keys available

[Killed] EqualityOperator
src/wallet/nutroot.ts:319:25
     ];
     // A co-signer contributes signatures, not keys, so its share cannot be counted until the
     // digest exists. Everything else about the plan is checkable now.
-    if (!plan.cosign && keys.length < leaf.n) {
+    if (!plan.cosign && keys.length <= leaf.n) {
       throw new CTSError(
         `Script path leaf needs ${leaf.n} signatures, ${keys.length} keys available`,
killedBy: prepareScriptPathSpends resolves a plan: internal key from the bearer scalar, keys deduped lowercase
statusReason: Script path leaf needs 1 signatures, 1 keys available

[Killed] StringLiteral
src/wallet/nutroot.ts:321:9
     // digest exists. Everything else about the plan is checkable now.
     if (!plan.cosign && keys.length < leaf.n) {
       throw new CTSError(
-        `Script path leaf needs ${leaf.n} signatures, ${keys.length} keys available`,
+        ``,
       );
     }
killedBy: prepareScriptPathSpends rejects unresolvable plans before any request is built
statusReason: expected [Function] to throw error matching /1 signatures, 0 keys/ but got ''

[Killed] ObjectLiteral
src/wallet/nutroot.ts:324:26
         `Script path leaf needs ${leaf.n} signatures, ${keys.length} keys available`,
       );
     }
-    out.set(plan.secret, {
-      tree,
-      leafIndex: plan.leafIndex,
-      K,
-      ...(plan.preimage !== undefined && { preimage: plan.preimage }),
-      keys,
-      leaf,
-      ...(plan.cosign && { cosign: plan.cosign }),
-    });
+    out.set(plan.secret, {});
   }
   return out;
killedBy: prepareScriptPathSpends resolves a plan: internal key from the bearer scalar, keys deduped lowercase
statusReason: expected undefined to be '034f355bdcb7cc0af728ef3cceb9615d90684…' // Object.is equality

[Killed] LogicalOperator
src/wallet/nutroot.ts:328:11
       tree,
       leafIndex: plan.leafIndex,
       K,
-      ...(plan.preimage !== undefined && { preimage: plan.preimage }),
+      ...(plan.preimage !== undefined || {
+  preimage: plan.preimage
+}),
       keys,
       leaf,
killedBy: prepareScriptPathSpends a hashlock plan requires its preimage and carries it through
statusReason: expected undefined to be '1111111111111111111111111111111111111…' // Object.is equality

[Killed] ConditionalExpression
src/wallet/nutroot.ts:328:11
       tree,
       leafIndex: plan.leafIndex,
       K,
-      ...(plan.preimage !== undefined && { preimage: plan.preimage }),
+      ...(false),
       keys,
       leaf,
killedBy: prepareScriptPathSpends a hashlock plan requires its preimage and carries it through
statusReason: expected undefined to be '1111111111111111111111111111111111111…' // Object.is equality

[Killed] ConditionalExpression
src/wallet/nutroot.ts:331:11
       ...(plan.preimage !== undefined && { preimage: plan.preimage }),
       keys,
       leaf,
-      ...(plan.cosign && { cosign: plan.cosign }),
+      ...(false),
     });
   }
killedBy: prepareScriptPathSpends a cosigner defers the key count to signing time
statusReason: expected undefined to be [AsyncFunction cosign] // Object.is equality

[Killed] LogicalOperator
src/wallet/nutroot.ts:331:11
       ...(plan.preimage !== undefined && { preimage: plan.preimage }),
       keys,
       leaf,
-      ...(plan.cosign && { cosign: plan.cosign }),
+      ...(plan.cosign || {
+  cosign: plan.cosign
+}),
     });
   }
killedBy: prepareScriptPathSpends a cosigner defers the key count to signing time
statusReason: expected undefined to be [AsyncFunction cosign] // Object.is equality

[Killed] BlockStatement
src/wallet/nutroot.ts:341:78
  * The internal key `K` behind a proof's secret, from its spend info: explicit, from a bearer
  * scalar, or trial-matched from a receiver-keyed ephemeral. Undefined when none applies.
  */
-function internalKeyOf(proof: Proof, privkeys: string[]): string | undefined {
-  const info = proof.spend_info;
-  if (!info) return undefined;
-  if (info.k && /^[0-9a-f]{64}$/.test(info.k)) {
-    try {
-      return bytesToHex(getPubKeyFromPrivKey(hexToBytes(info.k)));
-    } catch {
-      return undefined;
-    }
-  }
-  if (info.E) {
-    for (const priv of privkeys) {
-      const hit = recoverReceiverKeyedSecretKey(proof.secret, info.E, priv, info.tree);
-      if (hit) return hit.internalKey;
-    }
-  }
-  if (info.K) {
-    try {
-      return normalizeSecpPubkey(info.K);
-    } catch {
-      return undefined;
-    }
-  }
-  return undefined;
-}
+function internalKeyOf(proof: Proof, privkeys: string[]): string | undefined {}
 
 /**
killedBy: wallet.spendOptions: the script path a blinded leaf key is found at its slot and reported as blinded
statusReason: Disclosed tree needs an internal key to verify the proof secret

[Killed] ConditionalExpression
src/wallet/nutroot.ts:343:7
  */
 function internalKeyOf(proof: Proof, privkeys: string[]): string | undefined {
   const info = proof.spend_info;
-  if (!info) return undefined;
+  if (true) return undefined;
   if (info.k && /^[0-9a-f]{64}$/.test(info.k)) {
     try {
killedBy: wallet.spendOptions: the script path a blinded leaf key is found at its slot and reported as blinded
statusReason: Disclosed tree needs an internal key to verify the proof secret

[Killed] BooleanLiteral
src/wallet/nutroot.ts:343:7
  */
 function internalKeyOf(proof: Proof, privkeys: string[]): string | undefined {
   const info = proof.spend_info;
-  if (!info) return undefined;
+  if (info) return undefined;
   if (info.k && /^[0-9a-f]{64}$/.test(info.k)) {
     try {
killedBy: prepareScriptPathSpends resolves a plan: internal key from the bearer scalar, keys deduped lowercase
statusReason: Script path spend needs the internal key, which the spend info lacks

[Killed] ConditionalExpression
src/wallet/nutroot.ts:344:7
 function internalKeyOf(proof: Proof, privkeys: string[]): string | undefined {
   const info = proof.spend_info;
   if (!info) return undefined;
-  if (info.k && /^[0-9a-f]{64}$/.test(info.k)) {
+  if (true) {
     try {
       return bytesToHex(getPubKeyFromPrivKey(hexToBytes(info.k)));
killedBy: wallet.spendOptions: the script path a blinded leaf key is found at its slot and reported as blinded
statusReason: Disclosed tree needs an internal key to verify the proof secret

[Killed] BlockStatement
src/wallet/nutroot.ts:344:48
 function internalKeyOf(proof: Proof, privkeys: string[]): string | undefined {
   const info = proof.spend_info;
   if (!info) return undefined;
-  if (info.k && /^[0-9a-f]{64}$/.test(info.k)) {
-    try {
-      return bytesToHex(getPubKeyFromPrivKey(hexToBytes(info.k)));
-    } catch {
-      return undefined;
-    }
-  }
+  if (info.k && /^[0-9a-f]{64}$/.test(info.k)) {}
   if (info.E) {
     for (const priv of privkeys) {
killedBy: prepareScriptPathSpends resolves a plan: internal key from the bearer scalar, keys deduped lowercase
statusReason: Script path spend needs the internal key, which the spend info lacks

[Killed] BlockStatement
src/wallet/nutroot.ts:345:9
   const info = proof.spend_info;
   if (!info) return undefined;
   if (info.k && /^[0-9a-f]{64}$/.test(info.k)) {
-    try {
-      return bytesToHex(getPubKeyFromPrivKey(hexToBytes(info.k)));
-    } catch {
+    try {} catch {
       return undefined;
     }
killedBy: prepareScriptPathSpends resolves a plan: internal key from the bearer scalar, keys deduped lowercase
statusReason: Script path spend needs the internal key, which the spend info lacks

[Survived] BlockStatement
src/wallet/nutroot.ts:347:13
   if (info.k && /^[0-9a-f]{64}$/.test(info.k)) {
     try {
       return bytesToHex(getPubKeyFromPrivKey(hexToBytes(info.k)));
-    } catch {
-      return undefined;
-    }
+    } catch {}
   }
   if (info.E) {

[Killed] ConditionalExpression
src/wallet/nutroot.ts:351:7
       return undefined;
     }
   }
-  if (info.E) {
+  if (false) {
     for (const priv of privkeys) {
       const hit = recoverReceiverKeyedSecretKey(proof.secret, info.E, priv, info.tree);
killedBy: nutroot edge cases requires a verified internal key before evaluating an E-only disclosed tree
statusReason: Disclosed tree needs an internal key to verify the proof secret

[Killed] BlockStatement
src/wallet/nutroot.ts:351:15
       return undefined;
     }
   }
-  if (info.E) {
-    for (const priv of privkeys) {
-      const hit = recoverReceiverKeyedSecretKey(proof.secret, info.E, priv, info.tree);
-      if (hit) return hit.internalKey;
-    }
-  }
+  if (info.E) {}
   if (info.K) {
     try {
killedBy: wallet.spendOptions: the script path a blinded leaf key is found at its slot and reported as blinded
statusReason: Disclosed tree needs an internal key to verify the proof secret

[Killed] BlockStatement
src/wallet/nutroot.ts:352:34
     }
   }
   if (info.E) {
-    for (const priv of privkeys) {
-      const hit = recoverReceiverKeyedSecretKey(proof.secret, info.E, priv, info.tree);
-      if (hit) return hit.internalKey;
-    }
+    for (const priv of privkeys) {}
   }
   if (info.K) {
killedBy: wallet.spendOptions: the script path a blinded leaf key is found at its slot and reported as blinded
statusReason: Disclosed tree needs an internal key to verify the proof secret

[Killed] ConditionalExpression
src/wallet/nutroot.ts:354:11
   if (info.E) {
     for (const priv of privkeys) {
       const hit = recoverReceiverKeyedSecretKey(proof.secret, info.E, priv, info.tree);
-      if (hit) return hit.internalKey;
+      if (false) return hit.internalKey;
     }
   }
killedBy: wallet.spendOptions: the script path a blinded leaf key is found at its slot and reported as blinded
statusReason: Disclosed tree needs an internal key to verify the proof secret

[Killed] ConditionalExpression
src/wallet/nutroot.ts:354:11
   if (info.E) {
     for (const priv of privkeys) {
       const hit = recoverReceiverKeyedSecretKey(proof.secret, info.E, priv, info.tree);
-      if (hit) return hit.internalKey;
+      if (true) return hit.internalKey;
     }
   }
killedBy: wallet.spendOptions: the script path a blinded leaf key is found at its slot and reported as blinded
statusReason: Cannot read properties of undefined (reading 'internalKey')

[Killed] BlockStatement
src/wallet/nutroot.ts:357:15
       if (hit) return hit.internalKey;
     }
   }
-  if (info.K) {
-    try {
-      return normalizeSecpPubkey(info.K);
-    } catch {
-      return undefined;
-    }
-  }
+  if (info.K) {}
   return undefined;
 }
killedBy: prepareScriptPathSpends takes the internal key from explicit spend_info.K when no scalar is present
statusReason: Script path spend needs the internal key, which the spend info lacks

[Killed] ConditionalExpression
src/wallet/nutroot.ts:357:7
       if (hit) return hit.internalKey;
     }
   }
-  if (info.K) {
+  if (false) {
     try {
       return normalizeSecpPubkey(info.K);
killedBy: prepareScriptPathSpends takes the internal key from explicit spend_info.K when no scalar is present
statusReason: Script path spend needs the internal key, which the spend info lacks

[Killed] BlockStatement
src/wallet/nutroot.ts:358:9
     }
   }
   if (info.K) {
-    try {
-      return normalizeSecpPubkey(info.K);
-    } catch {
+    try {} catch {
       return undefined;
     }
killedBy: prepareScriptPathSpends takes the internal key from explicit spend_info.K when no scalar is present
statusReason: Script path spend needs the internal key, which the spend info lacks

[Survived] BlockStatement
src/wallet/nutroot.ts:360:13
   if (info.K) {
     try {
       return normalizeSecpPubkey(info.K);
-    } catch {
-      return undefined;
-    }
+    } catch {}
   }
   return undefined;
