[Killed] BlockStatement
src/model/OutputDataCreator.ts:69:23
     amount: AmountLike,
     keyset: HasKeysetKeys,
     customSplit?: AmountLike[],
-  ): OutputDataLike[] {
-    if (this.createSingleP2PKData === DefaultOutputDataCreator.prototype.createSingleP2PKData) {
-      // Preserve subclasses that customize only the single-output hook. The default
-      // hook can use the batch path, which shares one P2BK ephemeral key for SIG_ALL.
-      return OutputData.createP2PKData(p2pk, amount, keyset, customSplit);
-    }
-    const amounts = splitAmount(amount, keyset.keys, customSplit);
-    // Mirrors OutputData.createP2PKData's shared key, so a subclassed hook's SIG_ALL
-    // split still carries identical data/tags across every output (NUT-28).
-    const eBytes =
-      p2pk.blindKeys && p2pk.sigFlag === 'SIG_ALL' ? createRandomSecretKey() : undefined;
-    const outputs = amounts.map((a) => this.createSingleP2PKData(p2pk, a, keyset.id, eBytes));
-    // An override that ignores eBytes silently reverts to a fresh key per output, which
-    // defeats the point of sharing one: catch that here rather than at the mint.
-    if (eBytes && new Set(outputs.map((o) => o.ephemeralE)).size > 1) {
-      throw new CTSError(
-        'createSingleP2PKData override must reuse the shared eBytes ephemeral key for a SIG_ALL split',
-      );
-    }
-    return outputs;
-  }
+  ): OutputDataLike[] {}
 
   createSingleP2PKData(
killedBy: Wallet.createOutputData lock chokepoint the same lock on a legacy keyset emits NUT-11 secrets
statusReason: Cannot read properties of undefined (reading 'entries')

[Killed] ConditionalExpression
src/model/OutputDataCreator.ts:70:9
     keyset: HasKeysetKeys,
     customSplit?: AmountLike[],
   ): OutputDataLike[] {
-    if (this.createSingleP2PKData === DefaultOutputDataCreator.prototype.createSingleP2PKData) {
+    if (true) {
       // Preserve subclasses that customize only the single-output hook. The default
       // hook can use the batch path, which shares one P2BK ephemeral key for SIG_ALL.
killedBy: DefaultOutputDataCreator a subclassed single-output P2PK hook is still called once per split amount
statusReason: expected [] to have a length of 3 but got +0

[Killed] EqualityOperator
src/model/OutputDataCreator.ts:70:9
     keyset: HasKeysetKeys,
     customSplit?: AmountLike[],
   ): OutputDataLike[] {
-    if (this.createSingleP2PKData === DefaultOutputDataCreator.prototype.createSingleP2PKData) {
+    if (this.createSingleP2PKData !== DefaultOutputDataCreator.prototype.createSingleP2PKData) {
       // Preserve subclasses that customize only the single-output hook. The default
       // hook can use the batch path, which shares one P2BK ephemeral key for SIG_ALL.
killedBy: DefaultOutputDataCreator a subclassed single-output P2PK hook is still called once per split amount
statusReason: expected [] to have a length of 3 but got +0

[Killed] ConditionalExpression
src/model/OutputDataCreator.ts:79:7
     // Mirrors OutputData.createP2PKData's shared key, so a subclassed hook's SIG_ALL
     // split still carries identical data/tags across every output (NUT-28).
     const eBytes =
-      p2pk.blindKeys && p2pk.sigFlag === 'SIG_ALL' ? createRandomSecretKey() : undefined;
+      false ? createRandomSecretKey() : undefined;
     const outputs = amounts.map((a) => this.createSingleP2PKData(p2pk, a, keyset.id, eBytes));
     // An override that ignores eBytes silently reverts to a fresh key per output, which
killedBy: DefaultOutputDataCreator a subclassed single-output P2PK hook shares one ephemeral key for a SIG_ALL split
statusReason: expected 3 to be 1 // Object.is equality

[Killed] EqualityOperator
src/model/OutputDataCreator.ts:79:25
     // Mirrors OutputData.createP2PKData's shared key, so a subclassed hook's SIG_ALL
     // split still carries identical data/tags across every output (NUT-28).
     const eBytes =
-      p2pk.blindKeys && p2pk.sigFlag === 'SIG_ALL' ? createRandomSecretKey() : undefined;
+      p2pk.blindKeys && p2pk.sigFlag !== 'SIG_ALL' ? createRandomSecretKey() : undefined;
     const outputs = amounts.map((a) => this.createSingleP2PKData(p2pk, a, keyset.id, eBytes));
     // An override that ignores eBytes silently reverts to a fresh key per output, which
killedBy: DefaultOutputDataCreator a subclassed single-output P2PK hook shares one ephemeral key for a SIG_ALL split
statusReason: expected 3 to be 1 // Object.is equality

[Killed] ArrowFunction
src/model/OutputDataCreator.ts:80:33
     // split still carries identical data/tags across every output (NUT-28).
     const eBytes =
       p2pk.blindKeys && p2pk.sigFlag === 'SIG_ALL' ? createRandomSecretKey() : undefined;
-    const outputs = amounts.map((a) => this.createSingleP2PKData(p2pk, a, keyset.id, eBytes));
+    const outputs = amounts.map(() => undefined);
     // An override that ignores eBytes silently reverts to a fresh key per output, which
     // defeats the point of sharing one: catch that here rather than at the mint.
killedBy: DefaultOutputDataCreator a subclassed single-output P2PK hook is still called once per split amount
statusReason: expected [] to have a length of 3 but got +0

[Killed] BlockStatement
src/model/OutputDataCreator.ts:83:71
     const outputs = amounts.map((a) => this.createSingleP2PKData(p2pk, a, keyset.id, eBytes));
     // An override that ignores eBytes silently reverts to a fresh key per output, which
     // defeats the point of sharing one: catch that here rather than at the mint.
-    if (eBytes && new Set(outputs.map((o) => o.ephemeralE)).size > 1) {
-      throw new CTSError(
-        'createSingleP2PKData override must reuse the shared eBytes ephemeral key for a SIG_ALL split',
-      );
-    }
+    if (eBytes && new Set(outputs.map((o) => o.ephemeralE)).size > 1) {}
     return outputs;
   }
killedBy: DefaultOutputDataCreator a subclassed single-output P2PK hook that drops eBytes is rejected for a SIG_ALL split
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/model/OutputDataCreator.ts:83:9
     const outputs = amounts.map((a) => this.createSingleP2PKData(p2pk, a, keyset.id, eBytes));
     // An override that ignores eBytes silently reverts to a fresh key per output, which
     // defeats the point of sharing one: catch that here rather than at the mint.
-    if (eBytes && new Set(outputs.map((o) => o.ephemeralE)).size > 1) {
+    if (true) {
       throw new CTSError(
         'createSingleP2PKData override must reuse the shared eBytes ephemeral key for a SIG_ALL split',
killedBy: DefaultOutputDataCreator a subclassed single-output P2PK hook is still called once per split amount
statusReason: createSingleP2PKData override must reuse the shared eBytes ephemeral key for a SIG_ALL split

[Killed] BlockStatement
src/model/OutputDataCreator.ts:96:21
     amount: AmountLike,
     keysetId: string,
     eBytes?: Uint8Array,
-  ): OutputDataLike {
-    return OutputData.createSingleP2PKData(p2pk, amount, keysetId, eBytes);
-  }
+  ): OutputDataLike {}
 
   createRandomData(
killedBy: DefaultOutputDataCreator the default single-output P2PK hook forwards eBytes to OutputData
statusReason: Cannot read properties of undefined (reading 'ephemeralE')

[Killed] BlockStatement
src/model/OutputDataCreator.ts:104:23
     amount: AmountLike,
     keyset: HasKeysetKeys,
     customSplit?: AmountLike[],
-  ): OutputDataLike[] {
-    const amounts = splitAmount(amount, keyset.keys, customSplit);
-    return amounts.map((a) => this.createSingleRandomData(a, keyset.id));
-  }
+  ): OutputDataLike[] {}
 
   createSingleRandomData(amount: AmountLike, keysetId: string): OutputDataLike {
killedBy: DefaultOutputDataCreator rejects an exact custom split above the output cap before generating any output
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/model/OutputDataCreator.ts:109:80
     return amounts.map((a) => this.createSingleRandomData(a, keyset.id));
   }
 
-  createSingleRandomData(amount: AmountLike, keysetId: string): OutputDataLike {
-    return OutputData.createSingleRandomData(amount, keysetId);
-  }
+  createSingleRandomData(amount: AmountLike, keysetId: string): OutputDataLike {}
 
   createDeterministicData(
killedBy: deterministic counter reservation random outputs reserve no counters even when denominations are supplied
statusReason: Cannot read properties of undefined (reading 'secret')

[Killed] BlockStatement
src/model/OutputDataCreator.ts:119:23
     counter: number,
     keyset: HasKeysetKeys,
     customSplit?: AmountLike[],
-  ): OutputDataLike[] {
-    if (
-      this.createSingleDeterministicData ===
-      DefaultOutputDataCreator.prototype.createSingleDeterministicData
-    ) {
-      // Preserve subclasses that customize only the single-output hook.
-      // The default hook can use the optimized batch path.
-      return OutputData.createDeterministicData(amount, seed, counter, keyset, customSplit);
-    }
-    const amounts = splitAmount(amount, keyset.keys, customSplit);
-    // The canonical batch path rejects an unsafe counter itself; a custom hook may not, so
-    // the whole range is checked before it aliases two outputs onto the same counter.
-    const lastCounter = counter + (amounts.length - 1);
-    if (
-      !Number.isSafeInteger(counter) ||
-      counter < 0 ||
-      (amounts.length > 0 && !Number.isSafeInteger(lastCounter))
-    ) {
-      throw new CTSError('Counter must be an integer in the range 0 <= counter <= 2^53 - 1');
-    }
-    return amounts.map((a, i) =>
-      this.createSingleDeterministicData(a, seed, counter + i, keyset.id),
-    );
-  }
+  ): OutputDataLike[] {}
 
   /**
killedBy: DefaultOutputDataCreator uses the batch path when the single-output hook is not overridden
statusReason: expected "createDeterministicData" to be called with arguments: [ 3, …(4) ]

Number of calls: 0

[Killed] ConditionalExpression
src/model/OutputDataCreator.ts:121:7
     customSplit?: AmountLike[],
   ): OutputDataLike[] {
     if (
-      this.createSingleDeterministicData ===
-      DefaultOutputDataCreator.prototype.createSingleDeterministicData
+      false
     ) {
       // Preserve subclasses that customize only the single-output hook.
killedBy: DefaultOutputDataCreator uses the batch path when the single-output hook is not overridden
statusReason: expected "createDeterministicData" to be called with arguments: [ 3, …(4) ]

Number of calls: 0

[Killed] ConditionalExpression
src/model/OutputDataCreator.ts:121:7
     customSplit?: AmountLike[],
   ): OutputDataLike[] {
     if (
-      this.createSingleDeterministicData ===
-      DefaultOutputDataCreator.prototype.createSingleDeterministicData
+      true
     ) {
       // Preserve subclasses that customize only the single-output hook.
killedBy: DefaultOutputDataCreator a subclassed single-output hook is called once per counter within a safe range
statusReason: expected [] to deeply equal [ 7, 8 ]

[Killed] BlockStatement
src/model/OutputDataCreator.ts:123:7
     if (
       this.createSingleDeterministicData ===
       DefaultOutputDataCreator.prototype.createSingleDeterministicData
-    ) {
-      // Preserve subclasses that customize only the single-output hook.
-      // The default hook can use the optimized batch path.
-      return OutputData.createDeterministicData(amount, seed, counter, keyset, customSplit);
-    }
+    ) {}
     const amounts = splitAmount(amount, keyset.keys, customSplit);
     // The canonical batch path rejects an unsafe counter itself; a custom hook may not, so
killedBy: DefaultOutputDataCreator uses the batch path when the single-output hook is not overridden
statusReason: expected "createDeterministicData" to be called with arguments: [ 3, …(4) ]

Number of calls: 0

[Killed] ArithmeticOperator
src/model/OutputDataCreator.ts:131:25
     const amounts = splitAmount(amount, keyset.keys, customSplit);
     // The canonical batch path rejects an unsafe counter itself; a custom hook may not, so
     // the whole range is checked before it aliases two outputs onto the same counter.
-    const lastCounter = counter + (amounts.length - 1);
+    const lastCounter = counter - (amounts.length - 1);
     if (
       !Number.isSafeInteger(counter) ||
killedBy: DefaultOutputDataCreator a subclassed single-output hook also rejects counter ranges that would alias
statusReason: expected [Function] to throw error matching /counter/i but got 'not used'

[Survived] ArithmeticOperator
src/model/OutputDataCreator.ts:131:36
     const amounts = splitAmount(amount, keyset.keys, customSplit);
     // The canonical batch path rejects an unsafe counter itself; a custom hook may not, so
     // the whole range is checked before it aliases two outputs onto the same counter.
-    const lastCounter = counter + (amounts.length - 1);
+    const lastCounter = counter + (amounts.length + 1);
     if (
       !Number.isSafeInteger(counter) ||

[Killed] ConditionalExpression
src/model/OutputDataCreator.ts:133:7
     // the whole range is checked before it aliases two outputs onto the same counter.
     const lastCounter = counter + (amounts.length - 1);
     if (
-      !Number.isSafeInteger(counter) ||
-      counter < 0 ||
-      (amounts.length > 0 && !Number.isSafeInteger(lastCounter))
+      true
     ) {
       throw new CTSError('Counter must be an integer in the range 0 <= counter <= 2^53 - 1');
killedBy: DefaultOutputDataCreator a subclassed single-output hook also rejects counter ranges that would alias
statusReason: Counter must be an integer in the range 0 <= counter <= 2^53 - 1

[Killed] LogicalOperator
src/model/OutputDataCreator.ts:133:7
     // the whole range is checked before it aliases two outputs onto the same counter.
     const lastCounter = counter + (amounts.length - 1);
     if (
-      !Number.isSafeInteger(counter) ||
-      counter < 0 ||
+      !Number.isSafeInteger(counter) && counter < 0 ||
       (amounts.length > 0 && !Number.isSafeInteger(lastCounter))
     ) {
killedBy: DefaultOutputDataCreator a subclassed single-output hook also rejects counter ranges that would alias
statusReason: expected [Function] to throw error matching /counter/i but got 'not used'

[Killed] ConditionalExpression
src/model/OutputDataCreator.ts:134:7
     const lastCounter = counter + (amounts.length - 1);
     if (
       !Number.isSafeInteger(counter) ||
-      counter < 0 ||
+      false ||
       (amounts.length > 0 && !Number.isSafeInteger(lastCounter))
     ) {
killedBy: DefaultOutputDataCreator a subclassed single-output hook also rejects counter ranges that would alias
statusReason: expected [Function] to throw error matching /counter/i but got 'not used'

[Killed] EqualityOperator
src/model/OutputDataCreator.ts:134:7
     const lastCounter = counter + (amounts.length - 1);
     if (
       !Number.isSafeInteger(counter) ||
-      counter < 0 ||
+      counter >= 0 ||
       (amounts.length > 0 && !Number.isSafeInteger(lastCounter))
     ) {
killedBy: DefaultOutputDataCreator a subclassed single-output hook also rejects counter ranges that would alias
statusReason: expected [Function] to throw error matching /counter/i but got 'not used'

[Killed] LogicalOperator
src/model/OutputDataCreator.ts:135:8
     if (
       !Number.isSafeInteger(counter) ||
       counter < 0 ||
-      (amounts.length > 0 && !Number.isSafeInteger(lastCounter))
+      (amounts.length > 0 || !Number.isSafeInteger(lastCounter))
     ) {
       throw new CTSError('Counter must be an integer in the range 0 <= counter <= 2^53 - 1');
killedBy: DefaultOutputDataCreator a subclassed single-output hook is called once per counter within a safe range
statusReason: Counter must be an integer in the range 0 <= counter <= 2^53 - 1

[Killed] BooleanLiteral
src/model/OutputDataCreator.ts:135:30
     if (
       !Number.isSafeInteger(counter) ||
       counter < 0 ||
-      (amounts.length > 0 && !Number.isSafeInteger(lastCounter))
+      (amounts.length > 0 && Number.isSafeInteger(lastCounter))
     ) {
       throw new CTSError('Counter must be an integer in the range 0 <= counter <= 2^53 - 1');
killedBy: DefaultOutputDataCreator a subclassed single-output hook also rejects counter ranges that would alias
statusReason: expected [Function] to throw error matching /counter/i but got 'not used'

[Killed] BlockStatement
src/model/OutputDataCreator.ts:136:7
       !Number.isSafeInteger(counter) ||
       counter < 0 ||
       (amounts.length > 0 && !Number.isSafeInteger(lastCounter))
-    ) {
-      throw new CTSError('Counter must be an integer in the range 0 <= counter <= 2^53 - 1');
-    }
+    ) {}
     return amounts.map((a, i) =>
       this.createSingleDeterministicData(a, seed, counter + i, keyset.id),
killedBy: DefaultOutputDataCreator a subclassed single-output hook also rejects counter ranges that would alias
statusReason: expected [Function] to throw error matching /counter/i but got 'not used'

[Killed] ArrowFunction
src/model/OutputDataCreator.ts:139:24
     ) {
       throw new CTSError('Counter must be an integer in the range 0 <= counter <= 2^53 - 1');
     }
-    return amounts.map((a, i) =>
-      this.createSingleDeterministicData(a, seed, counter + i, keyset.id),
+    return amounts.map(() => undefined,
     );
   }
killedBy: DefaultOutputDataCreator a subclassed single-output hook is called once per counter within a safe range
statusReason: expected [] to deeply equal [ 7, 8 ]

[Killed] ArithmeticOperator
src/model/OutputDataCreator.ts:140:51
       throw new CTSError('Counter must be an integer in the range 0 <= counter <= 2^53 - 1');
     }
     return amounts.map((a, i) =>
-      this.createSingleDeterministicData(a, seed, counter + i, keyset.id),
+      this.createSingleDeterministicData(a, seed, counter - i, keyset.id),
     );
   }
killedBy: DefaultOutputDataCreator a subclassed single-output hook is called once per counter within a safe range
statusReason: expected [ 7, 6 ] to deeply equal [ 7, 8 ]

[Killed] BlockStatement
src/model/OutputDataCreator.ts:153:21
     seed: Uint8Array,
     counter: number,
     keysetId: string,
-  ): OutputDataLike {
-    return OutputData.createSingleDeterministicData(amount, seed, counter, keysetId);
-  }
+  ): OutputDataLike {}
 }
 
killedBy: DefaultOutputDataCreator delegates single deterministic output creation to OutputData
statusReason: expected undefined to deeply equal OutputData{ …(6) }
