[Killed] ConditionalExpression
src/wallet/CounterSource.ts:189:11
 
   async setNext(counterKey: string, next: number): Promise<void> {
     await this.withLock(counterKey, (k) => {
-      if (next < 0) throw new CTSError('setNext: negative next not allowed');
+      if (true) throw new CTSError('setNext: negative next not allowed');
       assertSafeCounter(k, next);
       this.next.set(k, next);
killedBy: EphemeralCounterSource refuses an unsafe cursor at every entry point
statusReason: expected [Function] to throw error matching /safe integer/i but got 'setNext: negative next not allowed'

[Killed] CallExpression
src/wallet/CounterSource.ts:190:7
   async setNext(counterKey: string, next: number): Promise<void> {
     await this.withLock(counterKey, (k) => {
       if (next < 0) throw new CTSError('setNext: negative next not allowed');
-      assertSafeCounter(k, next);
+      ;
       this.next.set(k, next);
     });
killedBy: EphemeralCounterSource refuses an unsafe cursor at every entry point
statusReason: promise resolved "undefined" instead of rejecting

[Killed] CallExpression
src/wallet/CounterSource.ts:191:7
     await this.withLock(counterKey, (k) => {
       if (next < 0) throw new CTSError('setNext: negative next not allowed');
       assertSafeCounter(k, next);
-      this.next.set(k, next);
+      ;
     });
   }
killedBy: EphemeralCounterSource gives two spellings of one hex counter key the same cursor
statusReason: expected { '00bd033559de27d0': 10 } to deeply equal { '00bd033559de27d0': 12 }

[Killed] BlockStatement
src/wallet/CounterSource.ts:195:47
     });
   }
 
-  snapshot(): Promise<Record<string, number>> {
-    return Promise.resolve(Object.fromEntries(this.next.entries()));
-  }
+  snapshot(): Promise<Record<string, number>> {}
 }
 
killedBy: EphemeralCounterSource keeps the higher cursor when a seed lists two spellings of one key
statusReason: expected undefined to deeply equal { '00bd033559de27d0': 100 }

[Killed] BlockStatement
src/wallet/CounterSource.ts:213:95
  *
  * @param initial - Optional seed values (`{ [counterKey]: nextCounter }`).
  */
-export function createEphemeralCounterSource(initial?: Record<string, number>): CounterSource {
-  return new EphemeralCounterSource(initial);
-}
+export function createEphemeralCounterSource(initial?: Record<string, number>): CounterSource {}
 
killedBy: EphemeralCounterSource factory seeds initial next values
statusReason: Cannot read properties of undefined (reading 'snapshot')
