[Killed] BlockStatement
src/wallet/WalletCounters.ts:13:53
   /**
    * Returns the "next" counter for a specified keyset.
    */
-  async peekNext(keysetId: string): Promise<number> {
-    const r = await this.src.reserve(keysetId, 0);
-    return r.start;
-  }
+  async peekNext(keysetId: string): Promise<number> {}
 
   /**
killedBy: Wallet quote lock keys recoverQuoteLockKey scans the seed to the quote pubkey, and misses cleanly
statusReason: expected undefined to be 'e40782c6b87aa6941aeddc8af96114bb958ca…' // Object.is equality

[Killed] BlockStatement
src/wallet/WalletCounters.ts:21:76
   /**
    * Bumps the counter if it is behind `minNext` (no-op if ahead).
    */
-  async advanceToAtLeast(keysetId: string, minNext: number): Promise<void> {
-    // Mandatory on CounterSource
-    await this.src.advanceToAtLeast(keysetId, minNext);
-  }
+  async advanceToAtLeast(keysetId: string, minNext: number): Promise<void> {}
 
   /**
killedBy: WalletCounters advanceToAtLeast delegates and is idempotent (EphemeralCounterSource)
statusReason: expected 2 to be 10 // Object.is equality

[Killed] BlockStatement
src/wallet/WalletCounters.ts:31:64
    *
    * @throws If the CounterSource does not support setNext()
    */
-  async setNext(keysetId: string, next: number): Promise<void> {
-    // Optional capability
-    if (typeof this.src.setNext === 'function') {
-      await this.src.setNext(keysetId, next);
-      return;
-    }
-    throw new CTSError('CounterSource does not support setNext()');
-  }
+  async setNext(keysetId: string, next: number): Promise<void> {}
   /**
    * Returns the current "next" per keyset (what will be reserved next).
killedBy: WalletCounters setNext delegates when available (EphemeralCounterSource)
statusReason: expected +0 to be 42 // Object.is equality

[Killed] ConditionalExpression
src/wallet/WalletCounters.ts:33:9
    */
   async setNext(keysetId: string, next: number): Promise<void> {
     // Optional capability
-    if (typeof this.src.setNext === 'function') {
+    if (false) {
       await this.src.setNext(keysetId, next);
       return;
killedBy: WalletCounters setNext delegates when available (EphemeralCounterSource)
statusReason: CounterSource does not support setNext()

[Killed] EqualityOperator
src/wallet/WalletCounters.ts:33:9
    */
   async setNext(keysetId: string, next: number): Promise<void> {
     // Optional capability
-    if (typeof this.src.setNext === 'function') {
+    if (typeof this.src.setNext !== 'function') {
       await this.src.setNext(keysetId, next);
       return;
killedBy: WalletCounters setNext delegates when available (EphemeralCounterSource)
statusReason: CounterSource does not support setNext()

[Killed] BlockStatement
src/wallet/WalletCounters.ts:44:53
    *
    * @throws If the CounterSource does not support snapshot()
    */
-  async snapshot(): Promise<Record<string, number>> {
-    // Optional capability
-    if (typeof this.src.snapshot === 'function') {
-      return await this.src.snapshot();
-    }
-    throw new CTSError('CounterSource does not support snapshot()');
-  }
+  async snapshot(): Promise<Record<string, number>> {}
 }
 
killedBy: WalletCounters snapshot delegates to source when available (EphemeralCounterSource)
statusReason: expected undefined to deeply equal { A: 5, B: 1 }

[Killed] BlockStatement
src/wallet/WalletCounters.ts:46:50
    */
   async snapshot(): Promise<Record<string, number>> {
     // Optional capability
-    if (typeof this.src.snapshot === 'function') {
-      return await this.src.snapshot();
-    }
+    if (typeof this.src.snapshot === 'function') {}
     throw new CTSError('CounterSource does not support snapshot()');
   }
killedBy: WalletCounters snapshot delegates to source when available (EphemeralCounterSource)
statusReason: CounterSource does not support snapshot()

[Killed] EqualityOperator
src/wallet/WalletCounters.ts:46:9
    */
   async snapshot(): Promise<Record<string, number>> {
     // Optional capability
-    if (typeof this.src.snapshot === 'function') {
+    if (typeof this.src.snapshot !== 'function') {
       return await this.src.snapshot();
     }
killedBy: WalletCounters snapshot delegates to source when available (EphemeralCounterSource)
statusReason: CounterSource does not support snapshot()
