[Killed] ConditionalExpression
src/mint/Mint.ts:1712:8
     });
     nullIfUndefined(data, 'selected_fee_index', 'outpoint');
     if (
-      (data.selected_fee_index !== null && !Number.isSafeInteger(data.selected_fee_index)) ||
+      (false) ||
       (data.outpoint !== null && typeof data.outpoint !== 'string')
     ) {
killedBy: Mint normalization normalizeMeltOnchainFields throws when selected_fee_index is non-null and not a safe integer
statusReason: promise resolved "{ quote: 'q1', …(9) }" instead of rejecting

[Killed] EqualityOperator
src/mint/Mint.ts:1712:8
     });
     nullIfUndefined(data, 'selected_fee_index', 'outpoint');
     if (
-      (data.selected_fee_index !== null && !Number.isSafeInteger(data.selected_fee_index)) ||
+      (data.selected_fee_index === null && !Number.isSafeInteger(data.selected_fee_index)) ||
       (data.outpoint !== null && typeof data.outpoint !== 'string')
     ) {
killedBy: Mint normalization normalizeMeltOnchainFields normalizes a valid onchain melt quote response
statusReason: Invalid response from mint

[Killed] ConditionalExpression
src/mint/Mint.ts:1713:8
     nullIfUndefined(data, 'selected_fee_index', 'outpoint');
     if (
       (data.selected_fee_index !== null && !Number.isSafeInteger(data.selected_fee_index)) ||
-      (data.outpoint !== null && typeof data.outpoint !== 'string')
+      (false)
     ) {
       this._logger.error('Invalid response from mint...', { op: 'onchain melt quote' });
killedBy: Mint normalization normalizeMeltOnchainFields throws when outpoint is non-null and not a string
statusReason: promise resolved "{ quote: 'q1', …(9) }" instead of rejecting
