[Killed] LogicalOperator
src/model/PaymentRequest.ts:56:7
  * @throws If `value` is present, non-null, and not one of those four values.
  */
 function normalizePaymentRequestFlag(value: unknown, field: 's' | 'mp'): boolean | undefined {
-  if (value === undefined || value === null) return undefined;
+  if (value === undefined && value === null) return undefined;
   if (value === true || value === 1) return true;
   if (value === false || value === 0) return false;
killedBy: findCashuPayload finds a creqA payment request in a bitcoin: URI parameter
statusReason: expected null to strictly equal { kind: 'paymentRequest', …(1) }

[Killed] LogicalOperator
src/model/PaymentRequest.ts:57:7
  */
 function normalizePaymentRequestFlag(value: unknown, field: 's' | 'mp'): boolean | undefined {
   if (value === undefined || value === null) return undefined;
-  if (value === true || value === 1) return true;
+  if (value === true && value === 1) return true;
   if (value === false || value === 0) return false;
   throw new CTSError(`invalid payment request: ${field} must be a boolean (or 0/1)`);
killedBy: wallet.isPaymentRequestSatisfied adds mf when this mint is outside the request mint list
statusReason: invalid payment request: mp must be a boolean (or 0/1)

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:57:25
  */
 function normalizePaymentRequestFlag(value: unknown, field: 's' | 'mp'): boolean | undefined {
   if (value === undefined || value === null) return undefined;
-  if (value === true || value === 1) return true;
+  if (value === true || false) return true;
   if (value === false || value === 0) return false;
   throw new CTSError(`invalid payment request: ${field} must be a boolean (or 0/1)`);
killedBy: payment requests mint preferences (mp, sm) mp accepts the numeric 0/1 form
statusReason: invalid payment request: mp must be a boolean (or 0/1)

[Killed] LogicalOperator
src/model/PaymentRequest.ts:58:7
 function normalizePaymentRequestFlag(value: unknown, field: 's' | 'mp'): boolean | undefined {
   if (value === undefined || value === null) return undefined;
   if (value === true || value === 1) return true;
-  if (value === false || value === 0) return false;
+  if (value === false && value === 0) return false;
   throw new CTSError(`invalid payment request: ${field} must be a boolean (or 0/1)`);
 }
killedBy: payment requests mint preferences (mp, sm) isMintListStrict resolves NUT-18 default-to-strict semantic
statusReason: invalid payment request: s must be a boolean (or 0/1)

[Killed] EqualityOperator
src/model/PaymentRequest.ts:58:7
 function normalizePaymentRequestFlag(value: unknown, field: 's' | 'mp'): boolean | undefined {
   if (value === undefined || value === null) return undefined;
   if (value === true || value === 1) return true;
-  if (value === false || value === 0) return false;
+  if (value !== false || value === 0) return false;
   throw new CTSError(`invalid payment request: ${field} must be a boolean (or 0/1)`);
 }
killedBy: payment requests mint preferences (mp, sm) isMintListStrict resolves NUT-18 default-to-strict semantic
statusReason: invalid payment request: s must be a boolean (or 0/1)

[Killed] StringLiteral
src/model/PaymentRequest.ts:59:22
   if (value === undefined || value === null) return undefined;
   if (value === true || value === 1) return true;
   if (value === false || value === 0) return false;
-  throw new CTSError(`invalid payment request: ${field} must be a boolean (or 0/1)`);
+  throw new CTSError(``);
 }
 
killedBy: payment requests mint preferences (mp, sm) rejects a policy flag that is not a boolean or 0/1
statusReason: expected [Function] to throw error matching /mp/ but got ''

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:101:19
     this.description = options.description;
     this.transport = options.transport;
     this.nut10 = options.nut10;
-    this.amount = options.amount !== undefined ? Amount.from(options.amount) : undefined;
+    this.amount = true ? Amount.from(options.amount) : undefined;
     this.supportedMethods = options.supportedMethods?.map((m) => ({
       method: m.method,
killedBy: payment requests test decoding payment requests with no amount
statusReason: Unsupported amount input type

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:104:12
     this.amount = options.amount !== undefined ? Amount.from(options.amount) : undefined;
     this.supportedMethods = options.supportedMethods?.map((m) => ({
       method: m.method,
-      fee: m.fee !== undefined ? Amount.from(m.fee) : undefined,
+      fee: false ? Amount.from(m.fee) : undefined,
     }));
     this.singleUse = normalizePaymentRequestFlag(options.singleUse, 's');
killedBy: payment requests mint preferences (mp, sm) encode/decode preferred mint list with supported methods (creqA)
statusReason: expected 'creqApmFpdXByZWZlcnJlZF9mZWVfbWV0aG9k…' to be 'creqApmFpdXByZWZlcnJlZF9mZWVfbWV0aG9k…' // Object.is equality

[Survived] StringLiteral
src/model/PaymentRequest.ts:106:69
       method: m.method,
       fee: m.fee !== undefined ? Amount.from(m.fee) : undefined,
     }));
-    this.singleUse = normalizePaymentRequestFlag(options.singleUse, 's');
+    this.singleUse = normalizePaymentRequestFlag(options.singleUse, "");
     this.mintsPreferred = normalizePaymentRequestFlag(options.mintsPreferred, 'mp');
   }

[Killed] StringLiteral
src/model/PaymentRequest.ts:107:79
       fee: m.fee !== undefined ? Amount.from(m.fee) : undefined,
     }));
     this.singleUse = normalizePaymentRequestFlag(options.singleUse, 's');
-    this.mintsPreferred = normalizePaymentRequestFlag(options.mintsPreferred, 'mp');
+    this.mintsPreferred = normalizePaymentRequestFlag(options.mintsPreferred, "");
   }
 
killedBy: payment requests mint preferences (mp, sm) rejects a policy flag that is not a boolean or 0/1
statusReason: expected [Function] to throw error matching /mp/ but got 'invalid payment request:  must be a b…'

[Killed] BlockStatement
src/model/PaymentRequest.ts:118:30
    * - `false` if the list is preferred/advisory (`mp === true`)
    */
   get isMintListStrict(): boolean | undefined {
-    if (!this.mints?.length) {
-      return undefined;
-    }
+    if (!this.mints?.length) {}
     return this.mintsPreferred !== true;
   }
killedBy: wallet.isPaymentRequestSatisfied enforces the net-of-input-fees formula (NUT-18)
statusReason: this wallet's mint is not in the request's strict mint list

[Killed] EqualityOperator
src/model/PaymentRequest.ts:130:24
    * requests can still be inspected.
    */
   private assertUnitRule(): void {
-    if (!this.unit && (this.amount !== undefined || this.supportedMethods?.length)) {
+    if (!this.unit && (this.amount === undefined || this.supportedMethods?.length)) {
       throw new CTSError(
         'invalid payment request: unit (u) is required when an amount (a) or supported methods (sm) are set',
killedBy: payment requests mint preferences (mp, sm) unit rule: a or sm without u fails on encode and pricing, decode stays lenient
statusReason: expected [Function] to throw an error

[Killed] OptionalChaining
src/model/PaymentRequest.ts:130:53
    * requests can still be inspected.
    */
   private assertUnitRule(): void {
-    if (!this.unit && (this.amount !== undefined || this.supportedMethods?.length)) {
+    if (!this.unit && (this.amount !== undefined || this.supportedMethods.length)) {
       throw new CTSError(
         'invalid payment request: unit (u) is required when an amount (a) or supported methods (sm) are set',
killedBy: payment requests toRawRequest omits every optional field, including the tri-state singleUse
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:156:9
   feesFor(mint: string, meltMethods?: string[]): Amount {
     this.assertUnitRule();
     // Fees compensate the payee for melting out: payments from a listed mint carry none.
-    if (!this.supportedMethods?.length || this.includesMint(mint)) {
+    if (false) {
       return Amount.zero();
     }
killedBy: payment requests mint preferences (mp, sm) feesFor prices the lowest applicable per-method (mf) fee
statusReason: expected false to be truthy

[Survived] StringLiteral
src/model/PaymentRequest.ts:182:9
   amountToSend(mint: string, meltMethods?: string[]): Amount {
     if (!this.amount) {
       throw new CTSError(
-        'cannot compute amount to send: request has no amount; use feesFor() and add the payer-chosen amount',
+        "",
       );
     }

[Killed] EqualityOperator
src/model/PaymentRequest.ts:204:36
       }
     };
     const target = norm(mintUrl);
-    return this.mints?.some((m) => norm(m) === target) ?? false;
+    return this.mints?.some((m) => norm(m) !== target) ?? false;
   }
 
killedBy: wallet.isPaymentRequestSatisfied adds mf when this mint is outside the request mint list
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/model/PaymentRequest.ts:204:12
       }
     };
     const target = norm(mintUrl);
-    return this.mints?.some((m) => norm(m) === target) ?? false;
+    return this.mints?.some(m => norm(m) === target) && false;
   }
 
killedBy: payment requests mint preferences (mp, sm) feesFor prices the lowest applicable per-method (mf) fee
statusReason: expected false to be truthy

[Killed] BlockStatement
src/model/PaymentRequest.ts:221:60
    * @throws If the request has a strict mint list and `mint` is not in it.
    */
   encodePayload(mint: string, proofs: Proof[], opts?: { memo?: string; unit?: string }): string {
-    if (this.isMintListStrict && !this.includesMint(mint)) {
-      throw new CTSError("mint is not in the request's strict mint list");
-    }
+    if (this.isMintListStrict && !this.includesMint(mint)) {}
     const payload: PaymentRequestPayload = {
       ...(this.id !== undefined && { id: this.id }),
killedBy: NUT-18 payment payloads encodePayload enforces a strict mint list but not a preferred one
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/model/PaymentRequest.ts:222:26
    */
   encodePayload(mint: string, proofs: Proof[], opts?: { memo?: string; unit?: string }): string {
     if (this.isMintListStrict && !this.includesMint(mint)) {
-      throw new CTSError("mint is not in the request's strict mint list");
+      throw new CTSError("");
     }
     const payload: PaymentRequestPayload = {
killedBy: NUT-18 payment payloads encodePayload enforces a strict mint list but not a preferred one
statusReason: expected [Function] to throw error including 'mint is not in the request\'s strict …' but got ''

[Killed] OptionalChaining
src/model/PaymentRequest.ts:226:11
     }
     const payload: PaymentRequestPayload = {
       ...(this.id !== undefined && { id: this.id }),
-      ...(opts?.memo !== undefined && { memo: opts.memo }),
+      ...(opts.memo !== undefined && { memo: opts.memo }),
       unit: this.unit ?? opts?.unit ?? 'sat',
       mint,
killedBy: NUT-18 payment payloads encodePayload omits id and memo when absent and defaults the unit
statusReason: Cannot read properties of undefined (reading 'memo')

[Killed] LogicalOperator
src/model/PaymentRequest.ts:227:13
     const payload: PaymentRequestPayload = {
       ...(this.id !== undefined && { id: this.id }),
       ...(opts?.memo !== undefined && { memo: opts.memo }),
-      unit: this.unit ?? opts?.unit ?? 'sat',
+      unit: (this.unit ?? opts?.unit) && 'sat',
       mint,
       proofs,
killedBy: NUT-18 payment payloads encodePayload omits id and memo when absent and defaults the unit
statusReason: invalid payment payload: missing unit

[Killed] EqualityOperator
src/model/PaymentRequest.ts:251:36
     } catch (e) {
       throw new CTSError('invalid payment payload: not valid JSON', { cause: e });
     }
-    if (typeof raw !== 'object' || raw === null || Array.isArray(raw)) {
+    if (typeof raw !== 'object' || raw !== null || Array.isArray(raw)) {
       throw new CTSError('invalid payment payload: expected a JSON object');
     }
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: invalid payment payload: expected a JSON object

[Killed] EqualityOperator
src/model/PaymentRequest.ts:255:9
       throw new CTSError('invalid payment payload: expected a JSON object');
     }
     const { id, memo, unit, mint, proofs } = raw as Record<string, unknown>;
-    if (typeof mint !== 'string' || !mint) {
+    if (typeof mint === 'string' || !mint) {
       throw new CTSError('invalid payment payload: missing mint');
     }
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: invalid payment payload: missing mint

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:258:9
     if (typeof mint !== 'string' || !mint) {
       throw new CTSError('invalid payment payload: missing mint');
     }
-    if (typeof unit !== 'string' || !unit) {
+    if (false || !unit) {
       throw new CTSError('invalid payment payload: missing unit');
     }
killedBy: NUT-18 payment payloads decodePayload rejects missing unit
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:264:31
     if (id !== undefined && typeof id !== 'string') {
       throw new CTSError('invalid payment payload: id must be a string');
     }
-    if (memo !== undefined && typeof memo !== 'string') {
+    if (memo !== undefined && true) {
       throw new CTSError('invalid payment payload: memo must be a string');
     }
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: invalid payment payload: memo must be a string

[Killed] LogicalOperator
src/model/PaymentRequest.ts:264:9
     if (id !== undefined && typeof id !== 'string') {
       throw new CTSError('invalid payment payload: id must be a string');
     }
-    if (memo !== undefined && typeof memo !== 'string') {
+    if (memo !== undefined || typeof memo !== 'string') {
       throw new CTSError('invalid payment payload: memo must be a string');
     }
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: invalid payment payload: memo must be a string

[Killed] StringLiteral
src/model/PaymentRequest.ts:265:26
       throw new CTSError('invalid payment payload: id must be a string');
     }
     if (memo !== undefined && typeof memo !== 'string') {
-      throw new CTSError('invalid payment payload: memo must be a string');
+      throw new CTSError("");
     }
     if (!Array.isArray(proofs) || proofs.length === 0) {
killedBy: NUT-18 payment payloads decodePayload rejects a non-string memo
statusReason: expected [Function] to throw error matching /memo must be a string/ but got ''

[Killed] LogicalOperator
src/model/PaymentRequest.ts:267:9
     if (memo !== undefined && typeof memo !== 'string') {
       throw new CTSError('invalid payment payload: memo must be a string');
     }
-    if (!Array.isArray(proofs) || proofs.length === 0) {
+    if (!Array.isArray(proofs) && proofs.length === 0) {
       throw new CTSError('invalid payment payload: missing proofs');
     }
killedBy: NUT-18 payment payloads decodePayload rejects missing proofs
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/model/PaymentRequest.ts:272:9
     }
     const normalized = proofs.map((p: unknown, i: number) => {
       if (
-        typeof p !== 'object' ||
+        typeof p === 'object' ||
         p === null ||
         Array.isArray(p) ||
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: invalid payment payload: malformed proof at index 0

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:282:11
         throw new CTSError(`invalid payment payload: malformed proof at index ${i}`);
       }
       const amount = (p as Record<string, unknown>).amount;
-      if (typeof amount === 'string') {
+      if (true) {
         // A quoted amount is the tell-tale of plain JSON.stringify over bigint proofs (or an
         // Amount VO via toJSON). NUT-18 amounts are JSON numbers: point the payer at the encoder.
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: invalid payment payload: proof amount at index 0 is a string; amounts must be JSON numbers (serialize with encodePayload() or JSONInt.stringify, not JSON.stringify)

[Killed] EqualityOperator
src/model/PaymentRequest.ts:289:41
           `invalid payment payload: proof amount at index ${i} is a string; amounts must be JSON numbers (serialize with encodePayload() or JSONInt.stringify, not JSON.stringify)`,
         );
       }
-      if (typeof amount !== 'number' && typeof amount !== 'bigint') {
+      if (typeof amount !== 'number' && typeof amount === 'bigint') {
         throw new CTSError(`invalid payment payload: malformed proof amount at index ${i}`);
       }
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: invalid payment payload: malformed proof amount at index 0

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:295:11
       return { ...(p as Omit<Proof, 'amount'>), amount: Amount.from(amount) };
     });
     return {
-      ...(id !== undefined && { id }),
+      ...(false),
       ...(memo !== undefined && { memo }),
       unit,
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: expected undefined to be 'inv-1' // Object.is equality

[Killed] EqualityOperator
src/model/PaymentRequest.ts:296:11
     });
     return {
       ...(id !== undefined && { id }),
-      ...(memo !== undefined && { memo }),
+      ...(memo === undefined && { memo }),
       unit,
       mint,
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: expected undefined to be 'hi' // Object.is equality

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:296:11
     });
     return {
       ...(id !== undefined && { id }),
-      ...(memo !== undefined && { memo }),
+      ...(false),
       unit,
       mint,
killedBy: NUT-18 payment payloads encodePayload round-trips through decodePayload, filling id and unit from the request
statusReason: expected undefined to be 'hi' // Object.is equality

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:306:9
   toRawRequest() {
     this.assertUnitRule();
     const rawRequest: RawPaymentRequest = {};
-    if (this.transport) {
+    if (false) {
       rawRequest.t = this.transport.map((t: PaymentRequestTransport) => ({
         t: t.type,
killedBy: payment requests encode payment requests
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/model/PaymentRequest.ts:313:18
         g: t.tags,
       }));
     }
-    if (this.id) {
-      rawRequest.i = this.id;
-    }
+    if (this.id) {}
     if (this.amount) {
       rawRequest.a = this.amount.toBigInt();
killedBy: payment requests encode payment requests
statusReason: expected undefined to be '4840f51e' // Object.is equality

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:316:9
     if (this.id) {
       rawRequest.i = this.id;
     }
-    if (this.amount) {
+    if (false) {
       rawRequest.a = this.amount.toBigInt();
     }
killedBy: payment requests encode payment requests
statusReason: expected undefined to be truthy

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:325:9
     if (this.mints) {
       rawRequest.m = this.mints;
     }
-    if (this.mintsPreferred !== undefined) {
+    if (false) {
       rawRequest.mp = this.mintsPreferred;
     }
killedBy: payment requests mint preferences (mp, sm) encode/decode preferred mint list with supported methods (creqA)
statusReason: expected 'creqApWFpdXByZWZlcnJlZF9mZWVfbWV0aG9k…' to be 'creqApmFpdXByZWZlcnJlZF9mZWVfbWV0aG9k…' // Object.is equality

[Killed] LogicalOperator
src/model/PaymentRequest.ts:328:9
     if (this.mintsPreferred !== undefined) {
       rawRequest.mp = this.mintsPreferred;
     }
-    if (this.supportedMethods && this.supportedMethods.length > 0) {
+    if (this.supportedMethods || this.supportedMethods.length > 0) {
       rawRequest.sm = this.supportedMethods.map((m) =>
         m.fee !== undefined ? { mn: m.method, mf: m.fee.toBigInt() } : { mn: m.method },
killedBy: payment requests encode payment requests
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/model/PaymentRequest.ts:328:34
     if (this.mintsPreferred !== undefined) {
       rawRequest.mp = this.mintsPreferred;
     }
-    if (this.supportedMethods && this.supportedMethods.length > 0) {
+    if (this.supportedMethods && this.supportedMethods.length <= 0) {
       rawRequest.sm = this.supportedMethods.map((m) =>
         m.fee !== undefined ? { mn: m.method, mf: m.fee.toBigInt() } : { mn: m.method },
killedBy: payment requests mint preferences (mp, sm) encode/decode preferred mint list with supported methods (creqA)
statusReason: expected 'creqApWFpdXByZWZlcnJlZF9mZWVfbWV0aG9k…' to be 'creqApmFpdXByZWZlcnJlZF9mZWVfbWV0aG9k…' // Object.is equality

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:330:9
     }
     if (this.supportedMethods && this.supportedMethods.length > 0) {
       rawRequest.sm = this.supportedMethods.map((m) =>
-        m.fee !== undefined ? { mn: m.method, mf: m.fee.toBigInt() } : { mn: m.method },
+        false ? { mn: m.method, mf: m.fee.toBigInt() } : { mn: m.method },
       );
     }
killedBy: PaymentRequestBuilder builds a full request that round-trips through creqA
statusReason: expected undefined to be truthy

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:336:9
     if (this.description) {
       rawRequest.d = this.description;
     }
-    if (this.singleUse !== undefined) {
+    if (true) {
       rawRequest.s = this.singleUse;
     }
killedBy: payment requests mint preferences (mp, sm) encode/decode preferred mint list with supported methods (creqA)
statusReason: expected 'creqAp2FpdXByZWZlcnJlZF9mZWVfbWV0aG9k…' to be 'creqApmFpdXByZWZlcnJlZF9mZWVfbWV0aG9k…' // Object.is equality

[Killed] EqualityOperator
src/model/PaymentRequest.ts:336:9
     if (this.description) {
       rawRequest.d = this.description;
     }
-    if (this.singleUse !== undefined) {
+    if (this.singleUse === undefined) {
       rawRequest.s = this.singleUse;
     }
killedBy: payment requests encode payment requests
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/model/PaymentRequest.ts:339:21
     if (this.singleUse !== undefined) {
       rawRequest.s = this.singleUse;
     }
-    if (this.nut10) {
-      rawRequest.nut10 = {
-        k: this.nut10.kind,
-        d: this.nut10.data,
-        t: this.nut10.tags,
-      };
-    }
+    if (this.nut10) {}
     if (this.nutroot) {
       rawRequest.nutroot = {
killedBy: payment requests encode payment requests
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:346:9
         t: this.nut10.tags,
       };
     }
-    if (this.nutroot) {
+    if (false) {
       rawRequest.nutroot = {
         k: this.nutroot.receiverKey,
killedBy: nutroot (v3) request marking round-trips through creqA, tags and all
statusReason: expected undefined to deeply equal { …(3) }

[Killed] LogicalOperator
src/model/PaymentRequest.ts:349:13
     if (this.nutroot) {
       rawRequest.nutroot = {
         k: this.nutroot.receiverKey,
-        ...(this.nutroot.leaves?.length && { l: this.nutroot.leaves }),
+        ...(this.nutroot.leaves?.length || {
+  l: this.nutroot.leaves
+}),
         ...(this.nutroot.blindKeys?.length && { b: this.nutroot.blindKeys }),
       };
killedBy: nutroot (v3) request marking round-trips through creqA, tags and all
statusReason: expected { …(3) } to deeply equal { …(3) }

[Killed] OptionalChaining
src/model/PaymentRequest.ts:350:13
       rawRequest.nutroot = {
         k: this.nutroot.receiverKey,
         ...(this.nutroot.leaves?.length && { l: this.nutroot.leaves }),
-        ...(this.nutroot.blindKeys?.length && { b: this.nutroot.blindKeys }),
+        ...(this.nutroot.blindKeys.length && { b: this.nutroot.blindKeys }),
       };
     }
killedBy: nutroot (v3) request marking round-trips through creqA, tags and all
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] StringLiteral
src/model/PaymentRequest.ts:360:12
     const rawRequest: RawPaymentRequest = this.toRawRequest();
     const data = encodeCBOR(rawRequest);
     const encodedData = encodeUint8ToBase64UrlPadded(data);
-    return 'creq' + 'A' + encodedData;
+    return "" + 'A' + encodedData;
   }
 
killedBy: payment requests encode payment requests
statusReason: unsupported pr: invalid prefix

[Killed] ObjectLiteral
src/model/PaymentRequest.ts:380:50
    */
   toEncodedCreqB(): string {
     this.assertUnitRule();
-    const tlvRequest: DecodedTLVPaymentRequest = {
-      id: this.id,
-      amount: this.amount !== undefined ? this.amount.toBigInt() : undefined,
-      unit: this.unit,
-      singleUse: this.singleUse,
-      mints: this.mints,
-      mintsPreferred: this.mintsPreferred,
-      supportedMethods: this.supportedMethods?.map((m) => ({
-        method: m.method,
-        fee: m.fee !== undefined ? m.fee.toBigInt() : undefined,
-      })),
-      description: this.description,
-      transports: this.transport,
-      nut10: this.nut10
-        ? {
-            kind: this.nut10.kind,
-            data: this.nut10.data,
-            tags: this.nut10.tags,
-          }
-        : undefined,
-      nutroot: this.nutroot,
-    };
+    const tlvRequest: DecodedTLVPaymentRequest = {};
 
     const tlvBytes = encodeTLV(tlvRequest);
killedBy: payment requests mint preferences (mp, sm) encode/decode preferred mint list with supported methods (creqB)
statusReason: expected 'CREQB1JFTKV8' to be 'CREQB1QYQP2URJV4NX2UNJV4J97EN9V40K6ET…' // Object.is equality

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:382:15
     this.assertUnitRule();
     const tlvRequest: DecodedTLVPaymentRequest = {
       id: this.id,
-      amount: this.amount !== undefined ? this.amount.toBigInt() : undefined,
+      amount: false ? this.amount.toBigInt() : undefined,
       unit: this.unit,
       singleUse: this.singleUse,
killedBy: payment requests mint preferences (mp, sm) encode/decode preferred mint list with supported methods (creqB)
statusReason: expected 'CREQB1QYQP2URJV4NX2UNJV4J97EN9V40K6ET…' to be 'CREQB1QYQP2URJV4NX2UNJV4J97EN9V40K6ET…' // Object.is equality

[Killed] ArrowFunction
src/model/PaymentRequest.ts:408:33
   }
 
   getTransport(type: PaymentRequestTransportType) {
-    return this.transport?.find((t: PaymentRequestTransport) => t.type === type);
+    return this.transport?.find(() => undefined);
   }
 
killedBy: payment requests test decoding payment requests with no amount
statusReason: expected undefined to be 'nprofile1qy28wumn8ghj7un9d3shjtnyv9kh…' // Object.is equality

[Killed] BooleanLiteral
src/model/PaymentRequest.ts:449:9
   toNutrootOptions(): ParsedNutrootOption | undefined {
     const nutroot = this.nutroot;
     if (!nutroot) return undefined;
-    if (!nutroot.receiverKey) {
+    if (nutroot.receiverKey) {
       throw new CTSError('nutroot option is missing its receiver key');
     }
killedBy: nutroot (v3) request marking the option converts to sender-side derivation arguments
statusReason: nutroot option is missing its receiver key

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:449:9
   toNutrootOptions(): ParsedNutrootOption | undefined {
     const nutroot = this.nutroot;
     if (!nutroot) return undefined;
-    if (!nutroot.receiverKey) {
+    if (false) {
       throw new CTSError('nutroot option is missing its receiver key');
     }
killedBy: nutroot (v3) request marking the receiver key is validated and case-canonicalized, both directions
statusReason: expected [Function] to throw error matching /missing its receiver key/ but got 'Invalid pubkey: expected 33-byte comp…'

[Killed] ConditionalExpression
src/model/PaymentRequest.ts:456:9
     // NUT-10: the payer offsets the NUMS base per output, so uniqueness no longer depends on
     // the tree and the requested leaves are reproduced unchanged. Leaves are still required:
     // nothing else could spend a proof with no key path.
-    if (receiverKey === NUTROOT_NUMS_KEY && !nutroot.leaves?.length) {
+    if (false) {
       throw new CTSError('malformed request: a NUMS receiver key requires leaves');
     }
killedBy: nutroot (v3) request marking a NUMS receiver key must come with leaves, but needs no blind-me key
statusReason: expected [Function] to throw an error

[Killed] OptionalChaining
src/model/PaymentRequest.ts:459:10
     if (receiverKey === NUTROOT_NUMS_KEY && !nutroot.leaves?.length) {
       throw new CTSError('malformed request: a NUMS receiver key requires leaves');
     }
-    if (!nutroot.leaves?.length) {
+    if (!nutroot.leaves.length) {
       if (nutroot.blindKeys?.length) {
         throw new CTSError('malformed request: blind-me keys require a tree');
killedBy: wallet.isPaymentRequestSatisfied a both-encoded request settles only legacy proofs carrying the requested lock
statusReason: Cannot read properties of undefined (reading 'length')
