[Killed] BlockStatement
src/wallet/LockBuilder.ts:193:30
    *
    * @throws If the leaf does not serialize (unknown type, unattainable threshold, no keys).
    */
-  addLeaf(leaf: NutrootLeaf) {
-    serializeNutrootLeaf(leaf); // validate at the setter, like the other inputs
-    this.leaves.push(leaf.type === 'commit' ? { ...leaf } : { ...leaf, keys: [...leaf.keys] });
-    return this;
-  }
+  addLeaf(leaf: NutrootLeaf) {}
 
   /**
killedBy: LockBuilder.validate() flags leaf locks on pre-v3 only
statusReason: Cannot read properties of undefined (reading 'validate')

[Killed] ConditionalExpression
src/wallet/LockBuilder.ts:195:22
    */
   addLeaf(leaf: NutrootLeaf) {
     serializeNutrootLeaf(leaf); // validate at the setter, like the other inputs
-    this.leaves.push(leaf.type === 'commit' ? { ...leaf } : { ...leaf, keys: [...leaf.keys] });
+    this.leaves.push(false ? { ...leaf } : { ...leaf, keys: [...leaf.keys] });
     return this;
   }
killedBy: LockBuilder addCommitment binds the lock to outside data
statusReason: leaf.keys is not iterable

[Killed] EqualityOperator
src/wallet/LockBuilder.ts:195:22
    */
   addLeaf(leaf: NutrootLeaf) {
     serializeNutrootLeaf(leaf); // validate at the setter, like the other inputs
-    this.leaves.push(leaf.type === 'commit' ? { ...leaf } : { ...leaf, keys: [...leaf.keys] });
+    this.leaves.push(leaf.type !== 'commit' ? { ...leaf } : { ...leaf, keys: [...leaf.keys] });
     return this;
   }
killedBy: LockBuilder addCommitment binds the lock to outside data
statusReason: leaf.keys is not iterable

[Killed] BlockStatement
src/wallet/LockBuilder.ts:205:31
    *
    * @throws If the hash is not a 64-character hex string.
    */
-  addCommitment(hash: string) {
-    return this.addLeaf({ type: 'commit', hash: normalizeHashlock(hash) });
-  }
+  addCommitment(hash: string) {}
 
   /**
killedBy: LockBuilder addCommitment binds the lock to outside data
statusReason: Cannot read properties of undefined (reading 'toOptions')

[Killed] StringLiteral
src/wallet/LockBuilder.ts:206:33
    * @throws If the hash is not a 64-character hex string.
    */
   addCommitment(hash: string) {
-    return this.addLeaf({ type: 'commit', hash: normalizeHashlock(hash) });
+    return this.addLeaf({ type: "", hash: normalizeHashlock(hash) });
   }
 
killedBy: LockBuilder addCommitment binds the lock to outside data
statusReason: Unknown leaf type:

[Killed] ObjectLiteral
src/wallet/LockBuilder.ts:206:25
    * @throws If the hash is not a 64-character hex string.
    */
   addCommitment(hash: string) {
-    return this.addLeaf({ type: 'commit', hash: normalizeHashlock(hash) });
+    return this.addLeaf({});
   }
 
killedBy: LockBuilder addCommitment binds the lock to outside data
statusReason: Unknown leaf type: undefined

[Killed] LogicalOperator
src/wallet/LockBuilder.ts:213:9
    * Builds the {@link LockOptions}, validating through a real encoder so a bad lock fails here.
    */
   toOptions(): LockOptions {
-    if (this.mainKeys.length === 0 && this.hashlock === undefined && this.leaves.length === 0) {
+    if (this.mainKeys.length === 0 && this.hashlock === undefined || this.leaves.length === 0) {
       throw new CTSError('At least one main pubkey, hashlock, or leaf is required');
     }
killedBy: LockBuilder emits semantic LockOptions
statusReason: At least one main pubkey, hashlock, or leaf is required

[Killed] ConditionalExpression
src/wallet/LockBuilder.ts:213:9
    * Builds the {@link LockOptions}, validating through a real encoder so a bad lock fails here.
    */
   toOptions(): LockOptions {
-    if (this.mainKeys.length === 0 && this.hashlock === undefined && this.leaves.length === 0) {
+    if (false) {
       throw new CTSError('At least one main pubkey, hashlock, or leaf is required');
     }
killedBy: P2PKBuilder.toOptions() throws when building with no lock pubkeys
statusReason: expected [Function] to throw error matching /At least one main pubkey/i but got 'At least one lock pubkey is required'

[Killed] StringLiteral
src/wallet/LockBuilder.ts:214:26
    */
   toOptions(): LockOptions {
     if (this.mainKeys.length === 0 && this.hashlock === undefined && this.leaves.length === 0) {
-      throw new CTSError('At least one main pubkey, hashlock, or leaf is required');
+      throw new CTSError("");
     }
     // Encoders drop inert refund keys quietly; the builder catches them as the user error they
killedBy: P2PKBuilder.toOptions() throws when building with no lock pubkeys
statusReason: expected [Function] to throw error matching /At least one main pubkey/i but got ''

[Killed] ConditionalExpression
src/wallet/LockBuilder.ts:218:9
     }
     // Encoders drop inert refund keys quietly; the builder catches them as the user error they
     // almost certainly are (a forgotten lockUntil).
-    if (this.refundKeys.length > 0 && this.locktime === undefined) {
+    if (false) {
       throw new CTSError('refund keys require a locktime');
     }
killedBy: P2PKBuilder.toOptions() throws if refund keys are provided without locktime
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/wallet/LockBuilder.ts:222:11
       throw new CTSError('refund keys require a locktime');
     }
     const lock: LockOptions = {
-      ...(this.mainKeys.length > 0 && { mainKeys: this.mainKeys.slice() }),
+      ...(false),
       // Drop a redundant threshold of 1, but keep an explicit one when its key set is empty so
       // encoding rejects the impossible lock rather than silently relaxing it.
killedBy: P2PKBuilder.toOptions() returns single lock key as a string
statusReason: At least one lock pubkey is required

[Killed] ConditionalExpression
src/wallet/LockBuilder.ts:222:11
       throw new CTSError('refund keys require a locktime');
     }
     const lock: LockOptions = {
-      ...(this.mainKeys.length > 0 && { mainKeys: this.mainKeys.slice() }),
+      ...(true),
       // Drop a redundant threshold of 1, but keep an explicit one when its key set is empty so
       // encoding rejects the impossible lock rather than silently relaxing it.
killedBy: P2PKBuilder.toOptions() returns single lock key as a string
statusReason: At least one lock pubkey is required

[Killed] LogicalOperator
src/wallet/LockBuilder.ts:225:40
       ...(this.mainKeys.length > 0 && { mainKeys: this.mainKeys.slice() }),
       // Drop a redundant threshold of 1, but keep an explicit one when its key set is empty so
       // encoding rejects the impossible lock rather than silently relaxing it.
-      ...(this.nSigs !== undefined && (this.nSigs > 1 || this.mainKeys.length === 0)
+      ...(this.nSigs !== undefined && (this.nSigs > 1 && this.mainKeys.length === 0)
         ? { requiredMainSignatures: this.nSigs }
         : {}),
killedBy: P2PKBuilder.toOptions() throws when requiredSignatures exceeds available lock keys and omits when <= 1
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
src/wallet/LockBuilder.ts:228:11
       ...(this.nSigs !== undefined && (this.nSigs > 1 || this.mainKeys.length === 0)
         ? { requiredMainSignatures: this.nSigs }
         : {}),
-      ...(this.hashlock !== undefined && { hashlock: this.hashlock }),
+      ...(this.hashlock !== undefined || {
+  hashlock: this.hashlock
+}),
       ...(this.locktime !== undefined && { locktime: this.locktime }),
       ...(this.refundKeys.length > 0 && { refundKeys: this.refundKeys.slice() }),
killedBy: P2PKBuilder.toOptions() lowercases the hashlock so it matches createHTLCHash output
statusReason: At least one lock pubkey is required

[Killed] LogicalOperator
src/wallet/LockBuilder.ts:229:11
         ? { requiredMainSignatures: this.nSigs }
         : {}),
       ...(this.hashlock !== undefined && { hashlock: this.hashlock }),
-      ...(this.locktime !== undefined && { locktime: this.locktime }),
+      ...(this.locktime !== undefined || {
+  locktime: this.locktime
+}),
       ...(this.refundKeys.length > 0 && { refundKeys: this.refundKeys.slice() }),
       ...(this.nSigsRefund !== undefined && (this.nSigsRefund > 1 || this.refundKeys.length === 0)
killedBy: P2PKBuilder.toOptions() de-duplicates lock and refund keys silently
statusReason: expected undefined to deeply equal [ …(2) ]

[Killed] EqualityOperator
src/wallet/LockBuilder.ts:231:11
       ...(this.hashlock !== undefined && { hashlock: this.hashlock }),
       ...(this.locktime !== undefined && { locktime: this.locktime }),
       ...(this.refundKeys.length > 0 && { refundKeys: this.refundKeys.slice() }),
-      ...(this.nSigsRefund !== undefined && (this.nSigsRefund > 1 || this.refundKeys.length === 0)
+      ...(this.nSigsRefund === undefined && (this.nSigsRefund > 1 || this.refundKeys.length === 0)
         ? { requiredRefundSignatures: this.nSigsRefund }
         : {}),
killedBy: P2PKBuilder.toOptions() throws when requiredRefundSignatures exceeds available refund keys and omits when <= 1
statusReason: expected [Function] to throw an error

[Killed] ObjectLiteral
src/wallet/LockBuilder.ts:232:11
       ...(this.locktime !== undefined && { locktime: this.locktime }),
       ...(this.refundKeys.length > 0 && { refundKeys: this.refundKeys.slice() }),
       ...(this.nSigsRefund !== undefined && (this.nSigsRefund > 1 || this.refundKeys.length === 0)
-        ? { requiredRefundSignatures: this.nSigsRefund }
+        ? {}
         : {}),
       ...(this.leaves.length > 0 && { leaves: this.leaves.map((l) => ({ ...l })) }),
killedBy: P2PKBuilder.toOptions() throws when requiredRefundSignatures exceeds available refund keys and omits when <= 1
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/wallet/LockBuilder.ts:234:11
       ...(this.nSigsRefund !== undefined && (this.nSigsRefund > 1 || this.refundKeys.length === 0)
         ? { requiredRefundSignatures: this.nSigsRefund }
         : {}),
-      ...(this.leaves.length > 0 && { leaves: this.leaves.map((l) => ({ ...l })) }),
+      ...(false),
       ...(this._blindKeys !== undefined && { blindKeys: this._blindKeys }),
       ...(this._disclosure && { disclosure: true }),
killedBy: LockBuilder.validate() flags leaf locks on pre-v3 only
statusReason: expected [ …(1) ] to deeply equal []

[Killed] EqualityOperator
src/wallet/LockBuilder.ts:234:11
       ...(this.nSigsRefund !== undefined && (this.nSigsRefund > 1 || this.refundKeys.length === 0)
         ? { requiredRefundSignatures: this.nSigsRefund }
         : {}),
-      ...(this.leaves.length > 0 && { leaves: this.leaves.map((l) => ({ ...l })) }),
+      ...(this.leaves.length <= 0 && { leaves: this.leaves.map((l) => ({ ...l })) }),
       ...(this._blindKeys !== undefined && { blindKeys: this._blindKeys }),
       ...(this._disclosure && { disclosure: true }),
killedBy: P2PKBuilder.toOptions() accepts lockUntil as Date or number (unix seconds or ms)
statusReason: Anyone-after-locktime does not fit a v3 lock: leaves require at least one key. Lock the timeout to your own refund key instead

[Killed] ConditionalExpression
src/wallet/LockBuilder.ts:235:11
         ? { requiredRefundSignatures: this.nSigsRefund }
         : {}),
       ...(this.leaves.length > 0 && { leaves: this.leaves.map((l) => ({ ...l })) }),
-      ...(this._blindKeys !== undefined && { blindKeys: this._blindKeys }),
+      ...(true),
       ...(this._disclosure && { disclosure: true }),
       ...(this.extraTags.length > 0 && { additionalTags: this.extraTags.slice() }),
killedBy: P2PKBuilder.blindKeys() sets blindKeys flag and round-trips via fromOptions
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/wallet/LockBuilder.ts:235:11
         ? { requiredRefundSignatures: this.nSigsRefund }
         : {}),
       ...(this.leaves.length > 0 && { leaves: this.leaves.map((l) => ({ ...l })) }),
-      ...(this._blindKeys !== undefined && { blindKeys: this._blindKeys }),
+      ...(this._blindKeys === undefined && { blindKeys: this._blindKeys }),
       ...(this._disclosure && { disclosure: true }),
       ...(this.extraTags.length > 0 && { additionalTags: this.extraTags.slice() }),
killedBy: P2PKBuilder.blindKeys() sets blindKeys flag and round-trips via fromOptions
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/wallet/LockBuilder.ts:236:45
         : {}),
       ...(this.leaves.length > 0 && { leaves: this.leaves.map((l) => ({ ...l })) }),
       ...(this._blindKeys !== undefined && { blindKeys: this._blindKeys }),
-      ...(this._disclosure && { disclosure: true }),
+      ...(this._disclosure && { disclosure: false }),
       ...(this.extraTags.length > 0 && { additionalTags: this.extraTags.slice() }),
       ...(this._sigAll && { sigAll: true }),
killedBy: LockBuilder.disclose() sets disclosure, round-trips via fromOptions, and encodes for both versions
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/wallet/LockBuilder.ts:237:11
       ...(this.leaves.length > 0 && { leaves: this.leaves.map((l) => ({ ...l })) }),
       ...(this._blindKeys !== undefined && { blindKeys: this._blindKeys }),
       ...(this._disclosure && { disclosure: true }),
-      ...(this.extraTags.length > 0 && { additionalTags: this.extraTags.slice() }),
+      ...(false),
       ...(this._sigAll && { sigAll: true }),
     };
killedBy: P2PKBuilder.toOptions() returns a defensive copy of additionalTags, isolated from later mutations
statusReason: expected undefined to deeply equal [ [ 'foo', 'bar' ] ]

[Killed] LogicalOperator
src/wallet/LockBuilder.ts:237:11
       ...(this.leaves.length > 0 && { leaves: this.leaves.map((l) => ({ ...l })) }),
       ...(this._blindKeys !== undefined && { blindKeys: this._blindKeys }),
       ...(this._disclosure && { disclosure: true }),
-      ...(this.extraTags.length > 0 && { additionalTags: this.extraTags.slice() }),
+      ...(this.extraTags.length > 0 || {
+  additionalTags: this.extraTags.slice()
+}),
       ...(this._sigAll && { sigAll: true }),
     };
killedBy: P2PKBuilder.toOptions() returns a defensive copy of additionalTags, isolated from later mutations
statusReason: expected undefined to deeply equal [ [ 'foo', 'bar' ] ]

[Killed] LogicalOperator
src/wallet/LockBuilder.ts:238:11
       ...(this._blindKeys !== undefined && { blindKeys: this._blindKeys }),
       ...(this._disclosure && { disclosure: true }),
       ...(this.extraTags.length > 0 && { additionalTags: this.extraTags.slice() }),
-      ...(this._sigAll && { sigAll: true }),
+      ...(this._sigAll || {
+  sigAll: true
+}),
     };
     // Smoke-test through the encoder checks so a bad lock fails here, not at send time.
killedBy: P2PKBuilder.toOptions() accepts lockUntil as Date or number (unix seconds or ms)
statusReason: expected 'SIG_ALL' to be undefined // Object.is equality

[Killed] EqualityOperator
src/wallet/LockBuilder.ts:259:11
   validate(target: 'v3' | 'pre-v3'): CTSError[] {
     try {
       const lock = this.toOptions();
-      if (target === 'v3') {
+      if (target !== 'v3') {
         lockToNutrootOptions(lock);
       } else {
killedBy: LockBuilder.validate() flags anyone-after-locktime on v3 only
statusReason: expected [ …(1) ] to deeply equal []

[Killed] BlockStatement
src/wallet/LockBuilder.ts:259:28
   validate(target: 'v3' | 'pre-v3'): CTSError[] {
     try {
       const lock = this.toOptions();
-      if (target === 'v3') {
-        lockToNutrootOptions(lock);
-      } else {
+      if (target === 'v3') {} else {
         assertP2PKLockEncodes(lock);
       }
killedBy: LockBuilder.validate() flags anyone-after-locktime on v3 only
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/wallet/LockBuilder.ts:280:11
     // boolean.
     for (const field of ['mainKeys', 'refundKeys', 'blindKeys'] as const) {
       const value = lock[field];
-      if (value === undefined || Array.isArray(value)) continue;
+      if (value !== undefined || Array.isArray(value)) continue;
       if (field === 'blindKeys' && typeof value === 'boolean') continue;
       throw new CTSError(`${field} must be an array of pubkeys`);
killedBy: P2PKBuilder.toOptions() fromOptions preserves a canonical seconds locktime >= 1e12 (no ms heuristic on replay)
statusReason: blindKeys must be an array of pubkeys

[Killed] EqualityOperator
src/wallet/LockBuilder.ts:281:11
     for (const field of ['mainKeys', 'refundKeys', 'blindKeys'] as const) {
       const value = lock[field];
       if (value === undefined || Array.isArray(value)) continue;
-      if (field === 'blindKeys' && typeof value === 'boolean') continue;
+      if (field !== 'blindKeys' && typeof value === 'boolean') continue;
       throw new CTSError(`${field} must be an array of pubkeys`);
     }
killedBy: LockBuilder round-trips through fromOptions
statusReason: blindKeys must be an array of pubkeys

[Killed] StringLiteral
src/wallet/LockBuilder.ts:282:26
       const value = lock[field];
       if (value === undefined || Array.isArray(value)) continue;
       if (field === 'blindKeys' && typeof value === 'boolean') continue;
-      throw new CTSError(`${field} must be an array of pubkeys`);
+      throw new CTSError(``);
     }
     if (lock.hashlock !== undefined) b.addHashlock(lock.hashlock);
killedBy: LockBuilder fromOptions takes key lists as arrays only
statusReason: expected [Function] to throw error matching /mainKeys must be an array/ but got ''

[Killed] ConditionalExpression
src/wallet/LockBuilder.ts:284:9
       if (field === 'blindKeys' && typeof value === 'boolean') continue;
       throw new CTSError(`${field} must be an array of pubkeys`);
     }
-    if (lock.hashlock !== undefined) b.addHashlock(lock.hashlock);
+    if (false) b.addHashlock(lock.hashlock);
     if (lock.mainKeys?.length) b.addMainPubkey(lock.mainKeys);
     // lock.locktime is already canonical Unix seconds; assign directly so lockUntil's
killedBy: LockBuilder round-trips through fromOptions
statusReason: expected { …(2) } to deeply equal { …(3) }

[Killed] ConditionalExpression
src/wallet/LockBuilder.ts:285:9
       throw new CTSError(`${field} must be an array of pubkeys`);
     }
     if (lock.hashlock !== undefined) b.addHashlock(lock.hashlock);
-    if (lock.mainKeys?.length) b.addMainPubkey(lock.mainKeys);
+    if (false) b.addMainPubkey(lock.mainKeys);
     // lock.locktime is already canonical Unix seconds; assign directly so lockUntil's
     // ms heuristic can't re-interpret a >= 1e12 second value and expire the lock.
killedBy: LockBuilder round-trips through fromOptions
statusReason: expected { …(2) } to deeply equal { …(3) }

[Killed] ConditionalExpression
src/wallet/LockBuilder.ts:288:9
     if (lock.mainKeys?.length) b.addMainPubkey(lock.mainKeys);
     // lock.locktime is already canonical Unix seconds; assign directly so lockUntil's
     // ms heuristic can't re-interpret a >= 1e12 second value and expire the lock.
-    if (lock.locktime !== undefined) b.locktime = assertUnixSeconds(lock.locktime);
+    if (true) b.locktime = assertUnixSeconds(lock.locktime);
     if (lock.refundKeys?.length) b.addRefundPubkey(lock.refundKeys);
     if (lock.requiredMainSignatures !== undefined)
killedBy: LockBuilder round-trips through fromOptions
statusReason: locktime must be a non-negative finite Unix time, got undefined

[Killed] ConditionalExpression
src/wallet/LockBuilder.ts:289:9
     // lock.locktime is already canonical Unix seconds; assign directly so lockUntil's
     // ms heuristic can't re-interpret a >= 1e12 second value and expire the lock.
     if (lock.locktime !== undefined) b.locktime = assertUnixSeconds(lock.locktime);
-    if (lock.refundKeys?.length) b.addRefundPubkey(lock.refundKeys);
+    if (false) b.addRefundPubkey(lock.refundKeys);
     if (lock.requiredMainSignatures !== undefined)
       b.requireMainSignatures(lock.requiredMainSignatures);
killedBy: P2PKBuilder.toOptions() round-trips via fromOptions
statusReason: expected { kind: 'HTLC', …(5) } to deeply equal { kind: 'HTLC', …(6) }

[Killed] ConditionalExpression
src/wallet/LockBuilder.ts:290:9
     // ms heuristic can't re-interpret a >= 1e12 second value and expire the lock.
     if (lock.locktime !== undefined) b.locktime = assertUnixSeconds(lock.locktime);
     if (lock.refundKeys?.length) b.addRefundPubkey(lock.refundKeys);
-    if (lock.requiredMainSignatures !== undefined)
+    if (false)
       b.requireMainSignatures(lock.requiredMainSignatures);
     if (lock.requiredRefundSignatures !== undefined)
killedBy: P2PKBuilder.toOptions() round-trips via fromOptions
statusReason: expected { kind: 'HTLC', …(5) } to deeply equal { kind: 'HTLC', …(6) }

[Killed] EqualityOperator
src/wallet/LockBuilder.ts:292:9
     if (lock.refundKeys?.length) b.addRefundPubkey(lock.refundKeys);
     if (lock.requiredMainSignatures !== undefined)
       b.requireMainSignatures(lock.requiredMainSignatures);
-    if (lock.requiredRefundSignatures !== undefined)
+    if (lock.requiredRefundSignatures === undefined)
       b.requireRefundSignatures(lock.requiredRefundSignatures);
     for (const leaf of lock.leaves ?? []) b.addLeaf(leaf);
killedBy: P2PKBuilder.toOptions() fromOptions preserves a canonical seconds locktime >= 1e12 (no ms heuristic on replay)
statusReason: requiredRefundSignatures must be a positive integer, got undefined

[Killed] BlockStatement
src/wallet/LockBuilder.ts:295:67
     if (lock.requiredRefundSignatures !== undefined)
       b.requireRefundSignatures(lock.requiredRefundSignatures);
     for (const leaf of lock.leaves ?? []) b.addLeaf(leaf);
-    if (lock.blindKeys !== undefined && lock.blindKeys !== false) {
-      b.blindKeys(lock.blindKeys === true ? undefined : lock.blindKeys);
-    }
+    if (lock.blindKeys !== undefined && lock.blindKeys !== false) {}
     if (lock.disclosure) b.disclose();
     if (lock.additionalTags?.length) b.addTags(lock.additionalTags);
killedBy: P2PKBuilder.blindKeys() sets blindKeys flag and round-trips via fromOptions
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/wallet/LockBuilder.ts:295:41
     if (lock.requiredRefundSignatures !== undefined)
       b.requireRefundSignatures(lock.requiredRefundSignatures);
     for (const leaf of lock.leaves ?? []) b.addLeaf(leaf);
-    if (lock.blindKeys !== undefined && lock.blindKeys !== false) {
+    if (lock.blindKeys !== undefined && lock.blindKeys === false) {
       b.blindKeys(lock.blindKeys === true ? undefined : lock.blindKeys);
     }
killedBy: LockBuilder round-trips through fromOptions
statusReason: expected { …(2) } to deeply equal { …(3) }

[Killed] ConditionalExpression
src/wallet/LockBuilder.ts:296:19
       b.requireRefundSignatures(lock.requiredRefundSignatures);
     for (const leaf of lock.leaves ?? []) b.addLeaf(leaf);
     if (lock.blindKeys !== undefined && lock.blindKeys !== false) {
-      b.blindKeys(lock.blindKeys === true ? undefined : lock.blindKeys);
+      b.blindKeys(true ? undefined : lock.blindKeys);
     }
     if (lock.disclosure) b.disclose();
killedBy: LockBuilder fromOptions takes key lists as arrays only
statusReason: expected true to deeply equal [ Array(1) ]

[Killed] CallExpression
src/wallet/LockBuilder.ts:299:38
       b.blindKeys(lock.blindKeys === true ? undefined : lock.blindKeys);
     }
     if (lock.disclosure) b.disclose();
-    if (lock.additionalTags?.length) b.addTags(lock.additionalTags);
+    if (lock.additionalTags?.length) ;
     if (lock.sigAll) b.sigAll();
     return b;
killedBy: P2PKBuilder addTag and addTags round trips additionalTags via fromOptions
statusReason: expected { kind: 'P2PK', …(2) } to deeply equal { kind: 'P2PK', …(3) }

[Killed] ConditionalExpression
src/wallet/LockBuilder.ts:300:9
     }
     if (lock.disclosure) b.disclose();
     if (lock.additionalTags?.length) b.addTags(lock.additionalTags);
-    if (lock.sigAll) b.sigAll();
+    if (true) b.sigAll();
     return b;
   }
killedBy: P2PKBuilder.toOptions() round-trips a keyless HTLC via fromOptions (no pubkeys)
statusReason: expected { kind: 'HTLC', …(2) } to deeply equal { kind: 'HTLC', …(1) }
