[Survived] StringLiteral
src/wallet/Wallet.ts:2815:32
     },
   ): Promise<MintQuoteBolt12Response> {
     this.requireSupport('mint', 'bolt12');
-    this.requireMintableKeyset('createMintQuoteBolt12');
+    this.requireMintableKeyset("");
     this.failIf(typeof pubkey !== 'string', 'A pubkey is required to lock the mint quote');
     const normPubkey = normalizeSecpPubkey(pubkey);

[Killed] BooleanLiteral
src/wallet/Wallet.ts:2820:33
     const normPubkey = normalizeSecpPubkey(pubkey);
     // Check if mint supports description for bolt12
     const mintInfo = this.getMintInfo();
-    if (options?.description && !mintInfo.supportsNut04Description('bolt12', this._unit)) {
+    if (options?.description && mintInfo.supportsNut04Description('bolt12', this._unit)) {
       this.fail('Mint does not support description for bolt12');
     }
killedBy: createMintQuoteBolt12 mutants rejects a description when bolt12 description is unsupported
statusReason: expected [Function] to throw error including 'Mint does not support description for…' but got '[MSW] Cannot bypass a request when us…'

[Killed] OptionalChaining
src/wallet/Wallet.ts:2820:9
     const normPubkey = normalizeSecpPubkey(pubkey);
     // Check if mint supports description for bolt12
     const mintInfo = this.getMintInfo();
-    if (options?.description && !mintInfo.supportsNut04Description('bolt12', this._unit)) {
+    if (options.description && !mintInfo.supportsNut04Description('bolt12', this._unit)) {
       this.fail('Mint does not support description for bolt12');
     }
killedBy: createMintQuoteBolt12 mutants omits amount and description when called with no options
statusReason: Cannot read properties of undefined (reading 'description')

[Killed] StringLiteral
src/wallet/Wallet.ts:2821:17
     // Check if mint supports description for bolt12
     const mintInfo = this.getMintInfo();
     if (options?.description && !mintInfo.supportsNut04Description('bolt12', this._unit)) {
-      this.fail('Mint does not support description for bolt12');
+      this.fail("");
     }
 
killedBy: createMintQuoteBolt12 mutants rejects a description when bolt12 description is unsupported
statusReason: expected [Function] to throw error including 'Mint does not support description for…' but got ''

[Killed] OptionalChaining
src/wallet/Wallet.ts:2825:7
     }
 
     const amount =
-      options?.amount !== undefined
+      options.amount !== undefined
         ? this.parseAmount(options.amount, 'createMintQuoteBolt12')
         : undefined;
killedBy: createMintQuoteBolt12 mutants omits amount and description when called with no options
statusReason: Cannot read properties of undefined (reading 'amount')

[Killed] ConditionalExpression
src/wallet/Wallet.ts:2825:7
     }
 
     const amount =
-      options?.amount !== undefined
+      false
         ? this.parseAmount(options.amount, 'createMintQuoteBolt12')
         : undefined;
killedBy: createMintQuoteBolt12 mutants accepts a quote for exactly the requested amount
statusReason: Mint quote amount does not match

[Killed] CallExpression
src/wallet/Wallet.ts:2837:5
     };
 
     const res = await this.mint.createMintQuoteBolt12(mintQuotePayload);
-    assertQuoteUnit(res, this.unit, this._logger);
+    ;
     // The offer itself is opaque here, so the quoted amount is the only thing to hold the mint to.
     const amountMatches =
killedBy: createMintQuoteBolt12 mutants rejects a quote denominated in a different unit
statusReason: promise resolved "{ quote: 'q-bolt12-amount', …(10) }" instead of rejecting

[Killed] EqualityOperator
src/wallet/Wallet.ts:2840:52
     assertQuoteUnit(res, this.unit, this._logger);
     // The offer itself is opaque here, so the quoted amount is the only thing to hold the mint to.
     const amountMatches =
-      amount === undefined ? res.amount === null : res.amount !== null && res.amount.equals(amount);
+      amount === undefined ? res.amount === null : res.amount === null && res.amount.equals(amount);
     this.failIf(!amountMatches, 'Mint quote amount does not match', {
       expected: amount?.toString() ?? null,
killedBy: createMintQuoteBolt12 mutants accepts a quote for exactly the requested amount
statusReason: Mint quote amount does not match

[Killed] ConditionalExpression
src/wallet/Wallet.ts:2840:7
     assertQuoteUnit(res, this.unit, this._logger);
     // The offer itself is opaque here, so the quoted amount is the only thing to hold the mint to.
     const amountMatches =
-      amount === undefined ? res.amount === null : res.amount !== null && res.amount.equals(amount);
+      true ? res.amount === null : res.amount !== null && res.amount.equals(amount);
     this.failIf(!amountMatches, 'Mint quote amount does not match', {
       expected: amount?.toString() ?? null,
killedBy: createMintQuoteBolt12 mutants accepts a quote for exactly the requested amount
statusReason: Mint quote amount does not match

[Killed] BooleanLiteral
src/wallet/Wallet.ts:2841:17
     // The offer itself is opaque here, so the quoted amount is the only thing to hold the mint to.
     const amountMatches =
       amount === undefined ? res.amount === null : res.amount !== null && res.amount.equals(amount);
-    this.failIf(!amountMatches, 'Mint quote amount does not match', {
+    this.failIf(amountMatches, 'Mint quote amount does not match', {
       expected: amount?.toString() ?? null,
       quoted: res.amount?.toString() ?? null,
killedBy: createMintQuoteBolt12 mutants omits amount and description when called with no options
statusReason: Mint quote amount does not match

[Killed] OptionalChaining
src/wallet/Wallet.ts:2842:17
     const amountMatches =
       amount === undefined ? res.amount === null : res.amount !== null && res.amount.equals(amount);
     this.failIf(!amountMatches, 'Mint quote amount does not match', {
-      expected: amount?.toString() ?? null,
+      expected: amount.toString() ?? null,
       quoted: res.amount?.toString() ?? null,
     });
killedBy: createMintQuoteBolt12 mutants omits amount and description when called with no options
statusReason: Cannot read properties of undefined (reading 'toString')

[Survived] LogicalOperator
src/wallet/Wallet.ts:2842:17
     const amountMatches =
       amount === undefined ? res.amount === null : res.amount !== null && res.amount.equals(amount);
     this.failIf(!amountMatches, 'Mint quote amount does not match', {
-      expected: amount?.toString() ?? null,
+      expected: amount?.toString() && null,
       quoted: res.amount?.toString() ?? null,
     });

[Killed] OptionalChaining
src/wallet/Wallet.ts:2843:15
       amount === undefined ? res.amount === null : res.amount !== null && res.amount.equals(amount);
     this.failIf(!amountMatches, 'Mint quote amount does not match', {
       expected: amount?.toString() ?? null,
-      quoted: res.amount?.toString() ?? null,
+      quoted: res.amount.toString() ?? null,
     });
     assertQuoteLockedTo(res, normPubkey, this._logger);
killedBy: createMintQuoteBolt12 mutants omits amount and description when called with no options
statusReason: Cannot read properties of null (reading 'toString')

[Survived] LogicalOperator
src/wallet/Wallet.ts:2843:15
       amount === undefined ? res.amount === null : res.amount !== null && res.amount.equals(amount);
     this.failIf(!amountMatches, 'Mint quote amount does not match', {
       expected: amount?.toString() ?? null,
-      quoted: res.amount?.toString() ?? null,
+      quoted: res.amount?.toString() && null,
     });
     assertQuoteLockedTo(res, normPubkey, this._logger);

[Killed] CallExpression
src/wallet/Wallet.ts:2845:5
       expected: amount?.toString() ?? null,
       quoted: res.amount?.toString() ?? null,
     });
-    assertQuoteLockedTo(res, normPubkey, this._logger);
+    ;
     return res;
   }
killedBy: createMintQuoteBolt12 mutants rejects when the mint returns a quote locked to a different pubkey
statusReason: promise resolved "{ quote: 'q-bolt12-other', …(10) }" instead of rejecting

[Killed] BlockStatement
src/wallet/Wallet.ts:2857:83
    * @returns The mint will return a mint quote with a Bitcoin address for minting tokens.
    * @experimental Onchain support follows NUT-30 semantics and may change.
    */
-  async createMintQuoteOnchain(pubkey: string): Promise<MintQuoteOnchainResponse> {
-    this.requireSupport('mint', 'onchain');
-    this.requireMintableKeyset('createMintQuoteOnchain');
-    this.failIf(typeof pubkey !== 'string', 'A pubkey is required to lock the mint quote');
-    const normPubkey = normalizeSecpPubkey(pubkey);
-    const res = await this.mint.createMintQuoteOnchain({ unit: this._unit, pubkey: normPubkey });
-    assertQuoteUnit(res, this.unit, this._logger);
-    assertQuoteLockedTo(res, normPubkey, this._logger);
-    return res;
-  }
+  async createMintQuoteOnchain(pubkey: string): Promise<MintQuoteOnchainResponse> {}
 
   // -----------------------------------------------------------------
killedBy: createMintQuoteOnchain mutants keeps the unit the mint quoted
statusReason: Cannot read properties of undefined (reading 'unit')

[Survived] StringLiteral
src/wallet/Wallet.ts:2859:32
    */
   async createMintQuoteOnchain(pubkey: string): Promise<MintQuoteOnchainResponse> {
     this.requireSupport('mint', 'onchain');
-    this.requireMintableKeyset('createMintQuoteOnchain');
+    this.requireMintableKeyset("");
     this.failIf(typeof pubkey !== 'string', 'A pubkey is required to lock the mint quote');
     const normPubkey = normalizeSecpPubkey(pubkey);

[Killed] ConditionalExpression
src/wallet/Wallet.ts:2860:17
   async createMintQuoteOnchain(pubkey: string): Promise<MintQuoteOnchainResponse> {
     this.requireSupport('mint', 'onchain');
     this.requireMintableKeyset('createMintQuoteOnchain');
-    this.failIf(typeof pubkey !== 'string', 'A pubkey is required to lock the mint quote');
+    this.failIf(true, 'A pubkey is required to lock the mint quote');
     const normPubkey = normalizeSecpPubkey(pubkey);
     const res = await this.mint.createMintQuoteOnchain({ unit: this._unit, pubkey: normPubkey });
killedBy: createMintQuoteOnchain mutants keeps the unit the mint quoted
statusReason: A pubkey is required to lock the mint quote

[Killed] CallExpression
src/wallet/Wallet.ts:2863:5
     this.failIf(typeof pubkey !== 'string', 'A pubkey is required to lock the mint quote');
     const normPubkey = normalizeSecpPubkey(pubkey);
     const res = await this.mint.createMintQuoteOnchain({ unit: this._unit, pubkey: normPubkey });
-    assertQuoteUnit(res, this.unit, this._logger);
+    ;
     assertQuoteLockedTo(res, normPubkey, this._logger);
     return res;
killedBy: createMintQuoteOnchain mutants rejects a quote denominated in a different unit
statusReason: promise resolved "{ quote: 'onchain-q-unit', …(9) }" instead of rejecting

[Killed] CallExpression
src/wallet/Wallet.ts:2864:5
     const normPubkey = normalizeSecpPubkey(pubkey);
     const res = await this.mint.createMintQuoteOnchain({ unit: this._unit, pubkey: normPubkey });
     assertQuoteUnit(res, this.unit, this._logger);
-    assertQuoteLockedTo(res, normPubkey, this._logger);
+    ;
     return res;
   }
killedBy: createMintQuoteOnchain mutants rejects when the mint returns a quote locked to a different pubkey
statusReason: promise resolved "{ quote: 'onchain-q-other', …(9) }" instead of rejecting

[Killed] ConditionalExpression
src/wallet/Wallet.ts:2906:21
   async checkMintQuoteBolt11(
     quote: string | MintQuoteBolt11Response,
   ): Promise<MintQuoteBolt11Response> {
-    const quoteId = typeof quote === 'string' ? quote : quote.quote;
+    const quoteId = false ? quote : quote.quote;
     const res = await this.mint.checkMintQuoteBolt11(quoteId);
     // No caller-side expectation here, so check the invoice against the quote's own amount.
killedBy: checkMintQuoteBolt11 mutants forwards the id from a string and from a quote object
statusReason: Mint quote response is for a different quote

[Killed] ConditionalExpression
src/wallet/Wallet.ts:2955:45
     quotes: Array<string | Pick<TRes, 'quote'>>,
     options?: { normalize?: (raw: Record<string, unknown>) => TRes },
   ): Promise<TRes[]> {
-    const quoteIds = quotes.map((quote) => (typeof quote === 'string' ? quote : quote.quote));
+    const quoteIds = quotes.map((quote) => (true ? quote : quote.quote));
     return this.mint.checkMintQuoteBatch<TRes>(method, quoteIds, {
       normalize: options?.normalize,
killedBy: generic mint/melt methods wallet.createMintQuote / checkMintQuote checkMintQuoteBatch with custom method hits /v1/mint/quote/{method}/check
statusReason: HTTP request failed

[Killed] ConditionalExpression
src/wallet/Wallet.ts:2974:45
   async checkMintQuoteBatchBolt11(
     quotes: Array<string | MintQuoteBolt11Response>,
   ): Promise<MintQuoteBolt11Response[]> {
-    const quoteIds = quotes.map((quote) => (typeof quote === 'string' ? quote : quote.quote));
+    const quoteIds = quotes.map((quote) => (true ? quote : quote.quote));
     const res = await this.mint.checkMintQuoteBatchBolt11(quoteIds);
     for (const quote of res) this.assertBolt11MintQuoteAmount(quote, quote.amount);
killedBy: generic mint/melt methods wallet.createMintQuote / checkMintQuote checkMintQuoteBatchBolt11 posts quote ids and normalizes responses
statusReason: HTTP request failed

[Killed] LogicalOperator
src/wallet/Wallet.ts:3008:32
     // With DLEQ we can verify the returned blinded signature is paired to the original B_.
     // Without DLEQ, equal-denomination reordering is a protocol trust assumption.
     const requiresDleq =
-      this._requireSigDleq && (this._mintInfo?.isSupported(12).supported ?? false);
+      this._requireSigDleq && (this._mintInfo?.isSupported(12).supported && false);
 
     for (let i = 0; i < signatures.length; i++) {
killedBy: requestTokens completeMint rejects missing DLEQ when mint advertises NUT-12
statusReason: promise resolved "[ { id: '00bd033559de27d0', …(3) } ]" instead of rejecting

[Killed] ConditionalExpression
src/wallet/Wallet.ts:3010:21
     const requiresDleq =
       this._requireSigDleq && (this._mintInfo?.isSupported(12).supported ?? false);
 
-    for (let i = 0; i < signatures.length; i++) {
+    for (let i = 0; false; i++) {
       this.failIf(
         signatures[i] == undefined,
killedBy: requestTokens completeMint rejects missing DLEQ when mint advertises NUT-12
statusReason: promise resolved "[ { id: '00bd033559de27d0', …(3) } ]" instead of rejecting

[Killed] LogicalOperator
src/wallet/Wallet.ts:3021:11
       const blank = outputData[i].blindedMessage.amount.isZero();
       // A zero-value signature on a blank carries no ecash and is dropped by the caller (NUT-08),
       // so nothing here applies to it, the DLEQ requirement included.
-      if (blank && signatures[i].amount.isZero()) continue;
+      if (blank || signatures[i].amount.isZero()) continue;
       this.failIf(
         !blank && signatures[i].id !== outputData[i].blindedMessage.id,
killedBy: melt proofs rejects missing DLEQ on melt change when mint advertises NUT-12
statusReason: expected { quote: { …(10) }, …(2) } to be an instance of MeltChangeError

[Killed] LogicalOperator
src/wallet/Wallet.ts:3027:9
       );
       this.failIf(
-        !blank && !signatures[i].amount.equals(outputData[i].blindedMessage.amount),
+        !blank || !signatures[i].amount.equals(outputData[i].blindedMessage.amount),
       );
killedBy: melt proofs test melt proofs base case
statusReason: Melt completed but its change could not be reconstructed; see cause: a keyset that will load rebuilds via createMeltChangeProofs(), anything else needs a NUT-09 restore

[Killed] LogicalOperator
src/wallet/Wallet.ts:3033:9
       // v3 (BLS) signatures intentionally omit DLEQ — pairing verification replaces it.
       const isV3 = isBlsKeyset(signatures[i].id);
       this.failIf(
-        requiresDleq && !isV3 && !signatures[i].dleq,
+        requiresDleq || !isV3 && !signatures[i].dleq,
         `Mint supports NUT-12, but returned a signature without DLEQ proof at index ${i}. Inputs may already be spent; if the wallet is seeded, try restoring (NUT-09) to recover.`,
       );
killedBy: requestTokens test requestTokens
statusReason: Mint supports NUT-12, but returned a signature without DLEQ proof at index 0. Inputs may already be spent; if the wallet is seeded, try restoring (NUT-09) to recover.

[Killed] ConditionalExpression
src/wallet/Wallet.ts:3033:9
       // v3 (BLS) signatures intentionally omit DLEQ — pairing verification replaces it.
       const isV3 = isBlsKeyset(signatures[i].id);
       this.failIf(
-        requiresDleq && !isV3 && !signatures[i].dleq,
+        true,
         `Mint supports NUT-12, but returned a signature without DLEQ proof at index ${i}. Inputs may already be spent; if the wallet is seeded, try restoring (NUT-09) to recover.`,
       );
killedBy: send offline/swap routing deterministic policy forces a swap even for an exact match
statusReason: Mint supports NUT-12, but returned a signature without DLEQ proof at index 0. Inputs may already be spent; if the wallet is seeded, try restoring (NUT-09) to recover.

[Killed] BlockStatement
src/wallet/Wallet.ts:3044:11
     paid: AmountLike,
     issued: AmountLike,
     requestedAmount: Amount,
-  ): void {
-    const amountPaid = Amount.from(paid);
-    const amountIssued = Amount.from(issued);
-    // A 0/0 snapshot may simply have been fetched before the payment was made (create -> pay
-    // externally -> mint with the original object); the mint is the source of truth.
-    if (amountPaid.isZero() && amountIssued.isZero()) {
-      return;
-    }
-    const availableAmount = amountPaid.subtract(amountIssued);
-    this.failIf(
-      requestedAmount.greaterThan(availableAmount),
-      `Mint quote has only ${availableAmount.toString()} available to mint; requested ${requestedAmount.toString()}`,
-      {
-        method,
-        amount_paid: amountPaid.toString(),
-        amount_issued: amountIssued.toString(),
-        requestedAmount: requestedAmount.toString(),
-      },
-    );
-  }
+  ): void {}
 
   /**
killedBy: generic mint/melt methods wallet.mintProofs prepareMint rejects bolt12 amounts above paid minus issued amount
statusReason: expected [Function] to throw error including 'Mint quote has only 2 available to mi…' but got 'No private key matches quote pubkey 0…'

[Killed] LogicalOperator
src/wallet/Wallet.ts:3049:9
     const amountIssued = Amount.from(issued);
     // A 0/0 snapshot may simply have been fetched before the payment was made (create -> pay
     // externally -> mint with the original object); the mint is the source of truth.
-    if (amountPaid.isZero() && amountIssued.isZero()) {
+    if (amountPaid.isZero() || amountIssued.isZero()) {
       return;
     }
killedBy: createMintQuoteBolt11 mutants a quote supplied as an id alone has its accounting checked against the mint
statusReason: promise resolved "{ method: 'bolt11', …(4) }" instead of rejecting

[Killed] BlockStatement
src/wallet/Wallet.ts:3118:23
     quote: string | MintQuoteBolt11Response,
     config?: MintProofsConfig,
     outputType?: OutputType,
-  ): Promise<Proof[]> {
-    this.requireSupport('mint', 'bolt11');
-    if (typeof quote === 'string') {
-      quote = await this.checkMintQuoteBolt11(quote);
-    }
-    assertQuoteUnit(quote, this.unit, this._logger);
-    const preview = await this.prepareMint('bolt11', amount, quote, config, outputType);
-    return this.completeMint(preview);
-  }
+  ): Promise<Proof[]> {}
 
   /**
killedBy: requestTokens test requestTokens
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/wallet/Wallet.ts:3120:36
     outputType?: OutputType,
   ): Promise<Proof[]> {
     this.requireSupport('mint', 'bolt11');
-    if (typeof quote === 'string') {
-      quote = await this.checkMintQuoteBolt11(quote);
-    }
+    if (typeof quote === 'string') {}
     assertQuoteUnit(quote, this.unit, this._logger);
     const preview = await this.prepareMint('bolt11', amount, quote, config, outputType);
killedBy: requestTokens prepareMint signs a locked quote through a sign callback fetches string quote IDs for custom outputs: wallet 00bd033559de27d0, output 02b7e077d020fabed456a6be138a8e20e9ef40b44d873fa12c00
statusReason: promise rejected "CTSError: Quote unit 'undefined' does not…" instead of resolving

[Survived] CallExpression
src/wallet/Wallet.ts:3123:5
     if (typeof quote === 'string') {
       quote = await this.checkMintQuoteBolt11(quote);
     }
-    assertQuoteUnit(quote, this.unit, this._logger);
+    ;
     const preview = await this.prepareMint('bolt11', amount, quote, config, outputType);
     return this.completeMint(preview);

[Killed] StringLiteral
src/wallet/Wallet.ts:3124:44
       quote = await this.checkMintQuoteBolt11(quote);
     }
     assertQuoteUnit(quote, this.unit, this._logger);
-    const preview = await this.prepareMint('bolt11', amount, quote, config, outputType);
+    const preview = await this.prepareMint("", amount, quote, config, outputType);
     return this.completeMint(preview);
   }
killedBy: requestTokens test requestTokens
statusReason: Invalid mint method:

[Survived] StringLiteral
src/wallet/Wallet.ts:3182:25
     config?: Omit<MintProofsConfig, 'privkey'>,
     outputType?: OutputType,
   ): Promise<Proof[]> {
-    this.requireSupport('mint', 'onchain');
+    this.requireSupport("", 'onchain');
     const preview = await this.prepareMint(
       'onchain',

[Killed] EqualityOperator
src/wallet/Wallet.ts:3221:42
       `prepareMint: expected a quote object, not a string ID. Pass { quote: id } and the wallet reads it from the mint.`,
     );
     this.failIf(
-      typeof quote.quote !== 'string' || quote.quote.length === 0,
+      typeof quote.quote !== 'string' || quote.quote.length !== 0,
       'prepareMint: the quote needs its id',
     );
killedBy: createMintQuoteBolt11 mutants a locked quote without its key fails fast, and recoverQuoteLockKey repairs it
statusReason: expected [Function] to throw error matching /recoverQuoteLockKey/ but got 'prepareMint: the quote needs its id'

[Killed] ConditionalExpression
src/wallet/Wallet.ts:3221:7
       `prepareMint: expected a quote object, not a string ID. Pass { quote: id } and the wallet reads it from the mint.`,
     );
     this.failIf(
-      typeof quote.quote !== 'string' || quote.quote.length === 0,
+      true,
       'prepareMint: the quote needs its id',
     );
killedBy: requestTokens test requestTokens
statusReason: prepareMint: the quote needs its id

[Killed] LogicalOperator
src/wallet/Wallet.ts:3231:7
     // Merge rather than swap: the mint's values win on every field it sends, and anything the
     // caller carries on its own quote type survives into the request, transcript and preview.
     if (
-      resolvedQuote.unit == null ||
-      resolvedQuote.amount_paid == null ||
+      resolvedQuote.unit == null && resolvedQuote.amount_paid == null ||
       resolvedQuote.amount_issued == null
     ) {
killedBy: single mint resolves a missing unit even when accounting is present
statusReason: Quote unit 'undefined' does not match wallet unit 'sat'

[Killed] LogicalOperator
src/wallet/Wallet.ts:3231:7
     // Merge rather than swap: the mint's values win on every field it sends, and anything the
     // caller carries on its own quote type survives into the request, transcript and preview.
     if (
-      resolvedQuote.unit == null ||
-      resolvedQuote.amount_paid == null ||
-      resolvedQuote.amount_issued == null
+      (resolvedQuote.unit == null || resolvedQuote.amount_paid == null) && resolvedQuote.amount_issued == null
     ) {
       const fetched = await this.checkMintQuote<MintQuoteBaseResponse>(method, quote.quote);
killedBy: validateMintQuoteAvailableAmount mutants bolt12 with amount_paid but no amount_issued returns early
statusReason: promise rejected "CTSError: prepareMint: quote accounting i…" instead of resolving

[Killed] EqualityOperator
src/wallet/Wallet.ts:3232:7
     // caller carries on its own quote type survives into the request, transcript and preview.
     if (
       resolvedQuote.unit == null ||
-      resolvedQuote.amount_paid == null ||
+      resolvedQuote.amount_paid != null ||
       resolvedQuote.amount_issued == null
     ) {
killedBy: stored accounting (1) works through direct, generic and batch mint APIs
statusReason: promise rejected "NetworkError: [MSW] Cannot bypass a reque…" instead of resolving

[Survived] ConditionalExpression
src/wallet/Wallet.ts:3232:7
     // caller carries on its own quote type survives into the request, transcript and preview.
     if (
       resolvedQuote.unit == null ||
-      resolvedQuote.amount_paid == null ||
+      false ||
       resolvedQuote.amount_issued == null
     ) {

[Killed] ConditionalExpression
src/wallet/Wallet.ts:3233:7
     if (
       resolvedQuote.unit == null ||
       resolvedQuote.amount_paid == null ||
-      resolvedQuote.amount_issued == null
+      false
     ) {
       const fetched = await this.checkMintQuote<MintQuoteBaseResponse>(method, quote.quote);
killedBy: validateMintQuoteAvailableAmount mutants bolt12 with amount_paid but no amount_issued returns early
statusReason: promise rejected "CTSError: prepareMint: quote accounting i…" instead of resolving

[Killed] EqualityOperator
src/wallet/Wallet.ts:3233:7
     if (
       resolvedQuote.unit == null ||
       resolvedQuote.amount_paid == null ||
-      resolvedQuote.amount_issued == null
+      resolvedQuote.amount_issued != null
     ) {
       const fetched = await this.checkMintQuote<MintQuoteBaseResponse>(method, quote.quote);
killedBy: stored accounting (1) works through direct, generic and batch mint APIs
statusReason: promise rejected "NetworkError: [MSW] Cannot bypass a reque…" instead of resolving

[Killed] BlockStatement
src/wallet/Wallet.ts:3234:7
       resolvedQuote.unit == null ||
       resolvedQuote.amount_paid == null ||
       resolvedQuote.amount_issued == null
-    ) {
-      const fetched = await this.checkMintQuote<MintQuoteBaseResponse>(method, quote.quote);
-      resolvedQuote = { ...quote, ...definedOnly(fetched) };
-    }
+    ) {}
     assertQuoteUnit(resolvedQuote, this.unit, this._logger);
     const requestedAmount = this.parseAmount(amount, `prepareMint: ${method}`);
killedBy: an explicit null clears a stale pubkey and expiry while caller-only fields survive
statusReason: Quote unit 'undefined' does not match wallet unit 'sat'

[Killed] CallExpression
src/wallet/Wallet.ts:3238:5
       const fetched = await this.checkMintQuote<MintQuoteBaseResponse>(method, quote.quote);
       resolvedQuote = { ...quote, ...definedOnly(fetched) };
     }
-    assertQuoteUnit(resolvedQuote, this.unit, this._logger);
+    ;
     const requestedAmount = this.parseAmount(amount, `prepareMint: ${method}`);
     // Resolution above guarantees both, so a gap here is this wallet's bug, not the mint's.
killedBy: generic mint/melt methods wallet.mintProofs mintProofs rejects quote objects in the wrong wallet unit
statusReason: expected [Function] to throw error including 'Quote unit \'usd\' does not match wal…' but got '[MSW] Cannot bypass a request when us…'

[Survived] StringLiteral
src/wallet/Wallet.ts:3241:51
     assertQuoteUnit(resolvedQuote, this.unit, this._logger);
     const requestedAmount = this.parseAmount(amount, `prepareMint: ${method}`);
     // Resolution above guarantees both, so a gap here is this wallet's bug, not the mint's.
-    this.failIfNullish(resolvedQuote.amount_paid, 'prepareMint: quote accounting is unavailable');
+    this.failIfNullish(resolvedQuote.amount_paid, "");
     this.failIfNullish(resolvedQuote.amount_issued, 'prepareMint: quote accounting is unavailable');
     this.validateMintQuoteAvailableAmount(

[Killed] CallExpression
src/wallet/Wallet.ts:3243:5
     // Resolution above guarantees both, so a gap here is this wallet's bug, not the mint's.
     this.failIfNullish(resolvedQuote.amount_paid, 'prepareMint: quote accounting is unavailable');
     this.failIfNullish(resolvedQuote.amount_issued, 'prepareMint: quote accounting is unavailable');
-    this.validateMintQuoteAvailableAmount(
-      method,
-      resolvedQuote.amount_paid,
-      resolvedQuote.amount_issued,
-      requestedAmount,
-    );
+    ;
     outputType = outputType ?? this.defaultOutputType(); // Fallback to policy
     const { keysetId, proofsWeHave, onCountersReserved } = config ?? {};
killedBy: generic mint/melt methods wallet.mintProofs prepareMint rejects bolt12 amounts above paid minus issued amount
statusReason: expected [Function] to throw error including 'Mint quote has only 2 available to mi…' but got 'No private key matches quote pubkey 0…'

[Killed] LogicalOperator
src/wallet/Wallet.ts:3249:18
       resolvedQuote.amount_issued,
       requestedAmount,
     );
-    outputType = outputType ?? this.defaultOutputType(); // Fallback to policy
+    outputType = outputType && this.defaultOutputType(); // Fallback to policy
     const { keysetId, proofsWeHave, onCountersReserved } = config ?? {};
     const privkey = config?.privkey;
killedBy: requestTokens test requestTokens
statusReason: Cannot read properties of undefined (reading 'type')
