[Killed] StringLiteral
src/wallet/Wallet.ts:3823:33
     offer: string,
     amountMsat?: AmountLike,
   ): Promise<MeltQuoteBolt12Response> {
-    this.requireSupport('melt', 'bolt12');
+    this.requireSupport('melt', "");
     const normalizedAmountMsat =
       amountMsat !== undefined ? this.parseAmount(amountMsat, 'createMeltQuoteBolt12') : undefined;
killedBy: createMeltQuoteBolt12 mutants omits options when no amountMsat is supplied
statusReason: Mint does not support  melt for unit 'sat'

[Killed] EqualityOperator
src/wallet/Wallet.ts:3825:7
   ): Promise<MeltQuoteBolt12Response> {
     this.requireSupport('melt', 'bolt12');
     const normalizedAmountMsat =
-      amountMsat !== undefined ? this.parseAmount(amountMsat, 'createMeltQuoteBolt12') : undefined;
+      amountMsat === undefined ? this.parseAmount(amountMsat, 'createMeltQuoteBolt12') : undefined;
     const meltQuote = await this.mint.createMeltQuoteBolt12({
       unit: this._unit,
killedBy: createMeltQuoteBolt12 mutants omits options when no amountMsat is supplied
statusReason: Unsupported amount input type

[Killed] ObjectLiteral
src/wallet/Wallet.ts:3826:61
     this.requireSupport('melt', 'bolt12');
     const normalizedAmountMsat =
       amountMsat !== undefined ? this.parseAmount(amountMsat, 'createMeltQuoteBolt12') : undefined;
-    const meltQuote = await this.mint.createMeltQuoteBolt12({
-      unit: this._unit,
-      request: offer,
-      options: normalizedAmountMsat
-        ? {
-            amountless: {
-              amount_msat: normalizedAmountMsat,
-            },
-          }
-        : undefined,
-    });
+    const meltQuote = await this.mint.createMeltQuoteBolt12({});
     assertQuoteUnit(meltQuote, this.unit, this._logger);
     // The offer itself is opaque here, so only an explicit caller amount bounds the quote.
killedBy: Wallet (BOLT12) – wrappers wallet.createMeltQuoteBolt12(offer, amountMsat?) delegates to mint
statusReason: expected {} to deeply equal { unit: 'sat', …(2) }

[Killed] CallExpression
src/wallet/Wallet.ts:3837:5
           }
         : undefined,
     });
-    assertQuoteUnit(meltQuote, this.unit, this._logger);
+    ;
     // The offer itself is opaque here, so only an explicit caller amount bounds the quote.
     this.assertBolt11MeltQuoteAmount(meltQuote, normalizedAmountMsat ?? null);
killedBy: createMeltQuoteBolt12 mutants rejects a quote denominated in a different unit
statusReason: promise resolved "{ quote: 'melt-bolt12-amount', …(8) }" instead of rejecting

[Killed] LogicalOperator
src/wallet/Wallet.ts:3839:49
     });
     assertQuoteUnit(meltQuote, this.unit, this._logger);
     // The offer itself is opaque here, so only an explicit caller amount bounds the quote.
-    this.assertBolt11MeltQuoteAmount(meltQuote, normalizedAmountMsat ?? null);
+    this.assertBolt11MeltQuoteAmount(meltQuote, normalizedAmountMsat && null);
     return meltQuote;
   }
killedBy: createMeltQuoteBolt12 mutants omits options when no amountMsat is supplied
statusReason: Unsupported amount input type

[Killed] BlockStatement
src/wallet/Wallet.ts:3854:40
   async createMeltQuoteOnchain(
     address: string,
     amount: AmountLike,
-  ): Promise<MeltQuoteOnchainResponse> {
-    this.requireSupport('melt', 'onchain');
-    const normalizedAmount = this.parseAmount(amount, 'createMeltQuoteOnchain');
-    const quote = await this.mint.createMeltQuoteOnchain({
-      unit: this._unit,
-      request: address,
-      amount: normalizedAmount,
-    });
-    assertQuoteUnit(quote, this.unit, this._logger);
-    // Onchain amounts are already in the wallet unit, so the quote must match exactly.
-    this.failIf(!quote.amount.equals(normalizedAmount), 'Melt quote amount does not match', {
-      expected: normalizedAmount.toString(),
-      quoted: quote.amount.toString(),
-    });
-    return quote;
-  }
+  ): Promise<MeltQuoteOnchainResponse> {}
 
   /**
killedBy: generic mint/melt methods wallet.createMintQuote / checkMintQuote createMeltQuoteOnchain throws when mint does not advertise onchain support
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
src/wallet/Wallet.ts:3855:33
     address: string,
     amount: AmountLike,
   ): Promise<MeltQuoteOnchainResponse> {
-    this.requireSupport('melt', 'onchain');
+    this.requireSupport('melt', "");
     const normalizedAmount = this.parseAmount(amount, 'createMeltQuoteOnchain');
     const quote = await this.mint.createMeltQuoteOnchain({
killedBy: createMeltQuoteOnchain mutants keeps the unit the mint quoted
statusReason: Mint does not support  melt for unit 'sat'

[Killed] CallExpression
src/wallet/Wallet.ts:3862:5
       request: address,
       amount: normalizedAmount,
     });
-    assertQuoteUnit(quote, this.unit, this._logger);
+    ;
     // Onchain amounts are already in the wallet unit, so the quote must match exactly.
     this.failIf(!quote.amount.equals(normalizedAmount), 'Melt quote amount does not match', {
killedBy: createMeltQuoteOnchain mutants rejects a quote denominated in a different unit
statusReason: promise resolved "{ quote: 'onchain-melt-amount', …(9) }" instead of rejecting

[Killed] BooleanLiteral
src/wallet/Wallet.ts:3864:17
     });
     assertQuoteUnit(quote, this.unit, this._logger);
     // Onchain amounts are already in the wallet unit, so the quote must match exactly.
-    this.failIf(!quote.amount.equals(normalizedAmount), 'Melt quote amount does not match', {
+    this.failIf(quote.amount.equals(normalizedAmount), 'Melt quote amount does not match', {
       expected: normalizedAmount.toString(),
       quoted: quote.amount.toString(),
killedBy: createMeltQuoteOnchain mutants keeps the unit the mint quoted
statusReason: Melt quote amount does not match

[Killed] BlockStatement
src/wallet/Wallet.ts:3885:39
   async createMultiPathMeltQuote(
     invoice: string,
     millisatPartialAmount: AmountLike,
-  ): Promise<MeltQuoteBolt11Response> {
-    const normalizedMillisatPartialAmount = this.parseAmount(
-      millisatPartialAmount,
-      'createMultiPathMeltQuote',
-    );
-    const { supported, params } = this.getMintInfo().isSupported(15);
-    this.failIf(!supported, 'Mint does not support NUT-15');
-    this.failIf(
-      !params?.some((p) => p.method === 'bolt11' && p.unit === this._unit),
-      `Mint does not support MPP for bolt11 and ${this._unit}`,
-    );
-    const meltQuotePayload: MeltQuoteBolt11Request = {
-      unit: this._unit,
-      request: invoice,
-      options: { mpp: { amount: normalizedMillisatPartialAmount } },
-    };
-    const meltQuote = await this.mint.createMeltQuoteBolt11(meltQuotePayload);
-    assertQuoteUnit(meltQuote, this.unit, this._logger);
-    // A partial quote is bounded by the caller's own millisat share, not the invoice total.
-    this.assertBolt11MeltQuoteAmount(meltQuote, normalizedMillisatPartialAmount);
-    return meltQuote;
-  }
+  ): Promise<MeltQuoteBolt11Response> {}
 
   // -----------------------------------------------------------------
killedBy: bolt11 melt quote amount validation createMultiPathMeltQuote rejects a quote charging more than the partial amount
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
src/wallet/Wallet.ts:3891:29
       'createMultiPathMeltQuote',
     );
     const { supported, params } = this.getMintInfo().isSupported(15);
-    this.failIf(!supported, 'Mint does not support NUT-15');
+    this.failIf(!supported, "");
     this.failIf(
       !params?.some((p) => p.method === 'bolt11' && p.unit === this._unit),
killedBy: createMultiPathMeltQuote mutants throws when the mint does not advertise NUT-15
statusReason: expected [Function] to throw error including 'Mint does not support NUT-15' but got ''

[Killed] EqualityOperator
src/wallet/Wallet.ts:3893:28
     const { supported, params } = this.getMintInfo().isSupported(15);
     this.failIf(!supported, 'Mint does not support NUT-15');
     this.failIf(
-      !params?.some((p) => p.method === 'bolt11' && p.unit === this._unit),
+      !params?.some((p) => p.method !== 'bolt11' && p.unit === this._unit),
       `Mint does not support MPP for bolt11 and ${this._unit}`,
     );
killedBy: createMultiPathMeltQuote mutants accepts when the wallet unit is among several NUT-15 methods
statusReason: Mint does not support MPP for bolt11 and sat

[Killed] BlockStatement
src/wallet/Wallet.ts:3945:39
    */
   async checkMeltQuoteBolt11(
     quote: string | MeltQuoteBolt11Response,
-  ): Promise<MeltQuoteBolt11Response> {
-    const quoteId = typeof quote === 'string' ? quote : quote.quote;
-    const res = await this.mint.checkMeltQuoteBolt11(quoteId);
-    // No caller-side expectation here, so check the quote against its own invoice.
-    if (this._unit === 'sat' || this._unit === 'msat') {
-      let expectedMsat: bigint | null = null;
-      try {
-        expectedMsat = bolt11AmountMsat(res.request);
-      } catch {
-        this.fail('Melt quote request is not a valid bolt11 invoice', { quote: res.quote });
-      }
-      this.assertBolt11MeltQuoteAmount(res, expectedMsat);
-    }
-    return res;
-  }
+  ): Promise<MeltQuoteBolt11Response> {}
 
   /**
killedBy: bolt11 melt quote amount validation checkMeltQuoteBolt11 rejects when the quote charges more than its invoice
statusReason: promise resolved "undefined" instead of rejecting

[Killed] EqualityOperator
src/wallet/Wallet.ts:3946:21
   async checkMeltQuoteBolt11(
     quote: string | MeltQuoteBolt11Response,
   ): Promise<MeltQuoteBolt11Response> {
-    const quoteId = typeof quote === 'string' ? quote : quote.quote;
+    const quoteId = typeof quote !== 'string' ? quote : quote.quote;
     const res = await this.mint.checkMeltQuoteBolt11(quoteId);
     // No caller-side expectation here, so check the quote against its own invoice.
killedBy: bolt11 melt quote amount validation checkMeltQuoteBolt11 rejects when the quote charges more than its invoice
statusReason: expected [Function] to throw error matching /exceeds the requested amount/i but got '[MSW] Cannot bypass a request when us…'

[Killed] LogicalOperator
src/wallet/Wallet.ts:3949:9
     const quoteId = typeof quote === 'string' ? quote : quote.quote;
     const res = await this.mint.checkMeltQuoteBolt11(quoteId);
     // No caller-side expectation here, so check the quote against its own invoice.
-    if (this._unit === 'sat' || this._unit === 'msat') {
+    if (this._unit === 'sat' && this._unit === 'msat') {
       let expectedMsat: bigint | null = null;
       try {
killedBy: bolt11 melt quote amount validation checkMeltQuoteBolt11 rejects when the quote charges more than its invoice
statusReason: promise resolved "{ quote: 'melt-check-over', …(8) }" instead of rejecting

[Killed] ConditionalExpression
src/wallet/Wallet.ts:3949:33
     const quoteId = typeof quote === 'string' ? quote : quote.quote;
     const res = await this.mint.checkMeltQuoteBolt11(quoteId);
     // No caller-side expectation here, so check the quote against its own invoice.
-    if (this._unit === 'sat' || this._unit === 'msat') {
+    if (this._unit === 'sat' || false) {
       let expectedMsat: bigint | null = null;
       try {
killedBy: bolt11-check msat quotes accept the exact principal and reject one msat more
statusReason: promise resolved "{ quote: 'stored', …(10) }" instead of rejecting

[Killed] StringLiteral
src/wallet/Wallet.ts:4035:33
     config?: MeltProofsConfig,
     outputType?: OutputType,
   ): Promise<MeltProofsResponse<MeltQuoteBolt11Response>> {
-    this.requireSupport('melt', 'bolt11');
+    this.requireSupport('melt', "");
     const meltTxn = await this.prepareMelt('bolt11', meltQuote, proofsToSend, config, outputType);
     return this.completeMelt<MeltQuoteBolt11Response>(
killedBy: melt proofs test melt proofs base case
statusReason: Mint does not support  melt for unit 'sat'

[Survived] StringLiteral
src/wallet/Wallet.ts:4035:25
     config?: MeltProofsConfig,
     outputType?: OutputType,
   ): Promise<MeltProofsResponse<MeltQuoteBolt11Response>> {
-    this.requireSupport('melt', 'bolt11');
+    this.requireSupport("", 'bolt11');
     const meltTxn = await this.prepareMelt('bolt11', meltQuote, proofsToSend, config, outputType);
     return this.completeMelt<MeltQuoteBolt11Response>(

[Survived] StringLiteral
src/wallet/Wallet.ts:4095:25
     feeIndex: number,
     config?: MeltProofsConfig,
   ): Promise<MeltProofsResponse<MeltQuoteOnchainResponse>> {
-    this.requireSupport('melt', 'onchain');
+    this.requireSupport("", 'onchain');
     assertQuoteUnit(meltQuote, this.unit, this._logger);
     // Validate fee_option selection

[Survived] CallExpression
src/wallet/Wallet.ts:4096:5
     config?: MeltProofsConfig,
   ): Promise<MeltProofsResponse<MeltQuoteOnchainResponse>> {
     this.requireSupport('melt', 'onchain');
-    assertQuoteUnit(meltQuote, this.unit, this._logger);
+    ;
     // Validate fee_option selection
     const feeOption = meltQuote.fee_options.find((o) => o.fee_index === feeIndex);

[Killed] StringLiteral
src/wallet/Wallet.ts:4117:53
     const inputFee = this.getFeesForProofs(normalizedProofs);
     const sendAmount = sumProofs(normalizedProofs);
     const totalRequired = meltQuote.amount.add(feeOption.fee_reserve).add(inputFee);
-    this.failIf(sendAmount.lessThan(totalRequired), 'Not enough proofs to cover amount + fee', {
+    this.failIf(sendAmount.lessThan(totalRequired), "", {
       sendAmount: sendAmount.toString(),
       totalRequired: totalRequired.toString(),
killedBy: generic mint/melt methods wallet.meltProofs meltProofsOnchain rejects proofs below amount, selected fee, and input fee
statusReason: expected [Function] to throw error including 'Not enough proofs to cover amount + f…' but got ''

[Killed] LogicalOperator
src/wallet/Wallet.ts:4128:11
     const meltTxn = await this.prepareMelt('onchain', meltQuote, normalizedProofs, config);
     const response = await this.completeMelt<MeltQuoteOnchainResponse>(meltTxn, config?.privkey, {
       extraPayload: { fee_index: feeIndex },
-      ...(config?.scriptPath?.length && { scriptPath: config.scriptPath }),
+      ...(config?.scriptPath?.length || {
+  scriptPath: config.scriptPath
+}),
     });
     return response;
killedBy: generic mint/melt methods wallet.meltProofs meltProofsOnchain sends selected fee_index with NUT-08 outputs
statusReason: Cannot read properties of undefined (reading 'scriptPath')

[Killed] EqualityOperator
src/wallet/Wallet.ts:4161:46
     outputType?: OutputType,
   ): Promise<MeltPreview<TQuote>> {
     this.failIf(
-      typeof meltQuote.quote !== 'string' || meltQuote.quote.length === 0,
+      typeof meltQuote.quote !== 'string' || meltQuote.quote.length !== 0,
       'prepareMelt: the quote needs its id',
     );
killedBy: melt proofs test melt proofs base case
statusReason: prepareMelt: the quote needs its id

[Killed] ConditionalExpression
src/wallet/Wallet.ts:4161:7
     outputType?: OutputType,
   ): Promise<MeltPreview<TQuote>> {
     this.failIf(
-      typeof meltQuote.quote !== 'string' || meltQuote.quote.length === 0,
+      true,
       'prepareMelt: the quote needs its id',
     );
killedBy: generic mint/melt methods wallet.meltProofs meltProofs with custom method hits /v1/melt/{method}
statusReason: prepareMelt: the quote needs its id

[Killed] ConditionalExpression
src/wallet/Wallet.ts:4166:9
     );
     let resolvedQuote: TQuote & Partial<MeltQuoteBaseResponse> = meltQuote;
     // As in prepareMint, fetch any missing fields required on a mint response (NUT-05).
-    if (resolvedQuote.unit == null || resolvedQuote.state == null) {
+    if (false) {
       const fetched = await this.checkMeltQuote<MeltQuoteBaseResponse>(method, meltQuote.quote);
       resolvedQuote = { ...meltQuote, ...definedOnly(fetched) };
killedBy: createMintQuoteBolt11 mutants prepareMelt looks up an id-only quote and rejects a foreign unit
statusReason: expected [Function] to throw error including 'Quote unit \'usd\' does not match wal…' but got 'Quote unit \'undefined\' does not mat…'

[Killed] ConditionalExpression
src/wallet/Wallet.ts:4166:9
     );
     let resolvedQuote: TQuote & Partial<MeltQuoteBaseResponse> = meltQuote;
     // As in prepareMint, fetch any missing fields required on a mint response (NUT-05).
-    if (resolvedQuote.unit == null || resolvedQuote.state == null) {
+    if (false || resolvedQuote.state == null) {
       const fetched = await this.checkMeltQuote<MeltQuoteBaseResponse>(method, meltQuote.quote);
       resolvedQuote = { ...meltQuote, ...definedOnly(fetched) };
killedBy: a melt resolves a missing unit even when state is present
statusReason: Quote unit 'undefined' does not match wallet unit 'sat'

[Killed] LogicalOperator
src/wallet/Wallet.ts:4171:18
       resolvedQuote = { ...meltQuote, ...definedOnly(fetched) };
     }
     assertQuoteUnit(resolvedQuote, this.unit, this._logger);
-    outputType = outputType ?? this.defaultOutputType(); // Fallback to policy
+    outputType = outputType && this.defaultOutputType(); // Fallback to policy
     const { keysetId, onCountersReserved, nut08Change = true, preimage } = config || {};
 
killedBy: melt proofs test melt proofs base case
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
src/wallet/Wallet.ts:4172:76
     }
     assertQuoteUnit(resolvedQuote, this.unit, this._logger);
     outputType = outputType ?? this.defaultOutputType(); // Fallback to policy
-    const { keysetId, onCountersReserved, nut08Change = true, preimage } = config || {};
+    const { keysetId, onCountersReserved, nut08Change = true, preimage } = true;
 
     // Rotation evidence check: repair the snapshot so the output binding is current.
killedBy: melt proofs melt with a preimage stamps the HTLC inputs
statusReason: "undefined" is not valid JSON

[Killed] BooleanLiteral
src/wallet/Wallet.ts:4184:40
         { implicit: true, fetchKeys: false },
       );
     } catch (e) {
-      if (this._strictCachedKeysets || !(e instanceof UnknownKeysetError)) {
+      if (this._strictCachedKeysets || e instanceof UnknownKeysetError) {
         throw e;
       }
killedBy: send and melt inputs across a rotation prepareMelt proceeds past a delisted input keyset with a warning
statusReason: Keyset '00bd033559de27d0' is not a keyset of this mint

[Killed] StringLiteral
src/wallet/Wallet.ts:4187:25
       if (this._strictCachedKeysets || !(e instanceof UnknownKeysetError)) {
         throw e;
       }
-      this._logger.warn('Melt input keyset is not listed by the mint; proceeding anyway', {
+      this._logger.warn("", {
         keyset: e.keysetId,
       });
killedBy: send and melt inputs across a rotation prepareMelt proceeds past a delisted input keyset with a warning
statusReason: expected "warn" to be called with arguments: [ …(2) ]

Received:

  1st warn call:

  [
-   "Melt input keyset is not listed by the mint; proceeding anyway",

[Killed] ArrayDeclaration
src/wallet/Wallet.ts:4198:40
     let keyset = this.getKeyset(keysetId); // specified or wallet keyset
     const normalizedProofs = normalizeProofAmounts(proofsToSend);
     const sendAmount = sumProofs(normalizedProofs);
-    let outputData: OutputDataLike[] = [];
+    let outputData: OutputDataLike[] = ["Stryker was here"];
 
     // feeReserve is the overage above the invoice/offer amount.
killedBy: melt proofs test melt proofs no change
statusReason: bytesToHex: expected bytes to be a Uint8Array

[Killed] ConditionalExpression
src/wallet/Wallet.ts:4215:9
     const feeReserve = sendAmount.subtract(resolvedQuote.amount);
 
     // Custom OT is definitive (no extra NUT-08 blanks)
-    if (outputType.type === 'custom') {
+    if (true) {
       outputData = outputType.data;
     }
killedBy: melt change across a rotation completeMelt reconstructs change on a keyset it holds keyless
statusReason: Cannot read properties of undefined (reading 'entries')

[Killed] LogicalOperator
src/wallet/Wallet.ts:4221:14
 
     // Create NUT-08 blanks for return of melt change (if supported)
     // Note: zero amount + zero denomination passes splitAmount validation
-    else if (nut08Change && feeReserve.greaterThan(0)) {
+    else if (nut08Change || feeReserve.greaterThan(0)) {
       // Now we actually create outputs the mint must sign: enforce the output policy.
       this.failIf(
killedBy: melt proofs prepareMelt can skip automatic NUT-08 change outputs
statusReason: expected [ OutputData{ …(6) }, …(1) ] to have a length of +0 but got 2

[Survived] ObjectLiteral
src/wallet/Wallet.ts:4244:66
       const autoCounters = await this.addCountersToOutputTypes(keyset.id, meltOT);
       [meltOT] = autoCounters.outputTypes;
       if (autoCounters.used) {
-        this.safeCallback(onCountersReserved, autoCounters.used, { op: 'meltProofs' });
+        this.safeCallback(onCountersReserved, autoCounters.used, {});
       }
       this._logger.debug('melt counter', {

[Survived] ObjectLiteral
src/wallet/Wallet.ts:4246:42
       if (autoCounters.used) {
         this.safeCallback(onCountersReserved, autoCounters.used, { op: 'meltProofs' });
       }
-      this._logger.debug('melt counter', {
-        counter: autoCounters.used,
-        meltOT: stringifyOutputTypeForLog(meltOT),
-      });
+      this._logger.debug('melt counter', {});
       // Generate the blank outputs (no fees as we are receiving change)
       // Remember, zero amount + zero denomination passes splitAmount validation

[Killed] ConditionalExpression
src/wallet/Wallet.ts:4306:9
 
     // Construct melt payload. Extension fields must not clobber the prepared request.
     const extra = completeOptions.extraPayload;
-    if (extra) {
+    if (false) {
       // Object.keys mirrors what the spread below copies (own enumerable keys).
       const owned = ['quote', 'inputs', 'outputs', 'prefer_async'];
killedBy: async melt preference body completeMelt rejects extraPayload keys that collide with the prepared request
statusReason: expected [Function] to throw error matching /reserved melt fields/ but got '[MSW] Cannot bypass a request when us…'

[Killed] ConditionalExpression
src/wallet/Wallet.ts:4310:19
       // Object.keys mirrors what the spread below copies (own enumerable keys).
       const owned = ['quote', 'inputs', 'outputs', 'prefer_async'];
       const reserved = Object.keys(extra).filter((k) => owned.includes(k));
-      this.failIf(reserved.length > 0, 'extraPayload cannot override reserved melt fields', {
+      this.failIf(false, 'extraPayload cannot override reserved melt fields', {
         reserved,
       });
killedBy: async melt preference body completeMelt rejects extraPayload keys that collide with the prepared request
statusReason: expected [Function] to throw error matching /reserved melt fields/ but got '[MSW] Cannot bypass a request when us…'

[Killed] ObjectLiteral
src/wallet/Wallet.ts:4318:41
       quote,
       inputs,
       outputs,
-      ...(completeOptions.preferAsync ? { prefer_async: true } : {}),
+      ...(completeOptions.preferAsync ? {} : {}),
       ...extra,
     };
killedBy: async melt preference body completeMelt sends prefer_async when { preferAsync: true } is passed
statusReason: HTTP request failed

[Killed] ConditionalExpression
src/wallet/Wallet.ts:4328:7
     const quoteAmount =
       'amount' in meltPreview.quote ? (meltPreview.quote.amount as AmountLike) : undefined;
     this.failIf(
-      quoteAmount === undefined &&
-        inputs.some((p) => isBlsKeyset(p.id) && isV3PointSecret(p.secret)),
+      true,
       'melting v3 inputs needs the melt quote amount; pass the full quote object',
     );
killedBy: melt proofs test melt proofs base case
statusReason: melting v3 inputs needs the melt quote amount; pass the full quote object

[Survived] BlockStatement
src/wallet/Wallet.ts:4333:36
       'melting v3 inputs needs the melt quote amount; pass the full quote object',
     );
     let receipts: SpendReceipt[] = [];
-    if (quoteAmount !== undefined) {
-      const feeIndex = typeof extra?.fee_index === 'number' ? extra.fee_index : undefined;
-      receipts = await attachTransactionWitnesses(
-        meltPayload,
-        {
-          quoteId: quote,
-          amount: meltOutputAmount({ ...meltPreview.quote, amount: quoteAmount }, feeIndex),
-        },
-        collectSpendInfoKeys(meltPreview.inputs, privkey, this._logger),
-        completeOptions.scriptPath?.length
-          ? prepareScriptPathSpends(
-              meltPreview.inputs,
-              completeOptions.scriptPath,
-              privkey === undefined ? [] : [privkey].flat(),
-            )
-          : undefined,
-        this._nutrootState(),
-      );
-    }
+    if (quoteAmount !== undefined) {}
 
     // Execute melt and validate result

[Killed] EqualityOperator
src/wallet/Wallet.ts:4334:24
     );
     let receipts: SpendReceipt[] = [];
     if (quoteAmount !== undefined) {
-      const feeIndex = typeof extra?.fee_index === 'number' ? extra.fee_index : undefined;
+      const feeIndex = typeof extra?.fee_index !== 'number' ? extra.fee_index : undefined;
       receipts = await attachTransactionWitnesses(
         meltPayload,
killedBy: melt proofs test melt proofs base case
statusReason: Cannot read properties of undefined (reading 'fee_index')

[Killed] OptionalChaining
src/wallet/Wallet.ts:4334:31
     );
     let receipts: SpendReceipt[] = [];
     if (quoteAmount !== undefined) {
-      const feeIndex = typeof extra?.fee_index === 'number' ? extra.fee_index : undefined;
+      const feeIndex = typeof extra.fee_index === 'number' ? extra.fee_index : undefined;
       receipts = await attachTransactionWitnesses(
         meltPayload,
killedBy: melt proofs test melt proofs base case
statusReason: Cannot read properties of undefined (reading 'fee_index')

[Killed] ObjectLiteral
src/wallet/Wallet.ts:4339:36
         meltPayload,
         {
           quoteId: quote,
-          amount: meltOutputAmount({ ...meltPreview.quote, amount: quoteAmount }, feeIndex),
+          amount: meltOutputAmount({}, feeIndex),
         },
         collectSpendInfoKeys(meltPreview.inputs, privkey, this._logger),
killedBy: generic mint/melt methods wallet.meltProofs meltProofs with custom method hits /v1/melt/{method}
statusReason: Unsupported amount input type

[NoCoverage] ConditionalExpression
src/wallet/Wallet.ts:4346:15
           ? prepareScriptPathSpends(
               meltPreview.inputs,
               completeOptions.scriptPath,
-              privkey === undefined ? [] : [privkey].flat(),
+              true ? [] : [privkey].flat(),
             )
           : undefined,

[Killed] ArrayDeclaration
src/wallet/Wallet.ts:4364:47
     // Create any change Proofs. The spec is silent on which keyset settles change after a
     // rotation, so take the keyset each signature names. The inputs are spent by now, so a
     // failure here must hand back what recovery needs.
-    const changeSigs = meltResponse.change ?? [];
+    const changeSigs = meltResponse.change ?? ["Stryker was here"];
     let change: Proof[];
     try {
killedBy: generic mint/melt methods wallet.meltProofs meltProofsOnchain signs SIG_ALL proofs with outputs and quote id
statusReason: Melt completed but its change could not be reconstructed; see cause: a keyset that will load rebuilds via createMeltChangeProofs(), anything else needs a NUT-09 restore

[Killed] EqualityOperator
src/wallet/Wallet.ts:4367:11
     const changeSigs = meltResponse.change ?? [];
     let change: Proof[];
     try {
-      if (changeSigs.length > 0) {
+      if (changeSigs.length <= 0) {
         await this._ensureOperableKeysets(
           changeSigs.filter((s) => !s.amount.isZero()).map((s) => s.id),
killedBy: melt change across a rotation completeMelt reconstructs change on a keyset it holds keyless
statusReason: Melt completed but its change could not be reconstructed; see cause: a keyset that will load rebuilds via createMeltChangeProofs(), anything else needs a NUT-09 restore

[Killed] ObjectLiteral
src/wallet/Wallet.ts:4375:70
       }
       change = this.createMeltChangeProofs(meltPreview.outputData, changeSigs);
     } catch (e) {
-      throw new MeltChangeError(meltPreview.outputData, mergedQuote, { cause: e });
+      throw new MeltChangeError(meltPreview.outputData, mergedQuote, {});
     }
 
killedBy: melt change across a rotation unreachable change keys reject with the data recovery needs
statusReason: expected undefined to be defined

[Killed] ObjectLiteral
src/wallet/Wallet.ts:4380:50
 
     const changeAmounts = change.map((p) => p.amount.toString());
     if (completeOptions.preferAsync) {
-      this._logger.debug('ASYNC MELT REQUESTED', { state: meltResponse.state, changeAmounts });
+      this._logger.debug('ASYNC MELT REQUESTED', {});
     } else {
       this._logger.debug('MELT COMPLETED', { changeAmounts });
killedBy: async melt preference body completeMelt sends prefer_async when { preferAsync: true } is passed
statusReason: expected "vi.fn()" to be called with arguments: [ 'ASYNC MELT REQUESTED', …(1) ]

Received:

  1st vi.fn() call:

  [
-   "ASYNC MELT REQUESTED",

[Survived] StringLiteral
src/wallet/Wallet.ts:4382:26
     if (completeOptions.preferAsync) {
       this._logger.debug('ASYNC MELT REQUESTED', { state: meltResponse.state, changeAmounts });
     } else {
-      this._logger.debug('MELT COMPLETED', { changeAmounts });
+      this._logger.debug("", { changeAmounts });
     }
 

[Survived] ObjectLiteral
src/wallet/Wallet.ts:4382:44
     if (completeOptions.preferAsync) {
       this._logger.debug('ASYNC MELT REQUESTED', { state: meltResponse.state, changeAmounts });
     } else {
-      this._logger.debug('MELT COMPLETED', { changeAmounts });
+      this._logger.debug('MELT COMPLETED', {});
     }
 
