[Killed] ConditionalExpression
src/wallet/nutroot.ts:309:9
     }
     // The control block's internal key, from whichever source the spend info offers (NUT-10).
     const K = internalKeyOf(proof, privkeys);
-    if (!K) {
+    if (true) {
       throw new CTSError('Script path spend needs the internal key, which the spend info lacks');
     }
killedBy: prepareScriptPathSpends resolves a plan: internal key from the bearer scalar, keys deduped lowercase
statusReason: Script path spend needs the internal key, which the spend info lacks

[Killed] BlockStatement
src/wallet/nutroot.ts:309:13
     }
     // The control block's internal key, from whichever source the spend info offers (NUT-10).
     const K = internalKeyOf(proof, privkeys);
-    if (!K) {
-      throw new CTSError('Script path spend needs the internal key, which the spend info lacks');
-    }
+    if (!K) {}
     const recovered = recoverLeafKeySecretKeys(tree, proof.spend_info?.E, privkeys)
       .filter((h) => h.leafIndex === plan.leafIndex)
killedBy: prepareScriptPathSpends rejects unresolvable plans before any request is built
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/wallet/nutroot.ts:313:22
       throw new CTSError('Script path spend needs the internal key, which the spend info lacks');
     }
     const recovered = recoverLeafKeySecretKeys(tree, proof.spend_info?.E, privkeys)
-      .filter((h) => h.leafIndex === plan.leafIndex)
+      .filter((h) => false)
       .map((h) => h.secretKey);
     const keys = [
killedBy: prepareScriptPathSpends recovers a verbatim leaf key from the privkeys held, no extraKeys needed
statusReason: Script path leaf needs 1 signatures, 0 keys available

[Killed] BooleanLiteral
src/wallet/nutroot.ts:320:9
     ];
     // A co-signer contributes signatures, not keys, so its share cannot be counted until the
     // digest exists. Everything else about the plan is checkable now.
-    if (!plan.cosign && keys.length < leaf.n) {
+    if (plan.cosign && keys.length < leaf.n) {
       throw new CTSError(
         `Script path leaf needs ${leaf.n} signatures, ${keys.length} keys available`,
killedBy: prepareScriptPathSpends rejects unresolvable plans before any request is built
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/wallet/nutroot.ts:320:47
     ];
     // A co-signer contributes signatures, not keys, so its share cannot be counted until the
     // digest exists. Everything else about the plan is checkable now.
-    if (!plan.cosign && keys.length < leaf.n) {
-      throw new CTSError(
-        `Script path leaf needs ${leaf.n} signatures, ${keys.length} keys available`,
-      );
-    }
+    if (!plan.cosign && keys.length < leaf.n) {}
     out.set(plan.secret, {
       tree,
killedBy: prepareScriptPathSpends rejects unresolvable plans before any request is built
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/wallet/nutroot.ts:332:11
       ...(plan.preimage !== undefined && { preimage: plan.preimage }),
       keys,
       leaf,
-      ...(plan.cosign && { cosign: plan.cosign }),
+      ...(true),
     });
   }
killedBy: prepareScriptPathSpends a cosigner defers the key count to signing time
statusReason: expected undefined to be [AsyncFunction cosign] // Object.is equality

[Killed] LogicalOperator
src/wallet/nutroot.ts:390:9
     // recovers the receiver's static private key from it. The receive cascade rejects this, but
     // it only runs on receive, and melt reaches here directly. Refuse loudly wherever it appears:
     // this is a compromised key, not an input that merely cannot be signed.
-    if (E !== undefined && proof.spend_info?.k !== undefined) {
+    if (E !== undefined || proof.spend_info?.k !== undefined) {
       fail('Spend info carries both k and E', logger);
     }
killedBy: collectSpendInfoKeys bare bearer key: accepted when k*G is the secret, rejected otherwise
statusReason: Spend info carries both k and E

[Killed] EqualityOperator
src/wallet/nutroot.ts:390:28
     // recovers the receiver's static private key from it. The receive cascade rejects this, but
     // it only runs on receive, and melt reaches here directly. Refuse loudly wherever it appears:
     // this is a compromised key, not an input that merely cannot be signed.
-    if (E !== undefined && proof.spend_info?.k !== undefined) {
+    if (E !== undefined && proof.spend_info?.k === undefined) {
       fail('Spend info carries both k and E', logger);
     }
killedBy: wallet.spendOptions: the key path trial-matches a receiver-keyed proof against the keys supplied
statusReason: Spend info carries both k and E

[Killed] StringLiteral
src/wallet/nutroot.ts:391:12
     // it only runs on receive, and melt reaches here directly. Refuse loudly wherever it appears:
     // this is a compromised key, not an input that merely cannot be signed.
     if (E !== undefined && proof.spend_info?.k !== undefined) {
-      fail('Spend info carries both k and E', logger);
+      fail("", logger);
     }
     if (E && statics.length > 0) {
killedBy: collectSpendInfoKeys refuses spend info carrying both k and E
statusReason: expected [Function] to throw error matching /both k and E/ but got ''

[Killed] ConditionalExpression
src/wallet/nutroot.ts:396:13
     if (E && statics.length > 0) {
       for (const priv of statics) {
         const hit = recoverReceiverKeyedSecretKey(proof.secret, E, priv, proof.spend_info?.tree);
-        if (hit) {
+        if (false) {
           keys.set(proof.secret, hexToBytes(hit.secretKey));
           break;
killedBy: wallet.spendOptions: the key path trial-matches a receiver-keyed proof against the keys supplied
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/wallet/nutroot.ts:403:9
       }
     }
     const k = proof.spend_info?.k;
-    if (!k || !/^[0-9a-f]{64}$/.test(k)) continue;
+    if (true) continue;
     try {
       const kBytes = hexToBytes(k);
killedBy: wallet.spendOptions: the key path finds a bearer key, and reports none when the spend info is empty
statusReason: expected { keyPath: false, script: [], …(2) } to deeply equal { keyPath: true, script: [], …(1) }

[Killed] BlockStatement
src/wallet/nutroot.ts:406:70
     if (!k || !/^[0-9a-f]{64}$/.test(k)) continue;
     try {
       const kBytes = hexToBytes(k);
-      if (bytesToHex(getPubKeyFromPrivKey(kBytes)) === proof.secret) {
-        keys.set(proof.secret, kBytes);
-        continue;
-      }
+      if (bytesToHex(getPubKeyFromPrivKey(kBytes)) === proof.secret) {}
       // Locked proof: the key path signs with p' = k + t over the disclosed tree.
       const tree = proof.spend_info?.tree;
killedBy: collectSpendInfoKeys bare bearer key: accepted when k*G is the secret, rejected otherwise
statusReason: bytesToHex: expected bytes to be a Uint8Array

[Killed] ConditionalExpression
src/wallet/nutroot.ts:412:11
       }
       // Locked proof: the key path signs with p' = k + t over the disclosed tree.
       const tree = proof.spend_info?.tree;
-      if (tree && tree.length > 0) {
+      if (true) {
         const root = nutrootMerkleRoot(tree.map((leaf) => nutrootLeafHash(hexToBytes(leaf))));
         const tweaked = nutrootTweakSeckey(kBytes, root);
killedBy: collectSpendInfoKeys empty tweak: recovers p` = k + tagged_hash(K) when no tree is disclosed
statusReason: expected Uint8Array, got type=undefined

[Killed] ConditionalExpression
src/wallet/nutroot.ts:415:13
       if (tree && tree.length > 0) {
         const root = nutrootMerkleRoot(tree.map((leaf) => nutrootLeafHash(hexToBytes(leaf))));
         const tweaked = nutrootTweakSeckey(kBytes, root);
-        if (bytesToHex(getPubKeyFromPrivKey(tweaked)) === proof.secret) {
+        if (true) {
           keys.set(proof.secret, tweaked);
         }
killedBy: collectSpendInfoKeys malformed, out-of-curve and non-reconstructing bearer keys are skipped, not thrown
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/wallet/nutroot.ts:423:69
       // Empty tweak, no tree (NUT-10): p' = k + tagged_hash(tag, K). A true aggregate has no
       // single holder of `k`, so this reaches only a single-party key using the same form.
       const empty = nutrootTweakSeckey(kBytes);
-      if (bytesToHex(getPubKeyFromPrivKey(empty)) === proof.secret) {
-        keys.set(proof.secret, empty);
-      }
+      if (bytesToHex(getPubKeyFromPrivKey(empty)) === proof.secret) {}
     } catch {
       // invalid scalar: leave unsigned
killedBy: collectSpendInfoKeys empty tweak: recovers p` = k + tagged_hash(K) when no tree is disclosed
statusReason: expected Uint8Array, got type=undefined

[Killed] ObjectLiteral
src/wallet/nutroot.ts:447:10
   const privkey = seed
     ? deriveQuoteLockKey(seed, await reserveQuoteCounter())
     : createRandomSecretKey();
-  return { pubkey: bytesToHex(getPubKeyFromPrivKey(privkey)), privkey: bytesToHex(privkey) };
+  return {};
 }
 
killedBy: createMintQuoteBolt11 mutants rejects substitution of the requested quote lock
statusReason: expected [Function] to throw error including 'Mint quote is not locked to the reque…' but got 'A pubkey is required to lock the mint…'

[Killed] ConditionalExpression
src/wallet/nutroot.ts:468:25
   const seed = state.seed;
   const normalizedPubkey = normalizeSecpPubkey(pubkey);
   const bound = (await state.counters.peekNext(QUOTE_COUNTER_KEY)) + QUOTE_SCAN_HEADROOM;
-  for (let counter = 0; counter < bound; counter++) {
+  for (let counter = 0; false; counter++) {
     const privkey = deriveQuoteLockKey(seed, counter);
     if (bytesToHex(getPubKeyFromPrivKey(privkey)) === normalizedPubkey) {
killedBy: Wallet quote lock keys recoverQuoteLockKey scans the seed to the quote pubkey, and misses cleanly
statusReason: expected undefined to be 'e40782c6b87aa6941aeddc8af96114bb958ca…' // Object.is equality

[Killed] EqualityOperator
src/wallet/nutroot.ts:470:9
   const bound = (await state.counters.peekNext(QUOTE_COUNTER_KEY)) + QUOTE_SCAN_HEADROOM;
   for (let counter = 0; counter < bound; counter++) {
     const privkey = deriveQuoteLockKey(seed, counter);
-    if (bytesToHex(getPubKeyFromPrivKey(privkey)) === normalizedPubkey) {
+    if (bytesToHex(getPubKeyFromPrivKey(privkey)) !== normalizedPubkey) {
       return bytesToHex(privkey);
     }
killedBy: Wallet quote lock keys recoverQuoteLockKey scans the seed to the quote pubkey, and misses cleanly
statusReason: expected '771574a66d0d620b921d875a0dba45a989562…' to be 'e40782c6b87aa6941aeddc8af96114bb958ca…' // Object.is equality

[Killed] ConditionalExpression
src/wallet/nutroot.ts:492:7
 ): string {
   if (typeof res.pubkey !== 'string') fail('Mint returned unlocked mint quote', logger);
   const returned = res.pubkey;
-  if (returned.toLowerCase() !== requested) {
+  if (true) {
     fail('Mint quote is not locked to the requested pubkey', logger);
   }
killedBy: generic mint/melt methods wallet.createMintQuote / checkMintQuote createMintQuote accepts a locked quote the mint echoes correctly
statusReason: Mint quote is not locked to the requested pubkey

[Killed] EqualityOperator
src/wallet/nutroot.ts:492:7
 ): string {
   if (typeof res.pubkey !== 'string') fail('Mint returned unlocked mint quote', logger);
   const returned = res.pubkey;
-  if (returned.toLowerCase() !== requested) {
+  if (returned.toLowerCase() === requested) {
     fail('Mint quote is not locked to the requested pubkey', logger);
   }
killedBy: createMintQuoteBolt11 mutants rejects substitution of the requested quote lock
statusReason: promise resolved "{ quote: 'q-substituted', …(10) }" instead of rejecting
