[Killed] EqualityOperator
src/model/Amount.ts:68:11
     }
 
     if (typeof input === 'bigint') {
-      if (input < 0n) {
+      if (input >= 0n) {
         throw new AmountError(`Amount must be >= 0, got ${input}`);
       }
killedBy: wallet.maxSpendableAfterFees returns total minus feeReserve when input fees are zero
statusReason: Amount must be >= 0, got 0

[Killed] EqualityOperator
src/model/Amount.ts:79:11
       if (!Number.isFinite(input) || !Number.isInteger(input)) {
         throw new AmountError(`Invalid number amount: ${input}`);
       }
-      if (input < 0) {
+      if (input >= 0) {
         throw new AmountError(`Amount must be >= 0, got ${input}`);
       }
killedBy: requests request with body contains the correct headers
statusReason: Invalid keyset.input_fee_ppk: Amount must be >= 0, got 0

[Killed] LogicalOperator
src/model/Amount.ts:447:9
   readonly unit: string;
 
   constructor(amount: Amount, unit: string) {
-    if (typeof unit !== 'string' || unit.length === 0) {
+    if (typeof unit !== 'string' && unit.length === 0) {
       throw new AmountWithUnitError('unit required');
     }
killedBy: AmountWithUnitError metadata sets .name to "AmountWithUnitError"
statusReason: expected number of assertions to be 2, but got 0
