[Killed] BlockStatement
src/model/CashuNip07.ts:244:29
       signDigest(nostr, digest, transactionMessage, inputContainer, 'a mint quote');
   },
 
-  completes(option, pubkey) {
-    const x = xOnly(pubkey);
-    const leaf = option.leaf;
-    if (leaf.type === 'commit') return false;
-    const keyIndex = leaf.keys.findIndex((k) => xOnly(k) === x);
-    if (keyIndex < 0 || option.keys.some((k) => k.keyIndex === keyIndex)) return false;
-    return (
-      !option.satisfiable && option.blockedBy === 'threshold' && option.keys.length + 1 >= leaf.n
-    );
-  },
+  completes(option, pubkey) {},
 
   async nip60Keys(nostr, pubkey, content) {
killedBy: CashuNip07 completes: listed, not held, one short of n, and only then
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/model/CashuNip07.ts:247:40
   completes(option, pubkey) {
     const x = xOnly(pubkey);
     const leaf = option.leaf;
-    if (leaf.type === 'commit') return false;
+    if (leaf.type === 'commit') return true;
     const keyIndex = leaf.keys.findIndex((k) => xOnly(k) === x);
     if (keyIndex < 0 || option.keys.some((k) => k.keyIndex === keyIndex)) return false;
killedBy: CashuNip07 completes: listed, not held, one short of n, and only then
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/model/CashuNip07.ts:247:9
   completes(option, pubkey) {
     const x = xOnly(pubkey);
     const leaf = option.leaf;
-    if (leaf.type === 'commit') return false;
+    if (leaf.type !== 'commit') return false;
     const keyIndex = leaf.keys.findIndex((k) => xOnly(k) === x);
     if (keyIndex < 0 || option.keys.some((k) => k.keyIndex === keyIndex)) return false;
killedBy: CashuNip07 completes: listed, not held, one short of n, and only then
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/model/CashuNip07.ts:248:42
     const x = xOnly(pubkey);
     const leaf = option.leaf;
     if (leaf.type === 'commit') return false;
-    const keyIndex = leaf.keys.findIndex((k) => xOnly(k) === x);
+    const keyIndex = leaf.keys.findIndex(() => undefined);
     if (keyIndex < 0 || option.keys.some((k) => k.keyIndex === keyIndex)) return false;
     return (
killedBy: CashuNip07 completes: listed, not held, one short of n, and only then
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/model/CashuNip07.ts:248:49
     const x = xOnly(pubkey);
     const leaf = option.leaf;
     if (leaf.type === 'commit') return false;
-    const keyIndex = leaf.keys.findIndex((k) => xOnly(k) === x);
+    const keyIndex = leaf.keys.findIndex((k) => false);
     if (keyIndex < 0 || option.keys.some((k) => k.keyIndex === keyIndex)) return false;
     return (
killedBy: CashuNip07 completes: listed, not held, one short of n, and only then
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/model/CashuNip07.ts:249:82
     const leaf = option.leaf;
     if (leaf.type === 'commit') return false;
     const keyIndex = leaf.keys.findIndex((k) => xOnly(k) === x);
-    if (keyIndex < 0 || option.keys.some((k) => k.keyIndex === keyIndex)) return false;
+    if (keyIndex < 0 || option.keys.some((k) => k.keyIndex === keyIndex)) return true;
     return (
       !option.satisfiable && option.blockedBy === 'threshold' && option.keys.length + 1 >= leaf.n
killedBy: CashuNip07 completes: listed, not held, one short of n, and only then
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/model/CashuNip07.ts:249:25
     const leaf = option.leaf;
     if (leaf.type === 'commit') return false;
     const keyIndex = leaf.keys.findIndex((k) => xOnly(k) === x);
-    if (keyIndex < 0 || option.keys.some((k) => k.keyIndex === keyIndex)) return false;
+    if (keyIndex < 0 || option.keys.every(k => k.keyIndex === keyIndex)) return false;
     return (
       !option.satisfiable && option.blockedBy === 'threshold' && option.keys.length + 1 >= leaf.n
killedBy: CashuNip07 completes: listed, not held, one short of n, and only then
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/model/CashuNip07.ts:251:30
     const keyIndex = leaf.keys.findIndex((k) => xOnly(k) === x);
     if (keyIndex < 0 || option.keys.some((k) => k.keyIndex === keyIndex)) return false;
     return (
-      !option.satisfiable && option.blockedBy === 'threshold' && option.keys.length + 1 >= leaf.n
+      !option.satisfiable && true && option.keys.length + 1 >= leaf.n
     );
   },
killedBy: CashuNip07 completes: listed, not held, one short of n, and only then
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
src/model/CashuNip07.ts:251:7
     const keyIndex = leaf.keys.findIndex((k) => xOnly(k) === x);
     if (keyIndex < 0 || option.keys.some((k) => k.keyIndex === keyIndex)) return false;
     return (
-      !option.satisfiable && option.blockedBy === 'threshold' && option.keys.length + 1 >= leaf.n
+      !option.satisfiable && option.blockedBy === 'threshold' || option.keys.length + 1 >= leaf.n
     );
   },
killedBy: CashuNip07 completes: listed, not held, one short of n, and only then
statusReason: expected true to be false // Object.is equality
