[Killed] ConditionalExpression
src/wallet/KeyChain.ts:331:11
       // Rebuild from existing meta plus fetched keys
       const meta = existing.toMintKeyset();
       const rebuilt = Keyset.fromMintApi(meta, mk);
-      if (!rebuilt.verify()) {
+      if (true) {
         throw new CTSError(`Keyset verification failed for ID ${id}`);
       }
killedBy: KeyChain.ensureKeysetKeys fetches, verifies and stores keys for a meta-only keyset
statusReason: Keyset verification failed for ID 009a1f293253e41e

[Killed] ConditionalExpression
src/wallet/KeyChain.ts:331:11
       // Rebuild from existing meta plus fetched keys
       const meta = existing.toMintKeyset();
       const rebuilt = Keyset.fromMintApi(meta, mk);
-      if (!rebuilt.verify()) {
+      if (false) {
         throw new CTSError(`Keyset verification failed for ID ${id}`);
       }
killedBy: KeyChain.ensureKeysetKeys throws when fetched keys fail verification
statusReason: promise resolved "Keyset{ _keys: { …(64) }, …(5) }" instead of rejecting

[Killed] StringLiteral
src/wallet/KeyChain.ts:332:28
       const meta = existing.toMintKeyset();
       const rebuilt = Keyset.fromMintApi(meta, mk);
       if (!rebuilt.verify()) {
-        throw new CTSError(`Keyset verification failed for ID ${id}`);
+        throw new CTSError(``);
       }
 
killedBy: KeyChain.ensureKeysetKeys throws when fetched keys fail verification
statusReason: expected [Function] to throw error including 'Keyset verification failed for ID 009…' but got ''

[Killed] ConditionalExpression
src/wallet/KeyChain.ts:337:11
 
       // A newer snapshot replaced ours while fetching, so its entry wins: the rebuilt one carries
       // the metadata captured before the refresh.
-      if (this.generation !== startedGeneration) {
+      if (false) {
         this._logger.debug('Keychain refreshed during key fetch; returning the live keyset', {
           id,
killedBy: KeyChain.ensureKeysetKeys does not reinstate a keyset that a refresh removed while its keys were in flight
statusReason: promise resolved "Keyset{ _keys: { …(64) }, …(5) }" instead of rejecting

[Killed] ConditionalExpression
src/wallet/KeyChain.ts:337:11
 
       // A newer snapshot replaced ours while fetching, so its entry wins: the rebuilt one carries
       // the metadata captured before the refresh.
-      if (this.generation !== startedGeneration) {
+      if (true) {
         this._logger.debug('Keychain refreshed during key fetch; returning the live keyset', {
           id,
killedBy: KeyChain.ensureKeysetKeys fetches, verifies and stores keys for a meta-only keyset
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/wallet/KeyChain.ts:338:28
       // A newer snapshot replaced ours while fetching, so its entry wins: the rebuilt one carries
       // the metadata captured before the refresh.
       if (this.generation !== startedGeneration) {
-        this._logger.debug('Keychain refreshed during key fetch; returning the live keyset', {
+        this._logger.debug("", {
           id,
         });

[Killed] BooleanLiteral
src/wallet/KeyChain.ts:342:13
           id,
         });
         const current = this.keysets[id];
-        if (!current) {
+        if (current) {
           throw new CTSError(`Keyset '${id}' not found`);
         }
killedBy: KeyChain.ensureKeysetKeys does not reinstate a keyset that a refresh removed while its keys were in flight
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/wallet/KeyChain.ts:342:23
           id,
         });
         const current = this.keysets[id];
-        if (!current) {
-          throw new CTSError(`Keyset '${id}' not found`);
-        }
+        if (!current) {}
         return current;
       }
killedBy: KeyChain.ensureKeysetKeys does not reinstate a keyset that a refresh removed while its keys were in flight
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/wallet/KeyChain.ts:368:67
    */
   getKeysets(): Keyset[] {
     this.assertInitialized();
-    const unitKeysets = Object.values(this.keysets).filter((k) => k.unit === this.unit);
+    const unitKeysets = Object.values(this.keysets).filter((k) => false);
     if (unitKeysets.length === 0) {
       throw new CTSError(`No keysets found for unit: ${this.unit}`);
killedBy: KeyChain initialization should initialize with mint instance and load keys and keysets
statusReason: No keysets found for unit: sat

[Killed] EqualityOperator
src/wallet/KeyChain.ts:368:67
    */
   getKeysets(): Keyset[] {
     this.assertInitialized();
-    const unitKeysets = Object.values(this.keysets).filter((k) => k.unit === this.unit);
+    const unitKeysets = Object.values(this.keysets).filter((k) => k.unit !== this.unit);
     if (unitKeysets.length === 0) {
       throw new CTSError(`No keysets found for unit: ${this.unit}`);
killedBy: KeyChain initialization should initialize with mint instance and load keys and keysets
statusReason: No keysets found for unit: sat

[Killed] EqualityOperator
src/wallet/KeyChain.ts:385:36
   isUnitKeyset(id?: string): boolean {
     if (!id) return false;
     const keyset = this.keysets[id];
-    return keyset !== undefined && keyset.unit === this.unit;
+    return keyset !== undefined && keyset.unit !== this.unit;
   }
 
killedBy: receive across a rotation receives a pre-rotation token by loading the old keys once
statusReason: Proof has unrecognised keyset. '00bd033559de27d0' is not a sat keyset from this mint

[Killed] ConditionalExpression
src/wallet/KeyChain.ts:385:12
   isUnitKeyset(id?: string): boolean {
     if (!id) return false;
     const keyset = this.keysets[id];
-    return keyset !== undefined && keyset.unit === this.unit;
+    return false;
   }
 
killedBy: KeyChain getters getAllKeysetIds and getAllKeys span all units; getKeysets filters to wallet unit
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/wallet/KeyChain.ts:395:13
    * O(1) and non-throwing, unlike `getKeyset(id)`. False for an uninitialized chain.
    */
   hasKeyset(id?: string): boolean {
-    return !!id && this.keysets[id] !== undefined;
+    return !id && this.keysets[id] !== undefined;
   }
 
killedBy: rebind on refresh auto-bound wallet keeps its binding when the mint has no active replacement
statusReason: Wallet has no bound keyset. The mint may have no active keysets, or wallet was not initialized via loadMint or loadMintFromCache

[Killed] ConditionalExpression
src/wallet/KeyChain.ts:408:39
     this.assertInitialized();
     return Object.values(this.keysets)
       .map((k) => k.toMintKeys())
-      .filter((mk): mk is MintKeys => mk !== null);
+      .filter((mk): mk is MintKeys => false);
   }
 
killedBy: test wallet init should initialize with mint instance and load mint info, keys, and keysets
statusReason: expected [] to deeply equal [ { id: '00bd033559de27d0', …(5) } ]

[Killed] ArrowFunction
src/wallet/KeyChain.ts:438:15
     const metaList: MintKeyset[] = allKeysets.map((k) => k.toMintKeyset());
     const keysList: MintKeys[] = allKeysets
       .map((k) => k.toMintKeys())
-      .filter((mk): mk is MintKeys => mk !== null);
+      .filter(() => undefined);
     const cache = KeyChain.mintToCacheDTO(this.mint.mintUrl, metaList, keysList);
     // Reserializing restored data does not make it fresh: keep the provenance it came with.
killedBy: KeyChain initialization cache snapshots do not share key objects with the live keyset
statusReason: expected undefined to be defined
